
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "AIModule.h"
#include "AkAudio.h"
#include "BBQBackendServices.h"
#include "BBQCore.h"
#include "BBQInterface.h"
#include "BBQUtilities.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "EnhancedInput.h"
#include "GameplayAbilities.h"
#include "GameplayCameras.h"
#include "GameplayTags.h"
#include "GameplayTasks.h"
#include "GameplayVariables.h"
#include "LevelSequence.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "NavigationSystem.h"
#include "Niagara.h"
#include "OnlineSubsystemBBQ.h"
#include "PhysicsCore.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"

#pragma pack(push, 0x1)

class AABBQDismembermentActor;
class AAssetSelectionDebugActor;
class ABBQAbilityTarget_HeightenedSense;
class ABBQAbilityTarget_IKnowEngines;
class ABBQAbilityTarget_SenseActors;
class ABBQAbilityTarget_ThereTheyAre;
class ABBQBarbedWire;
class ABBQBarbedWireOnDoorFrame;
class ABBQBloodBucket;
class ABBQBloodPool;
class ABBQBoltholeBase;
class ABBQCar;
class ABBQCattleGridJunction;
class ABBQChainsawProp;
class ABBQCharacterBehaviour;

class UBBQMeleeComponent;
class UBBQMeleeHitFrameNotifyState;
class UBBQMinigameGameplayComponent;
class UBBQMinigameGameplayComponent_Interaction;
class UBBQMinigameSettingsV2;
class UBBQMinigameSettingsV2_Interaction;
class UBBQMinigameSettingsV2_SweetSpot;
class UBBQMinigameWidget;
class UBBQMovementDisorder;
class UBBQMovementDisorderComponent;
class UBBQMultiplayerMinigameManagerV2;
class UBBQNoiseOutlineComponent;
class UBBQNoiseSpottableInterface;
class UBBQNotifyState_ChainsawPendingOverheat;
class UBBQNotifyState_ChainsawRevvingDisabled;
class UBBQOutlineRenderer;
class UBBQPairedAnimationComponent;
class UBBQPerfumeBottleBreakNotifyState;
class UBBQPickupSpawnerComponent;
class UBBQPlayerCommandChannel;
class UBBQPlayerRpcChannel;
class UBBQPointOfInterestComponent;
class UBBQPointOfInterestLocatorComponent;
class UBBQSampleLevelSequencePlayer;
class UBBQScriptDebugger;
class UBBQSimpleCostCalculation;
class UBBQSkeletalMeshComponent;
class UBBQSneakAttackAreaComponent;
class UBBQSneakAttackKnifeNotifyState;
class UBBQSneakAttackNotifyState;
class UBBQSplineCameraVolumeComponent;
class UBBQSpringArmComponent;
class UBBQSpyAbilityHandlerComponent;
class UBBQStarSignAbility;
class UBBQStudyAndTamperAbility;
class UBBQStudyAndTamperComponent;
class UBBQStudyAndTamperObjectComponent;
class UBBQStudyAndTamperObjectInterface;
class UBBQTestRPCChannel;
class UBBQTimeOfDayLevelStreamingSubsystem;
class UBBQTraversalInterface;
class UBBQTriggerAreaComponent;
class UBBQVictimTrackerComponent;
class UBBQViewTargetManagerComponent;
class UBBQWindowSmashVFX;
class UBBQWorldOutlineInfoComponent;
class UBBQWrenchAttackNotifyState;
class UCharacterCameraShakesConfig;
class UCloseGrabWindowAnimNotifyState;
class UDamageDiscoveredVictimAnimNotifyState;
class UDamageGrabbedVictimAnimNotifyState;
class UDisableInterruptSearchSuccessAnimNotifyState;
class UEnterHidingSpotLoopAnimNotifyState;
class UFollowToHidingCameraAnimNotifyState;
class UGenerateDialogGameplayTagsCommandlet;
class UGrabItemAnimNotifyState;
class UHarvestIntoEndedAnimNotifyState;
class UHarvestOutEndedAnimNotifyState;
class UHoldItemAnimNotifyState;
class UIncapResponseTable;
class UInventoryTagMapping;
class ULadderClimbIntoBottomCorrectionNotifyState;
class ULadderClimbIntoTopCorrectionNotifyState;
class ULadderFootingAnimNotify;
class ULadderGrabWindowAnimNotifyState;
class ULocksContainer;
class UMeleeAttackVisualiserComponent;
class UOpenGrabWindowAnimNotifyState;
class UPairedAnimationDisableElevationFixNotifyState;
class UPairedAnimationDisablePositionLockingNotifyState;
class UPairedAnimationEnableElevationFixNotifyState;
class UPairedAnimationEndEarlyNotifyState;
class UPickupZones;
class UResetCameraOverrideStateAnimNotify;
class UUBBQAbilityDodge;
class UVictimRestraintEndedAnimNotifyState;
class UVisualDamageInstigatorComponent;
class UVisualDamageInteractionMappingAsset;
class UVisualDamageReceiverComponent;

/// Enum /Script/BBQGameSession.EEndMinigameReason
/// Size: 0x01 (1 bytes)
enum class EEndMinigameReason : uint8_t
{
	EEndMinigameReason__Invalid                                                      = 0,
	EEndMinigameReason__Success                                                      = 1,
	EEndMinigameReason__Fail                                                         = 2,
	EEndMinigameReason__Cancel                                                       = 3,
	EEndMinigameReason__Incapacitated                                                = 4,
	EEndMinigameReason__Interrupt                                                    = 5
};

/// Enum /Script/BBQGameSession.ENoiseType
/// Size: 0x01 (1 bytes)
enum class ENoiseType : uint8_t
{
	ENoiseType__Footstep                                                             = 0,
	ENoiseType__Door                                                                 = 1,
	ENoiseType__Attack                                                               = 2
};

/// Enum /Script/BBQGameSession.EBBQPairedAnimRoleTransformRule
/// Size: 0x01 (1 bytes)
enum class EBBQPairedAnimRoleTransformRule : uint8_t
{
	EBBQPairedAnimRoleTransformRule__INVALID                                         = 0,
	EBBQPairedAnimRoleTransformRule__FixedOffsetOnStart                              = 1,
	EBBQPairedAnimRoleTransformRule__ContinuouslyUpdateOffset                        = 2,
	EBBQPairedAnimRoleTransformRule__NoOffset                                        = 3
};

/// Enum /Script/BBQGameSession.EBBQPairedAnimRole
/// Size: 0x01 (1 bytes)
enum class EBBQPairedAnimRole : uint8_t
{
	EBBQPairedAnimRole__None                                                         = 0,
	EBBQPairedAnimRole__Leader                                                       = 1,
	EBBQPairedAnimRole__Follower                                                     = 2
};

/// Enum /Script/BBQGameSession.EChainsawState
/// Size: 0x01 (1 bytes)
enum class EChainsawState : uint8_t
{
	EChainsawState__Off                                                              = 0,
	EChainsawState__TurningOn                                                        = 1,
	EChainsawState__On                                                               = 2,
	EChainsawState__Overheated                                                       = 3,
	EChainsawState__Stalled                                                          = 4,
	EChainsawState__INIT                                                             = 6
};

/// Enum /Script/BBQGameSession.ECloseEncounterState
/// Size: 0x01 (1 bytes)
enum class ECloseEncounterState : uint8_t
{
	ECloseEncounterState__INVALID                                                    = 0,
	ECloseEncounterState__Start                                                      = 1,
	ECloseEncounterState__InProgress                                                 = 2,
	ECloseEncounterState__InProgress_AttackerWinning                                 = 3,
	ECloseEncounterState__AttackerWin                                                = 4,
	ECloseEncounterState__DefenderWin                                                = 5,
	ECloseEncounterState__DefenderRescued                                            = 6,
	ECloseEncounterState__GenericInterruption                                        = 7
};

/// Enum /Script/BBQGameSession.EBBQElectroTrapState
/// Size: 0x01 (1 bytes)
enum class EBBQElectroTrapState : uint8_t
{
	EBBQElectroTrapState__NoBattery                                                  = 0,
	EBBQElectroTrapState__Activated                                                  = 1,
	EBBQElectroTrapState__Deactivated                                                = 2
};

/// Enum /Script/BBQGameSession.EInteractionMethod
/// Size: 0x01 (1 bytes)
enum class EInteractionMethod : uint8_t
{
	EInteractionMethod__Primary                                                      = 0,
	EInteractionMethod__Secondary                                                    = 1,
	EInteractionMethod__Attack                                                       = 2,
	EInteractionMethod__PerkAbility                                                  = 3,
	EInteractionMethod__Special                                                      = 4,
	EInteractionMethod__Inventory                                                    = 5
};

/// Enum /Script/BBQGameSession.EBBQElectroTrapInteraction
/// Size: 0x01 (1 bytes)
enum class EBBQElectroTrapInteraction : uint8_t
{
	EBBQElectroTrapInteraction__Add                                                  = 0,
	EBBQElectroTrapInteraction__Remove                                               = 1,
	EBBQElectroTrapInteraction__Enable                                               = 2,
	EBBQElectroTrapInteraction__Disable                                              = 3
};

/// Enum /Script/BBQGameSession.EHidingSpotType
/// Size: 0x01 (1 bytes)
enum class EHidingSpotType : uint8_t
{
	EHidingSpotType__None                                                            = 0,
	EHidingSpotType__Freezer                                                         = 1,
	EHidingSpotType__Locker                                                          = 2,
	EHidingSpotType__Trunk                                                           = 4,
	EHidingSpotType__CarTrunk                                                        = 8,
	EHidingSpotType__Wardrobe                                                        = 16
};

/// Enum /Script/BBQGameSession.EBBQHidingPlayerState
/// Size: 0x01 (1 bytes)
enum class EBBQHidingPlayerState : uint8_t
{
	EBBQHidingPlayerState__None                                                      = 0,
	EBBQHidingPlayerState__EnteringHidingSpot                                        = 1,
	EBBQHidingPlayerState__Hidden                                                    = 2,
	EBBQHidingPlayerState__Leaving_Interaction                                       = 3,
	EBBQHidingPlayerState__Leaving_Dying                                             = 4,
	EBBQHidingPlayerState__Leaving_BurstOut                                          = 5,
	EBBQHidingPlayerState__Leaving_DraggedOut                                        = 6,
	EBBQHidingPlayerState__Leaving_Grabbed                                           = 7
};

/// Enum /Script/BBQGameSession.EBBQBehaviourDispatchType
/// Size: 0x01 (1 bytes)
enum class EBBQBehaviourDispatchType : uint8_t
{
	EBBQBehaviourDispatchType__OwningClientOnly                                      = 0,
	EBBQBehaviourDispatchType__ServerAndAllClients                                   = 1,
	EBBQBehaviourDispatchType__ServerOnly                                            = 2
};

/// Enum /Script/BBQGameSession.EBBQHitReactionDirection
/// Size: 0x01 (1 bytes)
enum class EBBQHitReactionDirection : uint8_t
{
	EBBQHitReactionDirection__Front                                                  = 0,
	EBBQHitReactionDirection__FrontLeft                                              = 1,
	EBBQHitReactionDirection__FrontRight                                             = 2,
	EBBQHitReactionDirection__Left                                                   = 3,
	EBBQHitReactionDirection__Right                                                  = 4,
	EBBQHitReactionDirection__BackLeft                                               = 5,
	EBBQHitReactionDirection__BackRight                                              = 6,
	EBBQHitReactionDirection__Back                                                   = 7
};

/// Enum /Script/BBQGameSession.ESpyAbilityPhase
/// Size: 0x01 (1 bytes)
enum class ESpyAbilityPhase : uint8_t
{
	ESpyAbilityPhase__OwnerView                                                      = 0,
	ESpyAbilityPhase__FadeFromOwner                                                  = 1,
	ESpyAbilityPhase__FadeToVictim                                                   = 2,
	ESpyAbilityPhase__VictimView                                                     = 3,
	ESpyAbilityPhase__FadeFromVictim                                                 = 4,
	ESpyAbilityPhase__FadeToOwner                                                    = 5,
	ESpyAbilityPhase__Count                                                          = 6
};

/// Enum /Script/BBQGameSession.EDodgeDirection
/// Size: 0x01 (1 bytes)
enum class EDodgeDirection : uint8_t
{
	EDodgeDirection__None                                                            = 0,
	EDodgeDirection__Front                                                           = 1,
	EDodgeDirection__Back                                                            = 2,
	EDodgeDirection__Left                                                            = 3,
	EDodgeDirection__Right                                                           = 4
};

/// Enum /Script/BBQGameSession.EBBQStationaryTransitionType
/// Size: 0x01 (1 bytes)
enum class EBBQStationaryTransitionType : uint8_t
{
	EBBQStationaryTransitionType__None                                               = 0,
	EBBQStationaryTransitionType__Breakout                                           = 1,
	EBBQStationaryTransitionType__Blend                                              = 2
};

/// Enum /Script/BBQGameSession.EBBQComboType
/// Size: 0x01 (1 bytes)
enum class EBBQComboType : uint8_t
{
	EBBQComboType__Never                                                             = 0,
	EBBQComboType__Notifies                                                          = 1
};

/// Enum /Script/BBQGameSession.EBBQLockOnType
/// Size: 0x01 (1 bytes)
enum class EBBQLockOnType : uint8_t
{
	EBBQLockOnType__Always                                                           = 0,
	EBBQLockOnType__Notifies                                                         = 1
};

/// Enum /Script/BBQGameSession.EBBQComboState
/// Size: 0x01 (1 bytes)
enum class EBBQComboState : uint8_t
{
	ComboNotAttempted                                                                = 0,
	ComboMissed                                                                      = 1,
	ComboHit                                                                         = 2
};

/// Enum /Script/BBQGameSession.EBBQMeleeAttackState
/// Size: 0x01 (1 bytes)
enum class EBBQMeleeAttackState : uint8_t
{
	AttackInProgress                                                                 = 0,
	AttackHit                                                                        = 1,
	AttackMissed                                                                     = 2,
	AttackInternalCancel                                                             = 3
};

/// Enum /Script/BBQGameSession.EBBQAnimSelectionMethod
/// Size: 0x01 (1 bytes)
enum class EBBQAnimSelectionMethod : uint8_t
{
	EBBQAnimSelectionMethod__Sequence                                                = 0,
	EBBQAnimSelectionMethod__RandomAfterFirst                                        = 1,
	EBBQAnimSelectionMethod__Random                                                  = 2
};

/// Enum /Script/BBQGameSession.EBBQMeleeAttackHitFrameType
/// Size: 0x01 (1 bytes)
enum class EBBQMeleeAttackHitFrameType : uint8_t
{
	EBBQMeleeAttackHitFrameType__DamageEnabled                                       = 0,
	EBBQMeleeAttackHitFrameType__EarlyOutOnHitEnabled                                = 1,
	EBBQMeleeAttackHitFrameType__EarlyOutOnMissEnabled                               = 2,
	EBBQMeleeAttackHitFrameType__EarlyOutOnMoveEnabled                               = 3,
	EBBQMeleeAttackHitFrameType__LockOnEnabled                                       = 4,
	EBBQMeleeAttackHitFrameType__ComboEnabled                                        = 5,
	EBBQMeleeAttackHitFrameType__RepeatEnabled                                       = 6
};

/// Enum /Script/BBQGameSession.EBarbedWireOutlineVisibility
/// Size: 0x01 (1 bytes)
enum class EBarbedWireOutlineVisibility : uint8_t
{
	EBarbedWireOutlineVisibility__Disabled                                           = 0,
	EBarbedWireOutlineVisibility__BarbedWireOwner                                    = 1,
	EBarbedWireOutlineVisibility__FamilyMembers                                      = 2,
	EBarbedWireOutlineVisibility__Victims                                            = 3,
	EBarbedWireOutlineVisibility__All                                                = 4
};

/// Enum /Script/BBQGameSession.EBarbedWireState
/// Size: 0x01 (1 bytes)
enum class EBarbedWireState : uint8_t
{
	EBarbedWireState__None                                                           = 0,
	EBarbedWireState__Set                                                            = 1,
	EBarbedWireState__Trampled                                                       = 2,
	EBarbedWireState__Cut                                                            = 3,
	EBarbedWireState__Tangled                                                        = 4
};

/// Enum /Script/BBQGameSession.EBoltholeFlags
/// Size: 0x01 (1 bytes)
enum class EBoltholeFlags : uint8_t
{
	EBoltholeFlags__None                                                             = 0,
	EBoltholeFlags__BeingOpened                                                      = 1,
	EBoltholeFlags__BarbWire                                                         = 2,
	EBoltholeFlags__Barricading                                                      = 4,
	EBoltholeFlags__Destroying                                                       = 8,
	EBoltholeFlags__Opened                                                           = 16,
	EBoltholeFlags__Closed                                                           = 32,
	EBoltholeFlags__Destroyed                                                        = 128,
	EBoltholeFlags__Default                                                          = 0
};

/// Enum /Script/BBQGameSession.EBoltholeState
/// Size: 0x01 (1 bytes)
enum class EBoltholeState : uint8_t
{
	EBoltholeState__NONE                                                             = 0,
	EBoltholeState__OPENED                                                           = 1,
	EBoltholeState__CLOSED                                                           = 2,
	EBoltholeState__DESTROYED                                                        = 3
};

/// Enum /Script/BBQGameSession.EBBQLockOnTargetProvider
/// Size: 0x01 (1 bytes)
enum class EBBQLockOnTargetProvider : uint8_t
{
	ForcedMovement                                                                   = 0,
	Melee                                                                            = 1,
	Count                                                                            = 2
};

/// Enum /Script/BBQGameSession.EBBQCloseEncounterHitFrameType
/// Size: 0x01 (1 bytes)
enum class EBBQCloseEncounterHitFrameType : uint8_t
{
	EBBQCloseEncounterHitFrameType__ApplyEffects                                     = 0,
	EBBQCloseEncounterHitFrameType__ApplyEffectsToOpponent                           = 1
};

/// Enum /Script/BBQGameSession.ECERole
/// Size: 0x01 (1 bytes)
enum class ECERole : uint8_t
{
	ECERole__ECERole_None                                                            = 0,
	ECERole__ECERole_Attacker                                                        = 1,
	ECERole__ECERole_Defender                                                        = 2
};

/// Enum /Script/BBQGameSession.ECloseEncounterWinnerSelection
/// Size: 0x01 (1 bytes)
enum class ECloseEncounterWinnerSelection : uint8_t
{
	ECloseEncounterWinnerSelection__Minigame                                         = 0,
	ECloseEncounterWinnerSelection__AttackerAlwaysWins                               = 1,
	ECloseEncounterWinnerSelection__DefenderAlwaysWins                               = 2
};

/// Enum /Script/BBQGameSession.EBBQIncapacitationReason
/// Size: 0x01 (1 bytes)
enum class EBBQIncapacitationReason : uint8_t
{
	EBBQIncapacitationReason__Invalid                                                = 0,
	EBBQIncapacitationReason__Melee                                                  = 1,
	EBBQIncapacitationReason__BleedOut                                               = 2
};

/// Enum /Script/BBQGameSession.EBBQComm_TriggeredBy
/// Size: 0x01 (1 bytes)
enum class EBBQComm_TriggeredBy : uint8_t
{
	EBBQComm_TriggeredBy__Everyone                                                   = 0,
	EBBQComm_TriggeredBy__FamilyMembers                                              = 1,
	EBBQComm_TriggeredBy__Victims                                                    = 2
};

/// Enum /Script/BBQGameSession.ECommExecFailReason
/// Size: 0x01 (1 bytes)
enum class ECommExecFailReason : uint8_t
{
	ECommExecFailReason__None                                                        = 0,
	ECommExecFailReason__GlobalCooldown                                              = 1,
	ECommExecFailReason__CharacterCooldown                                           = 2,
	ECommExecFailReason__Probability                                                 = 3,
	ECommExecFailReason__PoolExhausted                                               = 4,
	ECommExecFailReason__CharacterIsInDanger                                         = 5,
	ECommExecFailReason__CannotFindAddressee                                         = 6,
	ECommExecFailReason__InvalidLineIndex                                            = 7,
	ECommExecFailReason__RequiredTags                                                = 8,
	ECommExecFailReason__BlockedTags                                                 = 9,
	ECommExecFailReason__UNKNOWN                                                     = 10
};

/// Enum /Script/BBQGameSession.ECommVocalisationType
/// Size: 0x01 (1 bytes)
enum class ECommVocalisationType : uint8_t
{
	ECommVocalisationType__Muttered                                                  = 0,
	ECommVocalisationType__Spoken                                                    = 1,
	ECommVocalisationType__Shouted                                                   = 2,
	ECommVocalisationType__Screamed                                                  = 3
};

/// Enum /Script/BBQGameSession.ECommBroadcastRule
/// Size: 0x01 (1 bytes)
enum class ECommBroadcastRule : uint8_t
{
	ECommBroadcastRule__Self                                                         = 0,
	ECommBroadcastRule__Team                                                         = 1,
	ECommBroadcastRule__All                                                          = 2
};

/// Enum /Script/BBQGameSession.EDoorAction
/// Size: 0x01 (1 bytes)
enum class EDoorAction : uint8_t
{
	EDoorAction__Invalid                                                             = 0,
	EDoorAction__Open                                                                = 1,
	EDoorAction__Close                                                               = 2,
	EDoorAction__Unlock                                                              = 3,
	EDoorAction__Lock                                                                = 4,
	EDoorAction__Latch                                                               = 5,
	EDoorAction__Unlatch                                                             = 6,
	EDoorAction__SprintOpen                                                          = 7,
	EDoorAction__SprintClose                                                         = 8,
	EDoorAction__Damage                                                              = 9,
	EDoorAction__Destroy                                                             = 10,
	EDoorAction__AddLock                                                             = 11,
	EDoorAction__RecoverLock                                                         = 12,
	EDoorAction__RetrieveLockAfterBarge                                              = 13,
	EDoorAction__Barge                                                               = 14
};

/// Enum /Script/BBQGameSession.EDoorSide
/// Size: 0x01 (1 bytes)
enum class EDoorSide : uint8_t
{
	EDoorSide__Invalid                                                               = 0,
	EDoorSide__Front                                                                 = 1,
	EDoorSide__Rear                                                                  = 2
};

/// Enum /Script/BBQGameSession.EDoorDirection
/// Size: 0x01 (1 bytes)
enum class EDoorDirection : uint8_t
{
	EDoorDirection__Invalid                                                          = 0,
	EDoorDirection__Inwards                                                          = 1,
	EDoorDirection__Outwards                                                         = 2,
	EDoorDirection__Left                                                             = 3,
	EDoorDirection__Right                                                            = 4
};

/// Enum /Script/BBQGameSession.EDoorState
/// Size: 0x01 (1 bytes)
enum class EDoorState : uint8_t
{
	EDoorState__None                                                                 = 0,
	EDoorState__Default                                                              = 0,
	EDoorState__Open                                                                 = 1,
	EDoorState__Physics                                                              = 2,
	EDoorState__Animating                                                            = 4,
	EDoorState__Barged                                                               = 8,
	EDoorState__Latch                                                                = 16,
	EDoorState__Cooldown                                                             = 32,
	EDoorState__Frozen                                                               = 64,
	EDoorState__Destroyed                                                            = 128,
	EDoorState__PreventLock                                                          = 237
};

/// Enum /Script/BBQGameSession.EBBQDoorSlicerDefaultVFXDir
/// Size: 0x01 (1 bytes)
enum class EBBQDoorSlicerDefaultVFXDir : uint8_t
{
	EBBQDoorSlicerDefaultVFXDir__Forward                                             = 0,
	EBBQDoorSlicerDefaultVFXDir__Right                                               = 1,
	EBBQDoorSlicerDefaultVFXDir__Up                                                  = 2
};

/// Enum /Script/BBQGameSession.EAttackDirectionReference
/// Size: 0x01 (1 bytes)
enum class EAttackDirectionReference : uint8_t
{
	EAttackDirectionReference__PlayerForward                                         = 0,
	EAttackDirectionReference__ImpactNormal                                          = 1
};

/// Enum /Script/BBQGameSession.EEscapeZoneType
/// Size: 0x01 (1 bytes)
enum class EEscapeZoneType : uint8_t
{
	EEscapeZoneType__Invalid                                                         = 0,
	EEscapeZoneType__Road                                                            = 1,
	EEscapeZoneType__RearGate                                                        = 2,
	EEscapeZoneType__FuseBox                                                         = 3,
	EEscapeZoneType__PressureValve                                                   = 4
};

/// Enum /Script/BBQGameSession.EFuseboxAction
/// Size: 0x01 (1 bytes)
enum class EFuseboxAction : uint8_t
{
	EFuseboxAction__None                                                             = 0,
	EFuseboxAction__OpenCabinet                                                      = 1,
	EFuseboxAction__PlaceFuse                                                        = 2,
	EFuseboxAction__FixFusebox                                                       = 3,
	EFuseboxAction__TurnOn                                                           = 4,
	EFuseboxAction__TurnOff                                                          = 5
};

/// Enum /Script/BBQGameSession.EFuseBoxState
/// Size: 0x01 (1 bytes)
enum class EFuseBoxState : uint8_t
{
	EFuseBoxState__Invalid                                                           = 0,
	EFuseBoxState__Open                                                              = 1,
	EFuseBoxState__HasFuse                                                           = 2,
	EFuseBoxState__Fixed                                                             = 4,
	EFuseBoxState__On                                                                = 8
};

/// Enum /Script/BBQGameSession.EBBQHUDVisibleGroup
/// Size: 0x01 (1 bytes)
enum class EBBQHUDVisibleGroup : uint8_t
{
	EBBQHUDVisibleGroup__None                                                        = 0,
	EBBQHUDVisibleGroup__RequiredOnly                                                = 1,
	EBBQHUDVisibleGroup__Cutscene                                                    = 2,
	EBBQHUDVisibleGroup__InputPromptsOnly                                            = 3,
	EBBQHUDVisibleGroup__NancyAbility                                                = 4,
	EBBQHUDVisibleGroup__All                                                         = 5,
	EBBQHUDVisibleGroup__Count                                                       = 6
};

/// Enum /Script/BBQGameSession.EBBQNotificationType
/// Size: 0x01 (1 bytes)
enum class EBBQNotificationType : uint8_t
{
	EBBQNotificationType__None                                                       = 0,
	EBBQNotificationType__SideNotification                                           = 1,
	EBBQNotificationType__CentralNotification                                        = 2,
	EBBQNotificationType__FailNotification                                           = 3
};

/// Enum /Script/BBQGameSession.EGameplayActivityEventReceiver
/// Size: 0x01 (1 bytes)
enum class EGameplayActivityEventReceiver : uint8_t
{
	EGameplayActivityEventReceiver__None                                             = 0,
	EGameplayActivityEventReceiver__Instigator                                       = 1,
	EGameplayActivityEventReceiver__AllFamilyMembers                                 = 2,
	EGameplayActivityEventReceiver__AllVictims                                       = 3,
	EGameplayActivityEventReceiver__Everyone                                         = 4,
	EGameplayActivityEventReceiver__AllFamilyMembersExceptInstigator                 = 5,
	EGameplayActivityEventReceiver__AllVictimsExceptInstigator                       = 6,
	EGameplayActivityEventReceiver__EveryoneExceptInstigator                         = 7
};

/// Enum /Script/BBQGameSession.EBBQPerformingTraversalSection
/// Size: 0x01 (1 bytes)
enum class EBBQPerformingTraversalSection : uint8_t
{
	EBBQPerformingTraversalSection__None                                             = 0,
	EBBQPerformingTraversalSection__Intro                                            = 1,
	EBBQPerformingTraversalSection__Main                                             = 2,
	EBBQPerformingTraversalSection__Outro                                            = 3
};

/// Enum /Script/BBQGameSession.EBBQPerformingTraversalType
/// Size: 0x01 (1 bytes)
enum class EBBQPerformingTraversalType : uint8_t
{
	EBBQPerformingTraversalType__None                                                = 0,
	EBBQPerformingTraversalType__PerformingTraversal                                 = 1,
	EBBQPerformingTraversalType__PerformingFastTraversal                             = 2
};

/// Enum /Script/BBQGameSession.EBBQClimbingLadderState
/// Size: 0x01 (1 bytes)
enum class EBBQClimbingLadderState : uint8_t
{
	EBBQClimbingLadderState__Invalid                                                 = 0,
	EBBQClimbingLadderState__EnteringBottom                                          = 1,
	EBBQClimbingLadderState__EnteringTop                                             = 2,
	EBBQClimbingLadderState__ClimbingUp                                              = 3,
	EBBQClimbingLadderState__ClimbingDown                                            = 4,
	EBBQClimbingLadderState__ExitingTop                                              = 5,
	EBBQClimbingLadderState__ExitingBottom                                           = 6
};

/// Enum /Script/BBQGameSession.EBBQAnimatedMontageType
/// Size: 0x01 (1 bytes)
enum class EBBQAnimatedMontageType : uint8_t
{
	EBBQAnimatedMontageType__Invalid                                                 = 0,
	EBBQAnimatedMontageType__Ragdoll                                                 = 1,
	EBBQAnimatedMontageType__DisableMovement                                         = 2,
	EBBQAnimatedMontageType__JumpToSection                                           = 3
};

/// Enum /Script/BBQGameSession.EBBQUsingFromWellState
/// Size: 0x01 (1 bytes)
enum class EBBQUsingFromWellState : uint8_t
{
	EBBQUsingFromWellState__Invalid                                                  = 0,
	EBBQUsingFromWellState__EnteringWell                                             = 1,
	EBBQUsingFromWellState__EnteredWell                                              = 2,
	EBBQUsingFromWellState__FallingFromWell                                          = 3
};

/// Enum /Script/BBQGameSession.EDraggingState
/// Size: 0x01 (1 bytes)
enum class EDraggingState : uint8_t
{
	EDraggingState__Invalid                                                          = 0,
	EDraggingState__Pickup_Started                                                   = 1,
	EDraggingState__Pickup_Ended                                                     = 2,
	EDraggingState__ContextualKill_Execution                                         = 3
};

/// Enum /Script/BBQGameSession.EBBQWindowDamageType
/// Size: 0x01 (1 bytes)
enum class EBBQWindowDamageType : uint8_t
{
	EBBQWindowDamageType__PlayerFallDamage                                           = 0,
	EBBQWindowDamageType__PlayerFallDamage_1stfloor                                  = 1,
	EBBQWindowDamageType__BreakWindowDamage                                          = 2
};

/// Enum /Script/BBQGameSession.EBBQAnimationState
/// Size: 0x01 (1 bytes)
enum class EBBQAnimationState : uint8_t
{
	EBBQAnimationState__Idle                                                         = 0,
	EBBQAnimationState__StoppedSidling                                               = 1,
	EBBQAnimationState__StartedSidling                                               = 2,
	EBBQAnimationState__StartedSidlingLeft                                           = 3,
	EBBQAnimationState__StartedSidlingRight                                          = 4,
	EBBQAnimationState__StartedClimbingLadderUp                                      = 5,
	EBBQAnimationState__StoppedClimbingLadderUp                                      = 6,
	EBBQAnimationState__StartedClimbingLadderDown                                    = 7,
	EBBQAnimationState__StoppedClimbingLadderDown                                    = 8,
	EBBQAnimationState__StartedEnteringWell                                          = 9,
	EBBQAnimationState__StartedFallingFromWell                                       = 10
};

/// Enum /Script/BBQGameSession.EBBQExecutionState
/// Size: 0x01 (1 bytes)
enum class EBBQExecutionState : uint8_t
{
	EBBQExecutionState__Invalid                                                      = 0,
	EBBQExecutionState__ExecutedWithTransition                                       = 1,
	EBBQExecutionState__ExecutingWithTransition                                      = 2,
	EBBQExecutionState__Executed                                                     = 3,
	EBBQExecutionState__Executing                                                    = 4
};

/// Enum /Script/BBQGameSession.EBBQDoorAction
/// Size: 0x01 (1 bytes)
enum class EBBQDoorAction : uint8_t
{
	EBBQDoorAction__Invalid                                                          = 0,
	EBBQDoorAction__Open                                                             = 1,
	EBBQDoorAction__Close                                                            = 2,
	EBBQDoorAction__Destroy                                                          = 3,
	EBBQDoorAction__WinDestroy                                                       = 4,
	EBBQDoorAction__LockUp                                                           = 5,
	EBBQDoorAction__Barge                                                            = 6,
	EBBQDoorAction__Latch                                                            = 7,
	EBBQDoorAction__Unlatch                                                          = 8
};

/// Enum /Script/BBQGameSession.EBBQCustomMovementMode
/// Size: 0x01 (1 bytes)
enum class EBBQCustomMovementMode : uint8_t
{
	EBBQCustomMovementMode__Climbing                                                 = 0,
	EBBQCustomMovementMode__Sidling                                                  = 1
};

/// Enum /Script/BBQGameSession.EBBQ_MatchResult
/// Size: 0x01 (1 bytes)
enum class EBBQ_MatchResult : uint8_t
{
	EBBQ_MatchResult__VICTIMS_WIN                                                    = 0,
	EBBQ_MatchResult__FAMILY_WIN                                                     = 1,
	EBBQ_MatchResult__NOBODY_WINS                                                    = 2
};

/// Enum /Script/BBQGameSession.ETraversalType
/// Size: 0x01 (1 bytes)
enum class ETraversalType : uint8_t
{
	ETraversalType__None                                                             = 0,
	ETraversalType__Bolthole                                                         = 1,
	ETraversalType__Sidle                                                            = 2,
	ETraversalType__Ladder                                                           = 4
};

/// Enum /Script/BBQGameSession.EGrandpaPerceptionReason
/// Size: 0x01 (1 bytes)
enum class EGrandpaPerceptionReason : uint8_t
{
	EGrandpaPerceptionReason__None                                                   = 0,
	EGrandpaPerceptionReason__SneakAttackArea                                        = 1,
	EGrandpaPerceptionReason__AlertArea                                              = 2,
	EGrandpaPerceptionReason__Vision                                                 = 4
};

/// Enum /Script/BBQGameSession.EGrandpaSonarState
/// Size: 0x01 (1 bytes)
enum class EGrandpaSonarState : uint8_t
{
	EGrandpaSonarState__NotActivated                                                 = 0,
	EGrandpaSonarState__ActivatedInGracePeriod                                       = 1,
	EGrandpaSonarState__ActivatedScreaming                                           = 2,
	EGrandpaSonarState__ActivatedFully                                               = 3
};

/// Enum /Script/BBQGameSession.EGrandpaState
/// Size: 0x01 (1 bytes)
enum class EGrandpaState : uint8_t
{
	EGrandpaState__Sleeping                                                          = 0,
	EGrandpaState__Ready                                                             = 1,
	EGrandpaState__Cooldown                                                          = 2,
	EGrandpaState__Incapacitated                                                     = 3,
	EGrandpaState__Alerted                                                           = 4,
	EGrandpaState__HalfAlerted                                                       = 5,
	EGrandpaState__FeedBlood                                                         = 6,
	EGrandpaState__FeedBloodIncapacitated                                            = 7
};

/// Enum /Script/BBQGameSession.EHarvestOutcome
/// Size: 0x01 (1 bytes)
enum class EHarvestOutcome : uint8_t
{
	EHarvestOutcome__VictimSuccess                                                   = 0,
	EHarvestOutcome__FamilySuccess_BloodLet                                          = 1,
	EHarvestOutcome__FamilySuccess_Execution                                         = 2,
	EHarvestOutcome__VictimLeftMatch                                                 = 3,
	EHarvestOutcome__FamilyLeftMatch                                                 = 4,
	EHarvestOutcome__FamilyStunned                                                   = 5
};

/// Enum /Script/BBQGameSession.EInteractionEventTest_Hintable
/// Size: 0x01 (1 bytes)
enum class EInteractionEventTest_Hintable : uint8_t
{
	EInteractionEventTest_Hintable__CustomConditions                                 = 0,
	EInteractionEventTest_Hintable__NoForbiddenTags                                  = 1,
	EInteractionEventTest_Hintable__AllRequiredTags                                  = 2,
	EInteractionEventTest_Hintable__AllRequiredItems                                 = 3,
	EInteractionEventTest_Hintable__NotInUse                                         = 4
};

/// Enum /Script/BBQGameSession.EInteractionEventTest_Soft
/// Size: 0x01 (1 bytes)
enum class EInteractionEventTest_Soft : uint8_t
{
	EInteractionEventTest_Soft__AttackBlock                                          = 0,
	EInteractionEventTest_Soft__InRange                                              = 1,
	EInteractionEventTest_Soft__Alignment                                            = 2,
	EInteractionEventTest_Soft__CustomConditions                                     = 3
};

/// Enum /Script/BBQGameSession.EInteractionEventTest_Hard
/// Size: 0x01 (1 bytes)
enum class EInteractionEventTest_Hard : uint8_t
{
	EInteractionEventTest_Hard__Enabled                                              = 0,
	EInteractionEventTest_Hard__ValidInstigator                                      = 1,
	EInteractionEventTest_Hard__CorrectTeam                                          = 2,
	EInteractionEventTest_Hard__NoForbiddenTagsOnOwner                               = 3,
	EInteractionEventTest_Hard__AllRequiredTagsOnOwner                               = 4,
	EInteractionEventTest_Hard__AlreadyUsing                                         = 5,
	EInteractionEventTest_Hard__CustomConditions                                     = 6
};

/// Enum /Script/BBQGameSession.EInteractionTest_Soft
/// Size: 0x01 (1 bytes)
enum class EInteractionTest_Soft : uint8_t
{
	EInteractionTest_Soft__InRange                                                   = 0,
	EInteractionTest_Soft__PositionCheck                                             = 1,
	EInteractionTest_Soft__AngleRangeCheck                                           = 2
};

/// Enum /Script/BBQGameSession.EInteractionTest_Hard
/// Size: 0x01 (1 bytes)
enum class EInteractionTest_Hard : uint8_t
{
	EInteractionTest_Hard__Enabled                                                   = 0,
	EInteractionTest_Hard__LineOfSight                                               = 1
};

/// Enum /Script/BBQGameSession.EInteractionTestSeverity
/// Size: 0x01 (1 bytes)
enum class EInteractionTestSeverity : uint8_t
{
	EInteractionTestSeverity__Hard                                                   = 0,
	EInteractionTestSeverity__Soft                                                   = 1,
	EInteractionTestSeverity__Hintable                                               = 2
};

/// Enum /Script/BBQGameSession.EInteractionEventPromptType
/// Size: 0x01 (1 bytes)
enum class EInteractionEventPromptType : uint8_t
{
	EInteractionEventPromptType__WorldSpace                                          = 0,
	EInteractionEventPromptType__HUD                                                 = 1
};

/// Enum /Script/BBQGameSession.EInteractionEventNotifyType
/// Size: 0x01 (1 bytes)
enum class EInteractionEventNotifyType : uint8_t
{
	EInteractionEventNotifyType__ServerOnly                                          = 0,
	EInteractionEventNotifyType__ServerAndAllClients                                 = 1
};

/// Enum /Script/BBQGameSession.EInteractionAlignment
/// Size: 0x01 (1 bytes)
enum class EInteractionAlignment : uint8_t
{
	EInteractionAlignment__None                                                      = 0,
	EInteractionAlignment__PosXAxis                                                  = 1,
	EInteractionAlignment__NegXAxis                                                  = 2,
	EInteractionAlignment__EitherXAxis                                               = 3,
	EInteractionAlignment__PosYAxis                                                  = 4,
	EInteractionAlignment__NegYAxis                                                  = 5,
	EInteractionAlignment__EitherYAxis                                               = 6,
	EInteractionAlignment__Centre                                                    = 7
};

/// Enum /Script/BBQGameSession.ELightSourceState
/// Size: 0x01 (1 bytes)
enum class ELightSourceState : uint8_t
{
	ELightSourceState__Invalid                                                       = 0,
	ELightSourceState__Off                                                           = 1,
	ELightSourceState__On                                                            = 2,
	ELightSourceState__Trapped                                                       = 3,
	ELightSourceState__Exploded                                                      = 4
};

/// Enum /Script/BBQGameSession.ELadderInteractionState
/// Size: 0x01 (1 bytes)
enum class ELadderInteractionState : uint8_t
{
	ELadderInteractionState__Invalid                                                 = 0,
	ELadderInteractionState__Unfold                                                  = 1
};

/// Enum /Script/BBQGameSession.EBBQLadderDismountType
/// Size: 0x01 (1 bytes)
enum class EBBQLadderDismountType : uint8_t
{
	EBBQLadderDismountType__None                                                     = 0,
	EBBQLadderDismountType__Low                                                      = 1,
	EBBQLadderDismountType__High                                                     = 2
};

/// Enum /Script/BBQGameSession.EBBQLadderDismountReason
/// Size: 0x01 (1 bytes)
enum class EBBQLadderDismountReason : uint8_t
{
	EBBQLadderDismountReason__Invalid                                                = 0,
	EBBQLadderDismountReason__Manual                                                 = 1,
	EBBQLadderDismountReason__Grab                                                   = 2,
	EBBQLadderDismountReason__HitByMelee                                             = 3
};

/// Enum /Script/BBQGameSession.ELadderState
/// Size: 0x01 (1 bytes)
enum class ELadderState : uint8_t
{
	ELadderState__None                                                               = 0,
	ELadderState__Default                                                            = 0,
	ELadderState__Destroyed                                                          = 1
};

/// Enum /Script/BBQGameSession.ELadderType
/// Size: 0x01 (1 bytes)
enum class ELadderType : uint8_t
{
	ELadderType__Default                                                             = 0,
	ELadderType__Attic                                                               = 1
};

/// Enum /Script/BBQGameSession.EIntroImposterType
/// Size: 0x01 (1 bytes)
enum class EIntroImposterType : uint8_t
{
	EIntroImposterType__VictimToKill                                                 = 0,
	EIntroImposterType__Family1                                                      = 1,
	EIntroImposterType__Family2                                                      = 2,
	EIntroImposterType__Leatherface                                                  = 3
};

/// Enum /Script/BBQGameSession.ELockState
/// Size: 0x01 (1 bytes)
enum class ELockState : uint8_t
{
	ELockState__Empty                                                                = 0,
	ELockState__Hidden                                                               = 1,
	ELockState__Deactivated                                                          = 2,
	ELockState__Disengaged                                                           = 4,
	ELockState__Rear                                                                 = 16,
	ELockState__Destroyed                                                            = 128,
	ELockState__Default                                                              = 0
};

/// Enum /Script/BBQGameSession.MeleeAttackInput
/// Size: 0x01 (1 bytes)
enum class MeleeAttackInput : uint8_t
{
	MeleeAttackInput__Primary                                                        = 0,
	MeleeAttackInput__Secondary                                                      = 1
};

/// Enum /Script/BBQGameSession.EMinigameActionValidationType
/// Size: 0x01 (1 bytes)
enum class EMinigameActionValidationType : uint8_t
{
	EMinigameActionValidationType__None                                              = 0,
	EMinigameActionValidationType__Action                                            = 1,
	EMinigameActionValidationType__GenericAction                                     = 2,
	EMinigameActionValidationType__PrimaryAbilityAction                              = 3,
	EMinigameActionValidationType__Count                                             = 4
};

/// Enum /Script/BBQGameSession.EMinigameTimerId
/// Size: 0x01 (1 bytes)
enum class EMinigameTimerId : uint8_t
{
	EMinigameTimerId__Invalid                                                        = 0,
	EMinigameTimerId__StartDelay                                                     = 1,
	EMinigameTimerId__EndDelay                                                       = 2,
	EMinigameTimerId__InputDelay                                                     = 3,
	EMinigameTimerId__GenericTimer1                                                  = 4,
	EMinigameTimerId__GenericTimer2                                                  = 5,
	EMinigameTimerId__GenericTimer3                                                  = 6,
	EMinigameTimerId__GenericTimer4                                                  = 7,
	EMinigameTimerId__GenericTimer5                                                  = 8
};

/// Enum /Script/BBQGameSession.EInputValidationResult
/// Size: 0x01 (1 bytes)
enum class EInputValidationResult : uint8_t
{
	EInputValidationResult__None                                                     = 0,
	EInputValidationResult__Fail                                                     = 1,
	EInputValidationResult__Success                                                  = 2
};

/// Enum /Script/BBQGameSession.ENetSyncedDoorState
/// Size: 0x01 (1 bytes)
enum class ENetSyncedDoorState : uint8_t
{
	ENetSyncedDoorState__None                                                        = 0,
	ENetSyncedDoorState__Default                                                     = 0,
	ENetSyncedDoorState__Open                                                        = 1,
	ENetSyncedDoorState__Physics                                                     = 2,
	ENetSyncedDoorState__Animating                                                   = 4,
	ENetSyncedDoorState__Cooldown                                                    = 32,
	ENetSyncedDoorState__Frozen                                                      = 64
};

/// Enum /Script/BBQGameSession.EChickenState
/// Size: 0x01 (1 bytes)
enum class EChickenState : uint8_t
{
	EChickenState__Idle                                                              = 0,
	EChickenState__Alerted                                                           = 1,
	EChickenState__SemiAlerted                                                       = 2,
	EChickenState__Dead                                                              = 3
};

/// Enum /Script/BBQGameSession.ENoiseTriggerType
/// Size: 0x01 (1 bytes)
enum class ENoiseTriggerType : uint8_t
{
	ENoiseTriggerType__None                                                          = 0,
	ENoiseTriggerType__InsideArea                                                    = 1,
	ENoiseTriggerType__UnCrouched                                                    = 2,
	ENoiseTriggerType__TooClose                                                      = 4,
	ENoiseTriggerType__Any                                                           = 7
};

/// Enum /Script/BBQGameSession.EOutlineDurationStackRule
/// Size: 0x01 (1 bytes)
enum class EOutlineDurationStackRule : uint8_t
{
	EOutlineDurationStackRule__Add                                                   = 0,
	EOutlineDurationStackRule__Override                                              = 1
};

/// Enum /Script/BBQGameSession.EPipeValveState
/// Size: 0x01 (1 bytes)
enum class EPipeValveState : uint8_t
{
	EPipeValveState__Invalid                                                         = 0,
	EPipeValveState__ValveMissing                                                    = 1,
	EPipeValveState__ValveAttached                                                   = 2,
	EPipeValveState__Closed                                                          = 3,
	EPipeValveState__Open                                                            = 4
};

/// Enum /Script/BBQGameSession.EPlayerMovementState
/// Size: 0x01 (1 bytes)
enum class EPlayerMovementState : uint8_t
{
	EPlayerMovementState__PMS_Idle                                                   = 0,
	EPlayerMovementState__PMS_Walk                                                   = 1,
	EPlayerMovementState__PMS_Run                                                    = 2,
	EPlayerMovementState__PMS_Sprint                                                 = 3,
	EPlayerMovementState__PMS_Jump                                                   = 4,
	EPlayerMovementState__PMS_Land                                                   = 5,
	EPlayerMovementState__PMS_CrouchIdle                                             = 6,
	EPlayerMovementState__PMS_CrouchWalk                                             = 7,
	EPlayerMovementState__PMS_Dead                                                   = 8
};

/// Enum /Script/BBQGameSession.EPolicePhoneAction
/// Size: 0x01 (1 bytes)
enum class EPolicePhoneAction : uint8_t
{
	EPolicePhoneAction__None                                                         = 0,
	EPolicePhoneAction__OpenCabinet                                                  = 1,
	EPolicePhoneAction__PlaceFuse                                                    = 2,
	EPolicePhoneAction__FixPolicePhone                                               = 3,
	EPolicePhoneAction__TurnOn                                                       = 4,
	EPolicePhoneAction__TurnOff                                                      = 5,
	EPolicePhoneAction__Calling                                                      = 6
};

/// Enum /Script/BBQGameSession.EPolicePhoneState
/// Size: 0x01 (1 bytes)
enum class EPolicePhoneState : uint8_t
{
	EPolicePhoneState__Invalid                                                       = 0,
	EPolicePhoneState__Open                                                          = 1,
	EPolicePhoneState__HasFuse                                                       = 2,
	EPolicePhoneState__Fixed                                                         = 4,
	EPolicePhoneState__On                                                            = 8
};

/// Enum /Script/BBQGameSession.EBBQSneakAttackDirection
/// Size: 0x01 (1 bytes)
enum class EBBQSneakAttackDirection : uint8_t
{
	EBBQSneakAttackDirection__Left                                                   = 0,
	EBBQSneakAttackDirection__Right                                                  = 1,
	EBBQSneakAttackDirection__Center                                                 = 2
};

/// Enum /Script/BBQGameSession.ESplineCameraDirection
/// Size: 0x01 (1 bytes)
enum class ESplineCameraDirection : uint8_t
{
	ESplineCameraDirection__None                                                     = 0,
	ESplineCameraDirection__Forward                                                  = 1,
	ESplineCameraDirection__Backward                                                 = 2
};

/// Enum /Script/BBQGameSession.ESSAGameplayCueState
/// Size: 0x01 (1 bytes)
enum class ESSAGameplayCueState : uint8_t
{
	ESSAGameplayCueState__None                                                       = 0,
	ESSAGameplayCueState__Activation                                                 = 1,
	ESSAGameplayCueState__BuffDuration                                               = 2,
	ESSAGameplayCueState__DebuffDuration                                             = 3,
	ESSAGameplayCueState__Max                                                        = 4
};

/// Enum /Script/BBQGameSession.ETrapState
/// Size: 0x01 (1 bytes)
enum class ETrapState : uint8_t
{
	ETrapState__None                                                                 = 0,
	ETrapState__Placed                                                               = 1,
	ETrapState__Active                                                               = 2,
	ETrapState__Dismantled                                                           = 3
};

/// Enum /Script/BBQGameSession.EAttributeComparison
/// Size: 0x01 (1 bytes)
enum class EAttributeComparison : uint8_t
{
	EAttributeComparison__LessThan                                                   = 0,
	EAttributeComparison__GreaterThan                                                = 1,
	EAttributeComparison__Equal                                                      = 2
};

/// Enum /Script/BBQGameSession.ETriggerAreaNotifyType
/// Size: 0x01 (1 bytes)
enum class ETriggerAreaNotifyType : uint8_t
{
	ETriggerAreaNotifyType__LocalClient                                              = 0,
	ETriggerAreaNotifyType__ServerOnly                                               = 1,
	ETriggerAreaNotifyType__AllClientsAndServer                                      = 2
};

/// Enum /Script/BBQGameSession.EBBQWellInterruptionResponse
/// Size: 0x01 (1 bytes)
enum class EBBQWellInterruptionResponse : uint8_t
{
	EBBQWellInterruptionResponse__None                                               = 0,
	EBBQWellInterruptionResponse__Interrupt                                          = 1,
	EBBQWellInterruptionResponse__Fall                                               = 2
};

/// Enum /Script/BBQGameSession.EBBQWellEnteringMethod
/// Size: 0x01 (1 bytes)
enum class EBBQWellEnteringMethod : uint8_t
{
	EBBQWellEnteringMethod__Invalid                                                  = 0,
	EBBQWellEnteringMethod__Clambering                                               = 1,
	EBBQWellEnteringMethod__Jumping                                                  = 2,
	EBBQWellEnteringMethod__BeingThrown                                              = 3
};

/// Enum /Script/BBQGameSession.EBBQAnimationAttackDirection
/// Size: 0x01 (1 bytes)
enum class EBBQAnimationAttackDirection : uint8_t
{
	EBBQAnimationAttackDirection__Straight                                           = 0,
	EBBQAnimationAttackDirection__LeftSwing                                          = 1,
	EBBQAnimationAttackDirection__RightSwing                                         = 2,
	EBBQAnimationAttackDirection__UpSwing                                            = 3,
	EBBQAnimationAttackDirection__DownSwing                                          = 4
};

/// Enum /Script/BBQGameSession.EBBQAttackVisualTraceType
/// Size: 0x01 (1 bytes)
enum class EBBQAttackVisualTraceType : uint8_t
{
	EBBQAttackVisualTraceType__Simple                                                = 0,
	EBBQAttackVisualTraceType__FromRightHand                                         = 1,
	EBBQAttackVisualTraceType__FromManualOverrideSceneActor                          = 2
};

/// Enum /Script/BBQGameSession.EBBQAttackType
/// Size: 0x01 (1 bytes)
enum class EBBQAttackType : uint8_t
{
	EBBQAttackType__None                                                             = 0,
	EBBQAttackType__Melee_Chainsaw_Thrust                                            = 1,
	EBBQAttackType__Melee_Chainsaw_Barge                                             = 2,
	EBBQAttackType__Melee_Chainsaw_Slice                                             = 3,
	EBBQAttackType__Melee_Razor_Slice                                                = 4,
	EBBQAttackType__Melee_Hammer_Blow                                                = 5,
	EBBQAttackType__Melee_Knife_Stab                                                 = 6,
	EBBQAttackType__Melee_Broom_Blow                                                 = 7,
	EBBQAttackType__Feedback_Splash_Small                                            = 8,
	EBBQAttackType__Feedback_Splash_Large                                            = 9,
	EBBQAttackType__Glass_Break_Cut                                                  = 10,
	EBBQAttackType__Max                                                              = 11
};

/// Enum /Script/BBQGameSession.EBBQEnvironemntBloodSplashType
/// Size: 0x01 (1 bytes)
enum class EBBQEnvironemntBloodSplashType : uint8_t
{
	EBBQEnvironemntBloodSplashType__Floor                                            = 0,
	EBBQEnvironemntBloodSplashType__Wall                                             = 1,
	EBBQEnvironemntBloodSplashType__WallOrBystander                                  = 2
};

/// Struct /Script/BBQGameSession.ConsumeItemEffects
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FConsumeItemEffects
{ 
	TArray<class UClass*>                              Effects;                                                    // 0x0000   (0x0010)  
};

/// Struct /Script/BBQGameSession.MeleeAttackAnimSlotSet
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FMeleeAttackAnimSlotSet
{ 
	EBBQCombatAnimSlot                                 AttackAnimSlot;                                             // 0x0000   (0x0001)  
	EBBQCombatAnimSlot                                 AttackAnimSlot_Stationary;                                  // 0x0001   (0x0001)  
};

/// Struct /Script/BBQGameSession.GameplayCueData
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FGameplayCueData
{ 
	FGameplayTag                                       GameplayCueTag;                                             // 0x0000   (0x0008)  
	bool                                               bIsLocal;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0009   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.BBQOutlineRendererConfig
/// Size: 0x0098 (152 bytes) (0x000000 - 0x000098) align 8 MaxSize: 0x0098
struct FBBQOutlineRendererConfig
{ 
	FName                                              InstanceName;                                               // 0x0000   (0x0008)  
	float                                              Duration;                                                   // 0x0008   (0x0004)  
	char                                               ColorIndex;                                                 // 0x000C   (0x0001)  
	ETeamID                                            TeamVisible;                                                // 0x000D   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000E   (0x0002)  MISSED
	FGameplayTagContainer                              VisibilityRequiredTags;                                     // 0x0010   (0x0020)  
	FGameplayTagContainer                              VisiblityIgnoreTags;                                        // 0x0030   (0x0020)  
	FGameplayTagContainer                              OwnerRequiredTags;                                          // 0x0050   (0x0020)  
	FGameplayTagContainer                              OwnerIgnoreTags;                                            // 0x0070   (0x0020)  
	EOutlineDurationStackRule                          DurationStackRule;                                          // 0x0090   (0x0001)  
	bool                                               bHighlightOnlyIfMoving;                                     // 0x0091   (0x0001)  
	unsigned char                                      UnknownData01_7[0x6];                                       // 0x0092   (0x0006)  MISSED
};

/// Struct /Script/BBQGameSession.BBQHuntModeDetectableObject
/// Size: 0x0058 (88 bytes) (0x000000 - 0x000058) align 8 MaxSize: 0x0058
struct FBBQHuntModeDetectableObject
{ 
	TSoftObjectPtr<class UClass*>                      ActorClass;                                                 // 0x0000   (0x0028)  
	FGameplayTagContainer                              RequiredCharacterTags;                                      // 0x0028   (0x0020)  
	FName                                              RequiredActorTag;                                           // 0x0048   (0x0008)  
	bool                                               bAlwaysDetected;                                            // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.SenseInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSenseInfo
{ 
	class UNiagaraComponent*                           SpawnedPS;                                                  // 0x0000   (0x0008)  
	float                                              DistanceToOwnerAvatar;                                      // 0x0008   (0x0004)  
	float                                              DistanceNormalized;                                         // 0x000C   (0x0004)  
	float                                              CurrentSize;                                                // 0x0010   (0x0004)  
	float                                              VisibilityNormalized;                                       // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.HandleInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FHandleInfo
{ 
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0000   (0x0018)  MISSED
};

/// Struct /Script/BBQGameSession.HighlightInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FHighlightInfo
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/BBQGameSession.BBQGameplayAbilityTargetingClueInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQGameplayAbilityTargetingClueInfo
{ 
	class ABBQGameSessionCharacter*                    OwnerCharacter;                                             // 0x0000   (0x0008)  
	int32_t                                            FootprintIndex;                                             // 0x0008   (0x0004)  
	FVector                                            FootprintLocation;                                          // 0x000C   (0x000C)  
};

/// Struct /Script/BBQGameSession.BBQTurnInPlaceAsset
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQTurnInPlaceAsset
{ 
	class UAnimSequenceBase*                           Animation;                                                  // 0x0000   (0x0008)  
	float                                              AnimatedAngle;                                              // 0x0008   (0x0004)  
	FName                                              SlotName;                                                   // 0x000C   (0x0008)  
	float                                              PlayRate;                                                   // 0x0014   (0x0004)  
	bool                                               ScaleTurnAngle;                                             // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0019   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.CommonBleedoutInfo
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FCommonBleedoutInfo
{ 
	int32_t                                            level;                                                      // 0x0000   (0x0004)  
	float                                              HealthReduction;                                            // 0x0004   (0x0004)  
	float                                              Period;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDataTableRowHandle                                NotificationRow;                                            // 0x0010   (0x0010)  
	float                                              TimeTillDeath;                                              // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.TimeBasedBleedoutInfo
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FTimeBasedBleedoutInfo
{ 
	float                                              StartTime;                                                  // 0x0000   (0x0004)  
	float                                              EndTime;                                                    // 0x0004   (0x0004)  
	FCommonBleedoutInfo                                BleedoutData;                                               // 0x0008   (0x0028)  
};

/// Struct /Script/BBQGameSession.TagBasedBleedoutInfo
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FTagBasedBleedoutInfo
{ 
	FGameplayTag                                       Tag;                                                        // 0x0000   (0x0008)  
	FCommonBleedoutInfo                                BleedoutData;                                               // 0x0008   (0x0028)  
};

/// Struct /Script/BBQGameSession.BleedoutHandle
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBleedoutHandle
{ 
	int32_t                                            Index;                                                      // 0x0000   (0x0004)  
	float                                              HealthReduction;                                            // 0x0004   (0x0004)  
	float                                              BleedoutStartedTime;                                        // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQCameraState_CameraShake
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQCameraState_CameraShake
{ 
	class UClass*                                      ShakeClass;                                                 // 0x0000   (0x0008)  
	float                                              Scale;                                                      // 0x0008   (0x0004)  
	ECameraShakePlaySpace                              PlaySpace;                                                  // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x000D   (0x0003)  MISSED
	FRotator                                           UserPlaySpaceRot;                                           // 0x0010   (0x000C)  
	float                                              Delay;                                                      // 0x001C   (0x0004)  
	bool                                               bLoop;                                                      // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQ_Camera_State
/// Size: 0x00C0 (192 bytes) (0x000008 - 0x0000C0) align 8 MaxSize: 0x00C0
struct FBBQ_Camera_State : FTableRowBase
{ 
	bool                                               bDisablePlayerControl;                                      // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              MouseTurnMultiplier;                                        // 0x000C   (0x0004)  
	float                                              MousePitchMultiplier;                                       // 0x0010   (0x0004)  
	float                                              TurnMultiplier;                                             // 0x0014   (0x0004)  
	float                                              PitchMultiplier;                                            // 0x0018   (0x0004)  
	float                                              PitchMin;                                                   // 0x001C   (0x0004)  
	float                                              PitchMax;                                                   // 0x0020   (0x0004)  
	float                                              DefaultPitch;                                               // 0x0024   (0x0004)  
	float                                              FollowDistance;                                             // 0x0028   (0x0004)  
	float                                              FOV;                                                        // 0x002C   (0x0004)  
	FVector                                            TargetOffset;                                               // 0x0030   (0x000C)  
	FVector                                            PositionOffset;                                             // 0x003C   (0x000C)  
	FVector                                            LookAtPointOffset;                                          // 0x0048   (0x000C)  
	float                                              PositionLagSpeed;                                           // 0x0054   (0x0004)  
	float                                              RotationLagSpeed;                                           // 0x0058   (0x0004)  
	float                                              MaxLagDistance;                                             // 0x005C   (0x0004)  
	float                                              TerrainFollowInterpSpeedMultiplier;                         // 0x0060   (0x0004)  
	float                                              MotionBlurAmount;                                           // 0x0064   (0x0004)  
	bool                                               bUseTerrainFollow;                                          // 0x0068   (0x0001)  
	bool                                               bUseObjectFading;                                           // 0x0069   (0x0001)  
	bool                                               bUseTargetLock;                                             // 0x006A   (0x0001)  
	bool                                               bResetCameraRotation;                                       // 0x006B   (0x0001)  
	bool                                               bOverrideOutTransition;                                     // 0x006C   (0x0001)  
	bool                                               bDisableCollisionWithPlayers;                               // 0x006D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x006E   (0x0002)  MISSED
	float                                              TransitionTime;                                             // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	class UCurveFloat*                                 TransitionCurve;                                            // 0x0078   (0x0008)  
	float                                              OutTransitionTime;                                          // 0x0080   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0084   (0x0004)  MISSED
	class UCurveFloat*                                 OutTransitionCurve;                                         // 0x0088   (0x0008)  
	FBBQCameraState_CameraShake                        CameraShake;                                                // 0x0090   (0x0028)  
	bool                                               bOverride_MouseTurnMultiplier : 1;                          // 0x00B8:0 (0x0001)  
	bool                                               bOverride_MousePitchMultiplier : 1;                         // 0x00B8:1 (0x0001)  
	bool                                               bOverride_TurnMultiplier : 1;                               // 0x00B8:2 (0x0001)  
	bool                                               bOverride_PitchMultiplier : 1;                              // 0x00B8:3 (0x0001)  
	bool                                               bOverride_PitchMin : 1;                                     // 0x00B8:4 (0x0001)  
	bool                                               bOverride_PitchMax : 1;                                     // 0x00B8:5 (0x0001)  
	bool                                               bOverride_DefaultPitch : 1;                                 // 0x00B8:6 (0x0001)  
	bool                                               bOverride_FollowDistance : 1;                               // 0x00B8:7 (0x0001)  
	bool                                               bOverride_FOV : 1;                                          // 0x00B9:0 (0x0001)  
	bool                                               bOverride_TargetOffset : 1;                                 // 0x00B9:1 (0x0001)  
	bool                                               bOverride_PositionOffset : 1;                               // 0x00B9:2 (0x0001)  
	bool                                               bOverride_LookAtPointOffset : 1;                            // 0x00B9:3 (0x0001)  
	bool                                               bOverride_PositionLagSpeed : 1;                             // 0x00B9:4 (0x0001)  
	bool                                               bOverride_RotationLagSpeed : 1;                             // 0x00B9:5 (0x0001)  
	bool                                               bOverride_MaxLagDistance : 1;                               // 0x00B9:6 (0x0001)  
	bool                                               bOverride_TerrainFollowInterpSpeedMultiplier : 1;           // 0x00B9:7 (0x0001)  
	bool                                               bOverride_MotionBlurAmount : 1;                             // 0x00BA:0 (0x0001)  
	bool                                               bOverride_bUseTerrainFollow : 1;                            // 0x00BA:1 (0x0001)  
	bool                                               bOverride_bUseObjectFading : 1;                             // 0x00BA:2 (0x0001)  
	bool                                               bOverride_bUseTargetLock : 1;                               // 0x00BA:3 (0x0001)  
	bool                                               bOverride_bResetCameraRotation : 1;                         // 0x00BA:4 (0x0001)  
	bool                                               bOverride_bOverrideOutTransition : 1;                       // 0x00BA:5 (0x0001)  
	bool                                               bOverride_TransitionTime : 1;                               // 0x00BA:6 (0x0001)  
	bool                                               bOverride_TransitionCurve : 1;                              // 0x00BA:7 (0x0001)  
	bool                                               bOverride_CameraShake : 1;                                  // 0x00BB:0 (0x0001)  
	bool                                               bOverride_bDisableCollisionWithPlayers : 1;                 // 0x00BB:1 (0x0001)  
	unsigned char                                      UnknownData04_7[0x4];                                       // 0x00BC   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.CameraStateBlendable
/// Size: 0x00E0 (224 bytes) (0x000000 - 0x0000E0) align 8 MaxSize: 0x00E0
struct FCameraStateBlendable
{ 
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0000   (0x0018)  MISSED
	FBBQ_Camera_State                                  State;                                                      // 0x0018   (0x00C0)  
	class UCameraShakeBase*                            ActiveCameraShake;                                          // 0x00D8   (0x0008)  
};

/// Struct /Script/BBQGameSession.CameraStateModifier
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FCameraStateModifier
{ 
	class UBBQCameraVolumeComponent*                   SourceCameraVolume;                                         // 0x0000   (0x0008)  
	FDataTableRowHandle                                CameraStateRowHandle;                                       // 0x0008   (0x0010)  
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0018   (0x0018)  MISSED
};

/// Struct /Script/BBQGameSession.BBQCameraFramingOffset
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FBBQCameraFramingOffset
{ 
	float                                              Angle;                                                      // 0x0000   (0x0004)  
	float                                              ArmLength;                                                  // 0x0004   (0x0004)  
	float                                              ArmHeight;                                                  // 0x0008   (0x0004)  
	bool                                               bFallbackCamera;                                            // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.ChainsawHeatLevelTag
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 MaxSize: 0x0080
struct FChainsawHeatLevelTag
{ 
	FGameplayVariableFloat                             HeatLevel;                                                  // 0x0000   (0x0058)  
	FGameplayTag                                       GameplayTag;                                                // 0x0058   (0x0008)  
	FGameplayTag                                       LowMarginGameplayTag;                                       // 0x0060   (0x0008)  
	float                                              LowMarginValue;                                             // 0x0068   (0x0004)  
	FGameplayTag                                       HighMarginGameplayTag;                                      // 0x006C   (0x0008)  
	float                                              HighMarginValue;                                            // 0x0074   (0x0004)  
	bool                                               bAddWhenBelow;                                              // 0x0078   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0079   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQCinematicCameraSetup
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 MaxSize: 0x0048
struct FBBQCinematicCameraSetup
{ 
	bool                                               bOverrideSequenceMode;                                      // 0x0000   (0x0001)  
	bool                                               bOverrideFallbackFramingDuration;                           // 0x0001   (0x0001)  
	bool                                               bOverrideAudioListener;                                     // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x0003   (0x0005)  MISSED
	class ULevelSequence*                              LevelSequence;                                              // 0x0008   (0x0008)  
	float                                              SequenceBlendInTime;                                        // 0x0010   (0x0004)  
	float                                              SequenceBlendOutTime;                                       // 0x0014   (0x0004)  
	class UBBQLevelSequenceCollisionObject*            LevelSequenceCollision;                                     // 0x0018   (0x0008)  
	bool                                               bResetCameraAfterSequence;                                  // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	class UClass*                                      FallbackFramingSettings;                                    // 0x0028   (0x0008)  
	float                                              FallbackFramingDuration;                                    // 0x0030   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	FString                                            MusicPlayerState;                                           // 0x0038   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQPairedAnimation
/// Size: 0x0100 (256 bytes) (0x000000 - 0x000100) align 16 MaxSize: 0x0100
struct FBBQPairedAnimation
{ 
	class UAnimMontage*                                LeaderAnimationMontage;                                     // 0x0000   (0x0008)  
	FBBQCinematicCameraSetup                           LeaderCameraSetup;                                          // 0x0008   (0x0048)  
	class ULevelSequence*                              LeaderAssetSequence;                                        // 0x0050   (0x0008)  
	bool                                               bAttachLeaderAssetSequenceToFollower;                       // 0x0058   (0x0001)  
	bool                                               bCanContinePlayingWithoutPartner;                           // 0x0059   (0x0001)  
	bool                                               bCanContinueCinematicWithoutPartner;                        // 0x005A   (0x0001)  
	bool                                               bLoopLevelSequence;                                         // 0x005B   (0x0001)  
	bool                                               bOffsetLeaderCharacter;                                     // 0x005C   (0x0001)  
	bool                                               bOverrideCollision;                                         // 0x005D   (0x0001)  
	bool                                               bMoveLeaderToAvoidOverlap;                                  // 0x005E   (0x0001)  
	EBBQPairedAnimRole                                 OverrideCameraFramingCharacter;                             // 0x005F   (0x0001)  
	bool                                               bAdjustMeshPitchForElevation;                               // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0061   (0x0003)  MISSED
	float                                              MaxPitchForElevation;                                       // 0x0064   (0x0004)  
	class UAnimMontage*                                FollowerAnimationMontage;                                   // 0x0068   (0x0008)  
	FBBQCinematicCameraSetup                           FollowerCameraSetup;                                        // 0x0070   (0x0048)  
	class ULevelSequence*                              FollowerAssetSequence;                                      // 0x00B8   (0x0008)  
	bool                                               bAttachFollowerAssetSequenceToLeader;                       // 0x00C0   (0x0001)  
	EBBQPairedAnimRoleTransformRule                    AnimationTransformRule;                                     // 0x00C1   (0x0001)  
	unsigned char                                      UnknownData01_6[0xE];                                       // 0x00C2   (0x000E)  MISSED
	FTransform                                         FollowerOffset;                                             // 0x00D0   (0x0030)  
};

/// Struct /Script/BBQGameSession.BBQPairedAnimationSet
/// Size: 0x0150 (336 bytes) (0x000000 - 0x000150) align 16 MaxSize: 0x0150
struct FBBQPairedAnimationSet
{ 
	TMap<FGameplayTag, FBBQPairedAnimation>            TagSpecificOverrides;                                       // 0x0000   (0x0050)  
	FBBQPairedAnimation                                BaseSetup;                                                  // 0x0050   (0x0100)  
};

/// Struct /Script/BBQGameSession.BBQExecutionProperties
/// Size: 0x01D0 (464 bytes) (0x000000 - 0x0001D0) align 16 MaxSize: 0x01D0
struct FBBQExecutionProperties
{ 
	FName                                              ExecutionDataName;                                          // 0x0000   (0x0008)  
	class UClass*                                      ExecutionerEffect;                                          // 0x0008   (0x0008)  
	class UClass*                                      VictimEffect;                                               // 0x0010   (0x0008)  
	TMap<FGameplayTag, class UTexture2D*>              ErosionTextureMap;                                          // 0x0018   (0x0050)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0068   (0x0008)  MISSED
	FBBQPairedAnimationSet                             PairedAnimationSet;                                         // 0x0070   (0x0150)  
	float                                              ClearanceAreaSize;                                          // 0x01C0   (0x0004)  
	float                                              MinimumClearanceAreaSize;                                   // 0x01C4   (0x0004)  
	float                                              MaxHeightDifference;                                        // 0x01C8   (0x0004)  
	bool                                               bVictimStartsLyingDown;                                     // 0x01CC   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x01CD   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.BBQInventoryItem
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQInventoryItem
{ 
	FGameplayTag                                       Type;                                                       // 0x0000   (0x0008)  
	class UTexture2D*                                  SlotTexture;                                                // 0x0008   (0x0008)  
	class AActor*                                      EffectInstigator;                                           // 0x0010   (0x0008)  
	bool                                               IsEquipped;                                                 // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0019   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQLockOnTargetInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQLockOnTargetInfo
{ 
	class UObject*                                     LockOnTarget;                                               // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0008   (0x0008)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMapPosition
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQMapPosition
{ 
	FVector                                            Location;                                                   // 0x0000   (0x000C)  
	float                                              Yaw;                                                        // 0x000C   (0x0004)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/BBQGameSession.NoiseOutlineConfig
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 MaxSize: 0x0048
struct FNoiseOutlineConfig
{ 
	class UNiagaraSystem*                              PSTemplate;                                                 // 0x0000   (0x0008)  
	float                                              PulseRate;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UAkAudioEvent*                               AudioEvent;                                                 // 0x0010   (0x0008)  
	float                                              MaxDistance;                                                // 0x0018   (0x0004)  
	float                                              Duration;                                                   // 0x001C   (0x0004)  
	class ABBQGameSessionCharacter*                    SoleRecipientOfEffect;                                      // 0x0020   (0x0008)  
	ETeamID                                            Team;                                                       // 0x0028   (0x0001)  
	char                                               ColorIndex;                                                 // 0x0029   (0x0001)  
	bool                                               bHighlightAllComponents;                                    // 0x002A   (0x0001)  
	unsigned char                                      UnknownData01_6[0x5];                                       // 0x002B   (0x0005)  MISSED
	TArray<FName>                                      TaggedComponentsToHighlight;                                // 0x0030   (0x0010)  
	bool                                               bDestroyAfterEnd;                                           // 0x0040   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0041   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQCloseEncounterStateRepInfo
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 16 MaxSize: 0x0080
struct FBBQCloseEncounterStateRepInfo
{ 
	ECloseEncounterState                               CloseEncounterState;                                        // 0x0000   (0x0001)  
	ECERole                                            OverrideWinner;                                             // 0x0001   (0x0001)  
	bool                                               bLastEncounterFinished;                                     // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x0003   (0x0005)  MISSED
	FDataTableRowHandle                                CloseEncounterDefinition;                                   // 0x0008   (0x0010)  
	class AActor*                                      Defender;                                                   // 0x0018   (0x0008)  
	FTransform                                         AttackerTransform;                                          // 0x0020   (0x0030)  
	FTransform                                         DefenderTransform;                                          // 0x0050   (0x0030)  
};

/// Struct /Script/BBQGameSession.CloseEncounterParticipant
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FCloseEncounterParticipant
{ 
	class AActor*                                      ParticipantActor;                                           // 0x0000   (0x0008)  
	class UBBQPairedAnimationComponent*                ParticipantPairedAnimationComponent;                        // 0x0008   (0x0008)  
	class UBBQCloseEncounterComponent*                 ParticipantCloseEncounterComponent;                         // 0x0010   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0018   (0x0010)  MISSED
};

/// Struct /Script/BBQGameSession.HingeDoorAnimation
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FHingeDoorAnimation
{ 
	float                                              Duration;                                                   // 0x0000   (0x0004)  
	float                                              StartAngle;                                                 // 0x0004   (0x0004)  
	float                                              EndAngle;                                                   // 0x0008   (0x0004)  
	float                                              Loudness;                                                   // 0x000C   (0x0004)  
};

/// Struct /Script/BBQGameSession.HingeDoorSoundState
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FHingeDoorSoundState
{ 
	class UAkAudioEvent*                               AkEvent;                                                    // 0x0000   (0x0008)  
	class UAkRtpc*                                     IsLocalRtpc;                                                // 0x0008   (0x0008)  
	class UWorld*                                      World;                                                      // 0x0010   (0x0008)  
	class UAkRoomComponent*                            RoomOverride;                                               // 0x0018   (0x0008)  
	unsigned char                                      UnknownData00_7[0x20];                                      // 0x0020   (0x0020)  MISSED
};

/// Struct /Script/BBQGameSession.DoorSlicerStump
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FDoorSlicerStump
{ 
	float                                              StumpNormalizedTimeKey;                                     // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FComponentReference                                StumpMeshReference;                                         // 0x0008   (0x0028)  
};

/// Struct /Script/BBQGameSession.DoorSlicerParts
/// Size: 0x00E8 (232 bytes) (0x000000 - 0x0000E8) align 8 MaxSize: 0x00E8
struct FDoorSlicerParts
{ 
	FComponentReference                                SliceVFXPathReference;                                      // 0x0000   (0x0028)  
	class USplineComponent*                            DoorSliceVFXPath;                                           // 0x0028   (0x0008)  
	FComponentReference                                SliceMeshReference;                                         // 0x0030   (0x0028)  
	class UMeshComponent*                              DoorSliceMesh;                                              // 0x0058   (0x0008)  
	TArray<FDoorSlicerStump>                           DoorSliceStumps;                                            // 0x0060   (0x0010)  
	float                                              SliceShaderTraveDistace;                                    // 0x0070   (0x0004)  
	float                                              SliceProgress;                                              // 0x0074   (0x0004)  
	float                                              MaxSliceTime;                                               // 0x0078   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x007C   (0x0004)  MISSED
	TArray<class UMaterialInstanceDynamic*>            DoorSliceDynamicMaterials;                                  // 0x0080   (0x0010)  
	TMap<int32_t, int32_t>                             DoorSliceProgressParamterMap;                               // 0x0090   (0x0050)  
	bool                                               bDoorSliceInitted;                                          // 0x00E0   (0x0001)  
	bool                                               bDoorSliceIsValid;                                          // 0x00E1   (0x0001)  
	bool                                               bDoorSliceComplete;                                         // 0x00E2   (0x0001)  
	unsigned char                                      UnknownData01_7[0x5];                                       // 0x00E3   (0x0005)  MISSED
};

/// Struct /Script/BBQGameSession.DoorSlicerSmashable
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FDoorSlicerSmashable
{ 
	float                                              SmashableNormalizedTimeKey;                                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FComponentReference>                        SmashableComponents;                                        // 0x0008   (0x0010)  
	TArray<int32_t>                                    SmashableSliceDependencies;                                 // 0x0018   (0x0010)  
	FVector2D                                          SmashableForce;                                             // 0x0028   (0x0008)  
	class UNiagaraSystem*                              SmashableVFX;                                               // 0x0030   (0x0008)  
	bool                                               bWasSmashed;                                                // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQ_SlidingAnimationRepInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQ_SlidingAnimationRepInfo
{ 
	class UCurveFloat*                                 AnimationCurve;                                             // 0x0000   (0x0008)  
	float                                              AnimationTimer;                                             // 0x0008   (0x0004)  
	bool                                               bReverseAnimation;                                          // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x000D   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.BBQElectroTrapInteractionSettings
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQElectroTrapInteractionSettings
{ 
	EInteractionMethod                                 InteractionMethod;                                          // 0x0000   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot;                                                   // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	class UAnimMontage*                                MontageToPlay;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/BBQGameSession.EnvironmentDamageSettings
/// Size: 0x0058 (88 bytes) (0x000000 - 0x000058) align 8 MaxSize: 0x0058
struct FEnvironmentDamageSettings
{ 
	class UAnimMontage*                                AttackMontage;                                              // 0x0000   (0x0008)  
	bool                                               bOneShot;                                                   // 0x0008   (0x0001)  
	bool                                               bUsePlayerOrientation;                                      // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000A   (0x0002)  MISSED
	float                                              SweepRadius;                                                // 0x000C   (0x0004)  
	float                                              SweepStartOffset;                                           // 0x0010   (0x0004)  
	EAttackDirectionReference                          AttackReference;                                            // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0015   (0x0003)  MISSED
	FVector                                            AttackDirectionNormal;                                      // 0x0018   (0x000C)  
	float                                              ReferenceRotation;                                          // 0x0024   (0x0004)  
	float                                              SweepDistance;                                              // 0x0028   (0x0004)  
	float                                              SweepRate;                                                  // 0x002C   (0x0004)  
	float                                              AttackDuration;                                             // 0x0030   (0x0004)  
	float                                              SliceDistancePerTick;                                       // 0x0034   (0x0004)  
	float                                              MaximumSliceDistance;                                       // 0x0038   (0x0004)  
	float                                              AdditionalDistanceOnSlice;                                  // 0x003C   (0x0004)  
	float                                              SliceFillInTick;                                            // 0x0040   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	class UCurveFloat*                                 DecalSpawnProbabilityCurve;                                 // 0x0048   (0x0008)  
	bool                                               bUseSliceDirectionForDecals;                                // 0x0050   (0x0001)  
	unsigned char                                      UnknownData03_7[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.LockOnTargetVolumeInfo
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 MaxSize: 0x0068
struct FLockOnTargetVolumeInfo
{ 
	FComponentReference                                LockOnBoxComponentRef;                                      // 0x0000   (0x0028)  
	FComponentReference                                LockOnTargetSceneComponentRef;                              // 0x0028   (0x0028)  
	bool                                               bOverrideVolumeEnabled;                                     // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0051   (0x0007)  MISSED
	class UBoxComponent*                               LockOnBoxComponent;                                         // 0x0058   (0x0008)  
	class USceneComponent*                             LockOnTarget;                                               // 0x0060   (0x0008)  
};

/// Struct /Script/BBQGameSession.Fuse
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FFuse
{ 
	int32_t                                            AmpValue;                                                   // 0x0000   (0x0004)  
	int32_t                                            ColorIndex;                                                 // 0x0004   (0x0004)  
};

/// Struct /Script/BBQGameSession.FuseboxInteractionState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FFuseboxInteractionState
{ 
	class ABBQGameSessionCharacterAnimated*            InteractingCharacter;                                       // 0x0000   (0x0008)  
	EFuseboxAction                                     Action;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.InputActionContainer
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FInputActionContainer
{ 
	TArray<class UInputAction*>                        InputActions;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQMinigameState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FBBQMinigameState
{ 
	float                                              Points;                                                     // 0x0000   (0x0004)  
	float                                              ActiveTimerRemainingTime;                                   // 0x0004   (0x0004)  
	float                                              DecayElapsedTime;                                           // 0x0008   (0x0004)  
	EMinigameTimerId                                   ActiveTimerId;                                              // 0x000C   (0x0001)  
	EEndMinigameReason                                 EndReason;                                                  // 0x000D   (0x0001)  
	unsigned char                                      UnknownData00_7[0x2];                                       // 0x000E   (0x0002)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMinigameNetState_SweetSpot
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 MaxSize: 0x0004
struct FBBQMinigameNetState_SweetSpot
{ 
	float                                              MarkerPosition;                                             // 0x0000   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQMinigameNetState_FuseBox
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FBBQMinigameNetState_FuseBox
{ 
	TArray<int32_t>                                    FuseSlots;                                                  // 0x0000   (0x0010)  
	TArray<int32_t>                                    FreeFuses;                                                  // 0x0010   (0x0010)  
	int32_t                                            FloatingFuse;                                               // 0x0020   (0x0004)  
	int32_t                                            HoveredFuseButtonIndex;                                     // 0x0024   (0x0004)  
	bool                                               bIsHoveredFuseButtonASlot;                                  // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMinigameNetState_Interaction
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 MaxSize: 0x0018
struct FBBQMinigameNetState_Interaction
{ 
	float                                              NoiseLevel;                                                 // 0x0000   (0x0004)  
	int32_t                                            AngleIndex;                                                 // 0x0004   (0x0004)  
	float                                              LeftAxisAngle;                                              // 0x0008   (0x0004)  
	bool                                               bIsInSweetSpot;                                             // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              HoldElapsedTime;                                            // 0x0010   (0x0004)  
	float                                              NoiseDecayElapsedTime;                                      // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQMinigameNetState
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 MaxSize: 0x0068
struct FBBQMinigameNetState
{ 
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0000   (0x0008)  MISSED
	FBBQMinigameState                                  BaseState;                                                  // 0x0008   (0x0010)  
	FBBQMinigameNetState_SweetSpot                     SweetSpotState;                                             // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FBBQMinigameNetState_FuseBox                       FuseBoxState;                                               // 0x0020   (0x0030)  
	FBBQMinigameNetState_Interaction                   InteractionState;                                           // 0x0050   (0x0018)  
};

/// Struct /Script/BBQGameSession.BBQMinigameSavedState
/// Size: 0x0070 (112 bytes) (0x000000 - 0x000070) align 8 MaxSize: 0x0070
struct FBBQMinigameSavedState
{ 
	int32_t                                            RandomSeed;                                                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FBBQMinigameNetState                               NetState;                                                   // 0x0008   (0x0068)  
};

/// Struct /Script/BBQGameSession.BBQMinigameInitialState
/// Size: 0x0088 (136 bytes) (0x000000 - 0x000088) align 8 MaxSize: 0x0088
struct FBBQMinigameInitialState
{ 
	int32_t                                            RandomSeed;                                                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UBBQMinigameSettingsV2*                      MinigameSettings;                                           // 0x0008   (0x0008)  
	FBBQMinigameSavedState                             SavedState;                                                 // 0x0010   (0x0070)  
	class AActor*                                      MinigameInstigatorActor;                                    // 0x0080   (0x0008)  
};

/// Struct /Script/BBQGameSession.SpottingVFXProperties
/// Size: 0x0070 (112 bytes) (0x000000 - 0x000070) align 8 MaxSize: 0x0070
struct FSpottingVFXProperties
{ 
	class UNiagaraSystem*                              TemplateIdle;                                               // 0x0000   (0x0008)  
	class UNiagaraSystem*                              TemplateNoiseDetected;                                      // 0x0008   (0x0008)  
	class UNiagaraSystem*                              TemplateFocusing;                                           // 0x0010   (0x0008)  
	FString                                            RotationVariableName;                                       // 0x0018   (0x0010)  
	FString                                            DirectionVariableName;                                      // 0x0028   (0x0010)  
	FString                                            SizeVariableName;                                           // 0x0038   (0x0010)  
	FString                                            ScaleVariableName;                                          // 0x0048   (0x0010)  
	FVector                                            PositionOffset;                                             // 0x0058   (0x000C)  
	float                                              Size;                                                       // 0x0064   (0x0004)  
	class UCurveFloat*                                 ScaleCurve;                                                 // 0x0068   (0x0008)  
};

/// Struct /Script/BBQGameSession.CookListenPostProcessProperties
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FCookListenPostProcessProperties
{ 
	class UMaterialInterface*                          Material;                                                   // 0x0000   (0x0008)  
	FName                                              SizeParameterName;                                          // 0x0008   (0x0008)  
	FName                                              AngleVectorParameterName;                                   // 0x0010   (0x0008)  
	FName                                              AmplitudeVectorParameterName;                               // 0x0018   (0x0008)  
	FName                                              OmniNoiseParameterName;                                     // 0x0020   (0x0008)  
	float                                              IdleNoiseAmplitude;                                         // 0x0028   (0x0004)  
	float                                              SpottingNoiseAmplitude;                                     // 0x002C   (0x0004)  
	float                                              FocusingNoiseAmplitude;                                     // 0x0030   (0x0004)  
	float                                              FocusingTargetAmplitudeFactor;                              // 0x0034   (0x0004)  
	int32_t                                            MaxNumOfNoiseSources;                                       // 0x0038   (0x0004)  
	float                                              BaseSize;                                                   // 0x003C   (0x0004)  
	class UCurveFloat*                                 SizeScaleCurve;                                             // 0x0040   (0x0008)  
	float                                              ParametersInterpSpeed;                                      // 0x0048   (0x0004)  
	bool                                               bDisableOnCooldown;                                         // 0x004C   (0x0001)  
	bool                                               bDisableDirectionalInfoWhenFocusing;                        // 0x004D   (0x0001)  
	unsigned char                                      UnknownData00_7[0x2];                                       // 0x004E   (0x0002)  MISSED
};

/// Struct /Script/BBQGameSession.BBQNoiseTargetInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQNoiseTargetInfo
{ 
	class UNiagaraComponent*                           SpawnedVFX;                                                 // 0x0000   (0x0008)  
	float                                              DistanceToOwnerAvatar;                                      // 0x0008   (0x0004)  
	float                                              CurrentSize;                                                // 0x000C   (0x0004)  
	float                                              SizeReducingElapsedTime;                                    // 0x0010   (0x0004)  
	float                                              TimeSinceSpottable;                                         // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQFootprint
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 4 MaxSize: 0x0028
struct FBBQFootprint
{ 
	int32_t                                            IndexInTrail;                                               // 0x0000   (0x0004)  
	float                                              Timestamp;                                                  // 0x0004   (0x0004)  
	FVector                                            Location;                                                   // 0x0008   (0x000C)  
	FVector                                            Direction;                                                  // 0x0014   (0x000C)  
	TWeakObjectPtr<class ABBQGameSessionCharacter*>    OwnerCharacter;                                             // 0x0020   (0x0008)  
};

/// Struct /Script/BBQGameSession.BBQFootprintVisualData
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQFootprintVisualData
{ 
	class UDecalComponent*                             DecalComponent;                                             // 0x0000   (0x0008)  
	class UNiagaraComponent*                           VfxComponent;                                               // 0x0008   (0x0008)  
	uint32_t                                           FootprintHash;                                              // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0xC];                                       // 0x0014   (0x000C)  MISSED
};

/// Struct /Script/BBQGameSession.BBQTargetActorMeshState
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 MaxSize: 0x0048
struct FBBQTargetActorMeshState
{ 
	bool                                               bEnableOutline;                                             // 0x0000   (0x0001)  
	bool                                               bUseOriginalMaterials;                                      // 0x0001   (0x0001)  
	bool                                               bEnableMaterialParameter;                                   // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x0003   (0x0005)  MISSED
	class UMaterialInterface*                          MaterialOverride;                                           // 0x0008   (0x0008)  
	int32_t                                            OutlineColorIndex;                                          // 0x0010   (0x0004)  
	FName                                              ParameterName;                                              // 0x0014   (0x0008)  
	FLinearColor                                       ParameterValue;                                             // 0x001C   (0x0010)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	class UStaticMeshComponent*                        StaticMeshComponent;                                        // 0x0030   (0x0008)  
	TArray<class UMaterialInterface*>                  Materials;                                                  // 0x0038   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQControlSchemeDefaults
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FBBQControlSchemeDefaults
{ 
	BBQGait                                            Gait;                                                       // 0x0000   (0x0001)  
	BBQStance                                          Stance;                                                     // 0x0001   (0x0001)  
};

/// Struct /Script/BBQGameSession.BBQTraversalData
/// Size: 0x0044 (68 bytes) (0x000000 - 0x000044) align 4 MaxSize: 0x0044
struct FBBQTraversalData
{ 
	FVector                                            SlideToLocation;                                            // 0x0000   (0x000C)  
	FRotator                                           SlideToRotation;                                            // 0x000C   (0x000C)  
	EBBQAnimSlot                                       TraversalAnimSlot;                                          // 0x0018   (0x0001)  
	EBBQAnimSlot                                       FastTraversalAnimSlot;                                      // 0x0019   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x001A   (0x0002)  MISSED
	FName                                              IntroSection;                                               // 0x001C   (0x0008)  
	FName                                              MainSection;                                                // 0x0024   (0x0008)  
	FName                                              OutroIdleSection;                                           // 0x002C   (0x0008)  
	FName                                              OutroDownedSection;                                         // 0x0034   (0x0008)  
	float                                              AnimRate;                                                   // 0x003C   (0x0004)  
	bool                                               bPerformFastTraversal;                                      // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x0041   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.BBQDoorActionParams
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQDoorActionParams
{ 
	class ABBQDoorBase*                                Door;                                                       // 0x0000   (0x0008)  
	class UAnimMontage*                                Montage;                                                    // 0x0008   (0x0008)  
	EBBQDoorAction                                     Type;                                                       // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	FVector                                            Location;                                                   // 0x0014   (0x000C)  
	FRotator                                           Rotation;                                                   // 0x0020   (0x000C)  
	bool                                               bShouldSlide;                                               // 0x002C   (0x0001)  
	bool                                               bUnlockFirst;                                               // 0x002D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x002E   (0x0002)  MISSED
	float                                              ActionServerTime;                                           // 0x0030   (0x0004)  
	float                                              ActionTime;                                                 // 0x0034   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQMovementSettings
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQMovementSettings : FTableRowBase
{ 
	float                                              WalkSpeed;                                                  // 0x0008   (0x0004)  
	float                                              RunSpeed;                                                   // 0x000C   (0x0004)  
	float                                              SprintSpeed;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	class UCurveVector*                                MovementCurve;                                              // 0x0018   (0x0008)  
	class UCurveFloat*                                 RotationRateCurve;                                          // 0x0020   (0x0008)  
	class UCurveFloat*                                 StrideBlendCurve;                                           // 0x0028   (0x0008)  
	class UCurveFloat*                                 GaitBlendCurve;                                             // 0x0030   (0x0008)  
};

/// Struct /Script/BBQGameSession.BBQMovementSettingsStance
/// Size: 0x0078 (120 bytes) (0x000008 - 0x000078) align 8 MaxSize: 0x0078
struct FBBQMovementSettingsStance : FTableRowBase
{ 
	FBBQMovementSettings                               Standing;                                                   // 0x0008   (0x0038)  
	FBBQMovementSettings                               Crouching;                                                  // 0x0040   (0x0038)  
};

/// Struct /Script/BBQGameSession.BBQMovementSettingsState
/// Size: 0x01E8 (488 bytes) (0x000008 - 0x0001E8) align 8 MaxSize: 0x01E8
struct FBBQMovementSettingsState : FTableRowBase
{ 
	FBBQMovementSettingsStance                         VelocityDirection;                                          // 0x0008   (0x0078)  
	FBBQMovementSettingsStance                         LookingDirection;                                           // 0x0080   (0x0078)  
	FBBQMovementSettingsStance                         Aiming;                                                     // 0x00F8   (0x0078)  
	FBBQMovementSettingsStance                         DraggingVictim;                                             // 0x0170   (0x0078)  
};

/// Struct /Script/BBQGameSession.BBQMovementSettingsMode
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQMovementSettingsMode : FTableRowBase
{ 
	float                                              LadderClimbUpDistance;                                      // 0x0008   (0x0004)  
	float                                              LadderClimbUpSpeed;                                         // 0x000C   (0x0004)  
	float                                              LadderClimbDownDistance;                                    // 0x0010   (0x0004)  
	float                                              LadderClimbDownSpeed;                                       // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQAnimatedMontage
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 MaxSize: 0x0048
struct FBBQAnimatedMontage
{ 
	EBBQAnimatedMontageType                            Type;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	class UAnimMontage*                                Montage;                                                    // 0x0008   (0x0008)  
	float                                              PlayRate;                                                   // 0x0010   (0x0004)  
	float                                              StartingPosition;                                           // 0x0014   (0x0004)  
	FName                                              StartingSection;                                            // 0x0018   (0x0008)  
	FGameplayTagContainer                              GrantedTags;                                                // 0x0020   (0x0020)  
	int32_t                                            Context;                                                    // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.BBQAnimationData
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 4 MaxSize: 0x0038
struct FBBQAnimationData
{ 
	FVector                                            StartLocation;                                              // 0x0000   (0x000C)  
	FVector                                            EndLocation;                                                // 0x000C   (0x000C)  
	FVector                                            ExitLocation;                                               // 0x0018   (0x000C)  
	FRotator                                           Rotation;                                                   // 0x0024   (0x000C)  
	FGameplayTag                                       TargetMovementState;                                        // 0x0030   (0x0008)  
};

/// Struct /Script/BBQGameSession.BBQWellData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQWellData
{ 
	class ABBQWell*                                    Well;                                                       // 0x0000   (0x0008)  
	EBBQWellEnteringMethod                             EnteringMethod;                                             // 0x0008   (0x0001)  
	bool                                               bIsIncapacitated;                                           // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/BBQGameSession.BBQAnimationState
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBBQAnimationState
{ 
	EBBQAnimationState                                 State;                                                      // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	FBBQAnimationData                                  Data;                                                       // 0x0004   (0x0038)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	FBBQWellData                                       WellData;                                                   // 0x0040   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQDraggingInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQDraggingInfo
{ 
	class ABBQGameSessionCharacterAnimated*            DraggedPlayer;                                              // 0x0000   (0x0008)  
	class ABBQContextualKillLocation*                  ContextualKillLocation;                                     // 0x0008   (0x0008)  
	EDraggingState                                     State;                                                      // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQWellInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQWellInfo
{ 
	class AActor*                                      WellBeingUsed;                                              // 0x0000   (0x0008)  
	EBBQWellEnteringMethod                             WellEnteringMethod;                                         // 0x0008   (0x0001)  
	EBBQUsingFromWellState                             UsingWellState;                                             // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x000A   (0x0006)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMinigameInstigatorSavedState
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBBQMinigameInstigatorSavedState
{ 
	TMap<FName, FBBQMinigameSavedState>                SavedMinigameStateMap;                                      // 0x0000   (0x0050)  
};

/// Struct /Script/BBQGameSession.BBQGlobalOutlineRendererConfig
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FBBQGlobalOutlineRendererConfig
{ 
	FGameplayTagContainer                              OwnerIgnoreTags;                                            // 0x0000   (0x0020)  
	TArray<FName>                                      OutlineInstancesIgnored;                                    // 0x0020   (0x0010)  
};

/// Struct /Script/BBQGameSession.GrandpaSpawnSettings
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FGrandpaSpawnSettings
{ 
	bool                                               bLeftFeedingLocatorEnabled;                                 // 0x0000   (0x0001)  
	bool                                               bRightFeedingLocatorEnabled;                                // 0x0001   (0x0001)  
};

/// Struct /Script/BBQGameSession.GrandpaPerceptionInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FGrandpaPerceptionInfo
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/BBQGameSession.GrandpaFeedingInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FGrandpaFeedingInfo
{ 
	class ABBQGameSessionCharacterAnimated*            CharacterFeedingBlood;                                      // 0x0000   (0x0008)  
	class USceneComponent*                             LocatorBeingUsed;                                           // 0x0008   (0x0008)  
	bool                                               bIsLeftLocator;                                             // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0011   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQHidingSpotCurves
/// Size: 0x00C8 (200 bytes) (0x000000 - 0x0000C8) align 8 MaxSize: 0x00C8
struct FBBQHidingSpotCurves
{ 
	class UCurveVector*                                EnterCurve;                                                 // 0x0000   (0x0008)  
	class UCurveVector*                                LeaveCurve;                                                 // 0x0008   (0x0008)  
	class UCurveVector*                                BurstOutCurve;                                              // 0x0010   (0x0008)  
	class UCurveVector*                                SearchFailDefaultCurve;                                     // 0x0018   (0x0008)  
	TMap<FGameplayTag, class UCurveVector*>            SearchFailCurveBySearchingCharacter;                        // 0x0020   (0x0050)  
	class UCurveVector*                                SearchSuccessDefaultCurve;                                  // 0x0070   (0x0008)  
	TMap<FGameplayTag, class UCurveVector*>            SearchSuccessCurveBySearchingCharacter;                     // 0x0078   (0x0050)  
};

/// Struct /Script/BBQGameSession.HidingPlayerCameraInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 MaxSize: 0x0018
struct FHidingPlayerCameraInfo
{ 
	FVector                                            HidingPlayerLocation;                                       // 0x0000   (0x000C)  
	FRotator                                           HidingPlayerRotation;                                       // 0x000C   (0x000C)  
};

/// Struct /Script/BBQGameSession.HidingCharacterInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FHidingCharacterInfo
{ 
	class ABBQGameSessionCharacter*                    HidingCharacter;                                            // 0x0000   (0x0008)  
	EBBQHidingPlayerState                              CurrentState;                                               // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQLevelSequenceAnimOverride
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBBQLevelSequenceAnimOverride
{ 
	TMap<class UAnimSequenceBase*, class UAnimSequenceBase*> Overrides;                                            // 0x0000   (0x0050)  
};

/// Struct /Script/BBQGameSession.IncapAnimSlotSet
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FIncapAnimSlotSet
{ 
	FBBQCinematicCameraSetup                           CameraSetup;                                                // 0x0000   (0x0048)  
	EBBQCombatAnimSlot                                 DownAnimSlot_Stationary;                                    // 0x0048   (0x0001)  
	EBBQCombatAnimSlot                                 DownAnimSlot_Moving;                                        // 0x0049   (0x0001)  
	EBBQCombatAnimSlot                                 ToNeutralAnimSlot;                                          // 0x004A   (0x0001)  
	unsigned char                                      UnknownData00_7[0x5];                                       // 0x004B   (0x0005)  MISSED
};

/// Struct /Script/BBQGameSession.IncapResponse
/// Size: 0x00C8 (200 bytes) (0x000000 - 0x0000C8) align 8 MaxSize: 0x00C8
struct FIncapResponse
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	bool                                               bUseAttackerToDetermineDirection;                           // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	FGameplayTagContainer                              InResponseToTags;                                           // 0x0018   (0x0020)  
	FGameplayTagContainer                              CharacterRequiredTags;                                      // 0x0038   (0x0020)  
	FGameplayTagContainer                              CharacterForbiddenTags;                                     // 0x0058   (0x0020)  
	TMap<EBBQHitReactionDirection, FIncapAnimSlotSet>  IncapAnimSlotSets;                                          // 0x0078   (0x0050)  
};

/// Struct /Script/BBQGameSession.LightSourceMaterialInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLightSourceMaterialInfo
{ 
	int32_t                                            MaterialIndex;                                              // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	class UMaterialInterface*                          MaterialInterface;                                          // 0x0008   (0x0008)  
};

/// Struct /Script/BBQGameSession.LightSourceInteraction
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLightSourceInteraction
{ 
	class ABBQGameSessionCharacterAnimated*            InteractingPlayer;                                          // 0x0000   (0x0008)  
	ELightSourceState                                  FinalState;                                                 // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.InteractionPrimativePair
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FInteractionPrimativePair
{ 
	class UBBQInteractionComponent*                    InteractionComponent;                                       // 0x0000   (0x0008)  
	class UPrimitiveComponent*                         PrimitiveComponent;                                         // 0x0008   (0x0008)  
};

/// Struct /Script/BBQGameSession.InteractionAvailabilityEventData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FInteractionAvailabilityEventData
{ 
	class UBBQInteractionEventComponent*               InteractionEventComponent;                                  // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0008   (0x0010)  MISSED
};

/// Struct /Script/BBQGameSession.InteractionAvailabilityData
/// Size: 0x0128 (296 bytes) (0x000000 - 0x000128) align 8 MaxSize: 0x0128
struct FInteractionAvailabilityData
{ 
	class UBBQInteractionComponent*                    InteractionComponent;                                       // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x28];                                      // 0x0008   (0x0028)  MISSED
	TMap<class UBBQInteractionEventComponent*, FInteractionAvailabilityEventData> EventAvailabiltyData;            // 0x0030   (0x0050)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0080   (0x0008)  MISSED
	TMap<uint32_t, class UBBQInteractionEventComponent*> InteractionMethodToAvailableEventMap_Press;               // 0x0088   (0x0050)  
	TMap<uint32_t, class UBBQInteractionEventComponent*> InteractionMethodToAvailableEventMap_Hold;                // 0x00D8   (0x0050)  
};

/// Struct /Script/BBQGameSession.LadderInteractionInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLadderInteractionInfo
{ 
	class ABBQGameSessionCharacterAnimated*            InteractingCharacter;                                       // 0x0000   (0x0008)  
	ELadderInteractionState                            TargetState;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQLadderEnterTopCorrectionInfo
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 MaxSize: 0x0014
struct FBBQLadderEnterTopCorrectionInfo
{ 
	FName                                              CharacterName;                                              // 0x0000   (0x0008)  
	bool                                               bAllMaleVictims;                                            // 0x0008   (0x0001)  
	bool                                               bAllFemaleVictims;                                          // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x000A   (0x0002)  MISSED
	float                                              ZOffsetCorrection;                                          // 0x000C   (0x0004)  
	float                                              TimeTaken;                                                  // 0x0010   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQLevelSequenceCollisionDataSample
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 MaxSize: 0x0018
struct FBBQLevelSequenceCollisionDataSample
{ 
	FVector                                            TraceStartPoint;                                            // 0x0000   (0x000C)  
	FVector                                            TraceEndPoint;                                              // 0x000C   (0x000C)  
};

/// Struct /Script/BBQGameSession.BBQLockLocations
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQLockLocations
{ 
	class USceneComponent*                             Front;                                                      // 0x0000   (0x0008)  
	class USceneComponent*                             Rear;                                                       // 0x0008   (0x0008)  
	class USceneComponent*                             Frame;                                                      // 0x0010   (0x0008)  
};

/// Struct /Script/BBQGameSession.MeleeHitReactionAnimSlotSet
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 1 MaxSize: 0x0004
struct FMeleeHitReactionAnimSlotSet
{ 
	EBBQCombatAnimSlot                                 Default;                                                    // 0x0000   (0x0001)  
	EBBQCombatAnimSlot                                 Stationary;                                                 // 0x0001   (0x0001)  
	EBBQCombatAnimSlot                                 Crouched;                                                   // 0x0002   (0x0001)  
	EBBQCombatAnimSlot                                 Stationary_Crouched;                                        // 0x0003   (0x0001)  
};

/// Struct /Script/BBQGameSession.MeleeHitReaction
/// Size: 0x0090 (144 bytes) (0x000000 - 0x000090) align 8 MaxSize: 0x0090
struct FMeleeHitReaction
{ 
	FGameplayTagContainer                              DamageTypeTriggers;                                         // 0x0000   (0x0020)  
	TMap<EBBQHitReactionDirection, FMeleeHitReactionAnimSlotSet> HitReactionAnimSlotSets;                          // 0x0020   (0x0050)  
	float                                              MovingMontageSpeedThreshold;                                // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
	class UAkAudioEvent*                               OnHitAkEvent;                                               // 0x0078   (0x0008)  
	class UAkAudioEvent*                               OnHitAkEvent3P;                                             // 0x0080   (0x0008)  
	bool                                               bCanBreakOutOfStationary;                                   // 0x0088   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0089   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMovementOscillator
/// Size: 0x002C (44 bytes) (0x000000 - 0x00002C) align 4 MaxSize: 0x002C
struct FBBQMovementOscillator
{ 
	FFOscillator                                       ForwardMovementOscillator;                                  // 0x0000   (0x000C)  
	FFOscillator                                       SideMovementOscillator;                                     // 0x000C   (0x000C)  
	float                                              BlendInTime;                                                // 0x0018   (0x0004)  
	float                                              BlendOutTime;                                               // 0x001C   (0x0004)  
	float                                              DurationMin;                                                // 0x0020   (0x0004)  
	float                                              DurationMax;                                                // 0x0024   (0x0004)  
	bool                                               bChangeStance;                                              // 0x0028   (0x0001)  
	BBQStance                                          StanceOnBegin;                                              // 0x0029   (0x0001)  
	BBQStance                                          StanceOnEnd;                                                // 0x002A   (0x0001)  
	unsigned char                                      UnknownData00_7[0x1];                                       // 0x002B   (0x0001)  MISSED
};

/// Struct /Script/BBQGameSession.BBQMultiplayerMinigameInfo
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBBQMultiplayerMinigameInfo
{ 
	TWeakObjectPtr<class ABBQGameSessionCharacter*>    OpponentCharacter;                                          // 0x0000   (0x0008)  
	float                                              OpponentPoints;                                             // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.NetSyncedDoorAnimation
/// Size: 0x0034 (52 bytes) (0x000000 - 0x000034) align 4 MaxSize: 0x0034
struct FNetSyncedDoorAnimation
{ 
	float                                              Duration;                                                   // 0x0000   (0x0004)  
	FRotator                                           StartRotator;                                               // 0x0004   (0x000C)  
	FRotator                                           EndRotator;                                                 // 0x0010   (0x000C)  
	FVector                                            StartOffset;                                                // 0x001C   (0x000C)  
	FVector                                            EndOffset;                                                  // 0x0028   (0x000C)  
};

/// Struct /Script/BBQGameSession.PlayerInNoiseMakerInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FPlayerInNoiseMakerInfo
{ 
	class ABBQGameSessionCharacter*                    Character;                                                  // 0x0000   (0x0008)  
	char                                               TriggerReason;                                              // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.OutlineInstance
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FOutlineInstance
{ 
	FName                                              InstanceName;                                               // 0x0000   (0x0008)  
	TArray<float>                                      TimeByColorIndex;                                           // 0x0008   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQPickupDispenserState
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBBQPickupDispenserState
{ 
	TWeakObjectPtr<class ABBQGameSessionCharacter*>    CurrentEventInstigator;                                     // 0x0000   (0x0008)  
	EBBQAnimSlot                                       GrabPickupAnimSlot;                                         // 0x0008   (0x0001)  
	EEndMinigameReason                                 MinigameEndReason;                                          // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_7[0x2];                                       // 0x000A   (0x0002)  MISSED
};

/// Struct /Script/BBQGameSession.PickupZoneSpawnData
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FPickupZoneSpawnData
{ 
	FGameplayTag                                       PickupDispenserType;                                        // 0x0000   (0x0008)  
	int32_t                                            SpawnAmount;                                                // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.PickupZoneData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FPickupZoneData
{ 
	FGameplayTag                                       Zone;                                                       // 0x0000   (0x0008)  
	TArray<FPickupZoneSpawnData>                       PickupSpawnData;                                            // 0x0008   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQPickupSpawnerData
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBBQPickupSpawnerData
{ 
	FGameplayTag                                       PickupZone;                                                 // 0x0000   (0x0008)  
	float                                              Probability;                                                // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.PipeValveInteractionInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FPipeValveInteractionInfo
{ 
	class ABBQGameSessionCharacterAnimated*            InteractingCharacter;                                       // 0x0000   (0x0008)  
	EPipeValveState                                    TargetState;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.PolicePhoneInteractionState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FPolicePhoneInteractionState
{ 
	class ABBQGameSessionCharacterAnimated*            InteractingCharacter;                                       // 0x0000   (0x0008)  
	EPolicePhoneAction                                 Action;                                                     // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.QuadrantInfo
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FQuadrantInfo
{ 
	float                                              StartAngle;                                                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	class USceneComponent*                             AnimationLocator;                                           // 0x0008   (0x0008)  
	bool                                               bIsActive;                                                  // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	class UClass*                                      SneakAttackBehaviour;                                       // 0x0018   (0x0008)  
};

/// Struct /Script/BBQGameSession.SneakAttackInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FSneakAttackInfo
{ 
	class ABBQGameSessionCharacterAnimated*            AttackingPlayer;                                            // 0x0000   (0x0008)  
	int32_t                                            QuadrantUsed;                                               // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.BBQSpyAbilityMontageData
/// Size: 0x00C0 (192 bytes) (0x000000 - 0x0000C0) align 8 MaxSize: 0x00C0
struct FBBQSpyAbilityMontageData
{ 
	EBBQAnimSlot                                       AnimSlot;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FGameplayVariableFloat                             Duration;                                                   // 0x0008   (0x0058)  
	FGameplayTagContainer                              RequiredTags;                                               // 0x0060   (0x0020)  
	FGameplayTagContainer                              ForbiddenTags;                                              // 0x0080   (0x0020)  
	FGameplayTagContainer                              MontageDurationTags;                                        // 0x00A0   (0x0020)  
};

/// Struct /Script/BBQGameSession.BBQStudyAndTamperKnowledgePoints
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBBQStudyAndTamperKnowledgePoints
{ 
	FName                                              Group;                                                      // 0x0000   (0x0008)  
	int32_t                                            Points;                                                     // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQStudyAndTamperInspection
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQStudyAndTamperInspection : FTableRowBase
{ 
	FName                                              Group;                                                      // 0x0008   (0x0008)  
	int32_t                                            Points;                                                     // 0x0010   (0x0004)  
	bool                                               bCanBeTampered;                                             // 0x0014   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0015   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.AttributeTrigger
/// Size: 0x0078 (120 bytes) (0x000000 - 0x000078) align 8 MaxSize: 0x0078
struct FAttributeTrigger
{ 
	FGameplayAttribute                                 TriggerAttribute;                                           // 0x0000   (0x0038)  
	FGameplayAttribute                                 TriggerAttributeMax;                                        // 0x0038   (0x0038)  
	float                                              AttributeTriggerValue;                                      // 0x0070   (0x0004)  
	EAttributeComparison                               Comparison;                                                 // 0x0074   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0075   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.PlayerInTriggerAreaInfo
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FPlayerInTriggerAreaInfo
{ 
	class ABBQGameSessionCharacter*                    Character;                                                  // 0x0000   (0x0008)  
	bool                                               bTriggered;                                                 // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.BBQFootprintTrail
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQFootprintTrail
{ 
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0000   (0x0004)  MISSED
	TWeakObjectPtr<class ABBQGameSessionCharacter*>    OwnerCharacter;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FBBQFootprint>                              Footprints;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/BBQGameSession.ActiveSpectatorState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FActiveSpectatorState
{ 
	TWeakObjectPtr<class ABBQPlayerState*>             PlayerState;                                                // 0x0000   (0x0008)  
	class AActor*                                      ViewTarget;                                                 // 0x0008   (0x0008)  
};

/// Struct /Script/BBQGameSession.SpectatorLevelSequenceInfo
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FSpectatorLevelSequenceInfo
{ 
	class ABBQPlayerState*                             OwningPlayer;                                               // 0x0000   (0x0008)  
	class ULevelSequencePlayer*                        LevelSequencePlayer;                                        // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0010   (0x0018)  MISSED
};

/// Struct /Script/BBQGameSession.BBQWindowJumpData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 MaxSize: 0x0018
struct FBBQWindowJumpData
{ 
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0000   (0x0018)  MISSED
};

/// Struct /Script/BBQGameSession.ReplicatedOutlineInfo
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FReplicatedOutlineInfo
{ 
	FOutlineInstance                                   OutlineInstance;                                            // 0x0000   (0x0018)  
	float                                              MatchTimeUpdated;                                           // 0x0018   (0x0004)  
	bool                                               bVisibleToSpectators;                                       // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x001D   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.ReplicatedActorOutlineInfo
/// Size: 0x0028 (40 bytes) (0x00000C - 0x000028) align 8 MaxSize: 0x0028
struct FReplicatedActorOutlineInfo : FFastArraySerializerItem
{ 
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x000C   (0x0004)  MISSED
	class AActor*                                      HighlightedActor;                                           // 0x0010   (0x0008)  
	TArray<FReplicatedOutlineInfo>                     OutlineInfo;                                                // 0x0018   (0x0010)  
};

/// Struct /Script/BBQGameSession.PlayerOutlineContainer
/// Size: 0x0120 (288 bytes) (0x000108 - 0x000120) align 8 MaxSize: 0x0120
struct FPlayerOutlineContainer : FFastArraySerializer
{ 
	TArray<FReplicatedActorOutlineInfo>                OutlineInfoArr;                                             // 0x0108   (0x0010)  
	class ABBQGameSessionPlayerState*                  OwnerPlayerState;                                           // 0x0118   (0x0008)  
};

/// Struct /Script/BBQGameSession.DecalSettingBase
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FDecalSettingBase
{ 
	class UMaterialInterface*                          DecalMaterial;                                              // 0x0000   (0x0008)  
	FVector                                            DecalSize;                                                  // 0x0008   (0x000C)  
	float                                              DecalLifetime;                                              // 0x0014   (0x0004)  
	float                                              DecalFadeDuration;                                          // 0x0018   (0x0004)  
	FVector2D                                          RandomDeltaRoll;                                            // 0x001C   (0x0008)  
	FBox                                               DecalScaleRange;                                            // 0x0024   (0x001C)  
	FName                                              SubUVLimitsParam;                                           // 0x0040   (0x0008)  
	FName                                              SubUVSelectionParam;                                        // 0x0048   (0x0008)  
};

/// Struct /Script/BBQGameSession.BloodSplashDecalSettings
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBloodSplashDecalSettings
{ 
	TArray<class UMaterialInterface*>                  SplashDecalMaterialsFloor;                                  // 0x0000   (0x0010)  
	TArray<class UMaterialInterface*>                  SplashDecalMaterialsWall;                                   // 0x0010   (0x0010)  
	FVector                                            BaseDecalSizeFloor;                                         // 0x0020   (0x000C)  
	FVector                                            BaseDecalSizeWall;                                          // 0x002C   (0x000C)  
	float                                              FloorDecalLifetime;                                         // 0x0038   (0x0004)  
	float                                              FloorDecalFadeDuration;                                     // 0x003C   (0x0004)  
	float                                              WallDecalLifetime;                                          // 0x0040   (0x0004)  
	FVector2D                                          DecalScaleRange;                                            // 0x0044   (0x0008)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.PostHitSplashSettings
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 MaxSize: 0x0068
struct FPostHitSplashSettings
{ 
	EBBQAttackType                                     AttackerSplashType;                                         // 0x0000   (0x0001)  
	EBBQAttackType                                     BystanderSplashType;                                        // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	FBloodSplashDecalSettings                          EnvironmentBloodSplashSettings;                             // 0x0008   (0x0050)  
	FVector2D                                          SplashRandomPitchYawRange;                                  // 0x0058   (0x0008)  
	float                                              SplashDistance;                                             // 0x0060   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0064   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.VisualDamageInteractionParam
/// Size: 0x00D8 (216 bytes) (0x000000 - 0x0000D8) align 8 MaxSize: 0x00D8
struct FVisualDamageInteractionParam
{ 
	EBBQAttackType                                     AttackType;                                                 // 0x0000   (0x0001)  
	TEnumAsByte<EPhysicalSurface>                      ObjectSurfaceType;                                          // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	class UNiagaraSystem*                              ParticleEffect;                                             // 0x0008   (0x0008)  
	bool                                               bIsParticleAttached;                                        // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	FDecalSettingBase                                  DamageDecalSettings;                                        // 0x0018   (0x0050)  
	class UAkAudioEvent*                               ImpactSound;                                                // 0x0068   (0x0008)  
	FPostHitSplashSettings                             SplashSettings;                                             // 0x0070   (0x0068)  
};

/// Struct /Script/BBQGameSession.DyanmicMaterialContainer
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FDyanmicMaterialContainer
{ 
	class UMaterialInstanceDynamic*                    DynamicMaterial;                                            // 0x0000   (0x0008)  
	class UMaterialInterface*                          OriginalMeshMaterial;                                       // 0x0008   (0x0008)  
	int32_t                                            StaticMaterialIndexOnMesh;                                  // 0x0010   (0x0004)  
	bool                                               bSupportsErode;                                             // 0x0014   (0x0001)  
	bool                                               bSupportsSwitchableHeadTrauma;                              // 0x0015   (0x0001)  
	bool                                               bIsInvisibleMat;                                            // 0x0016   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0017   (0x0001)  MISSED
	int32_t                                            ErodeProgressParamIndex;                                    // 0x0018   (0x0004)  
	int32_t                                            HeadTraumaParamIndex;                                       // 0x001C   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQFamilyBondActivity
/// Size: 0x0080 (128 bytes) (0x000008 - 0x000080) align 8 MaxSize: 0x0080
struct FBBQFamilyBondActivity : FTableRowBase
{ 
	FText                                              Event_Name;                                                 // 0x0008   (0x0018)  
	int32_t                                            Points;                                                     // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FGameplayVariable                                  OffsetGameplayVariable;                                     // 0x0028   (0x0050)  
	bool                                               bIsConsumeActivity;                                         // 0x0078   (0x0001)  
	bool                                               bCanEffectWhileGranpaInactive;                              // 0x0079   (0x0001)  
	unsigned char                                      UnknownData01_7[0x6];                                       // 0x007A   (0x0006)  MISSED
};

/// Struct /Script/BBQGameSession.BBQBloodTrailDefinition
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQBloodTrailDefinition : FTableRowBase
{ 
	float                                              StartDelay;                                                 // 0x0008   (0x0004)  
	float                                              TrailDuration;                                              // 0x000C   (0x0004)  
	float                                              TrailSpawnInterval;                                         // 0x0010   (0x0004)  
	float                                              IncreaseInBleedoutMultiplier;                               // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.CommEventData
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FCommEventData
{ 
	FGameplayTag                                       EventTag;                                                   // 0x0000   (0x0008)  
	class AActor*                                      Instigator;                                                 // 0x0008   (0x0008)  
	class AActor*                                      Addressee;                                                  // 0x0010   (0x0008)  
	FName                                              EventId;                                                    // 0x0018   (0x0008)  
};

/// Struct /Script/BBQGameSession.MeleeAttackMontageSet
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FMeleeAttackMontageSet
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/BBQGameSession.BBQPairedAnimationRole
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 16 MaxSize: 0x0050
struct FBBQPairedAnimationRole
{ 
	class UAnimMontage*                                AnimationMontage;                                           // 0x0000   (0x0008)  
	class ULevelSequence*                              LevelSequence;                                              // 0x0008   (0x0008)  
	EBBQPairedAnimRoleTransformRule                    AnimationTransformRule;                                     // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0xF];                                       // 0x0011   (0x000F)  MISSED
	FTransform                                         AdditionalOffset;                                           // 0x0020   (0x0030)  
};

/// Struct /Script/BBQGameSession.BBQRotationSettings
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FBBQRotationSettings
{ 
	BBQRotationMode                                    Mode;                                                       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              TargetInterpSpeed;                                          // 0x0004   (0x0004)  
	float                                              ActorInterpSpeed;                                           // 0x0008   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQCloseEncounterDialogDefinition
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FBBQCloseEncounterDialogDefinition
{ 
	FGameplayTag                                       CommEventTag;                                               // 0x0000   (0x0008)  
	bool                                               bPlayOnBoth;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              PlayOnLeaderChance;                                         // 0x000C   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQCloseEncounterDefinition
/// Size: 0x01F0 (496 bytes) (0x000008 - 0x0001F0) align 8 MaxSize: 0x01F0
struct FBBQCloseEncounterDefinition : FTableRowBase
{ 
	TMap<ECloseEncounterState, EBBQPairedAnimSlot>     PairedAnimSlotMap;                                          // 0x0008   (0x0050)  
	TMap<ECloseEncounterState, FGameplayTag>           GameplayTagMap;                                             // 0x0058   (0x0050)  
	FGameplayTagContainer                              TagsWhilstAttacking;                                        // 0x00A8   (0x0020)  
	FGameplayTagContainer                              TagsWhilstDefending;                                        // 0x00C8   (0x0020)  
	FGameplayTagContainer                              CancelAbilitiesWithTag;                                     // 0x00E8   (0x0020)  
	class UClass*                                      AttackerWinEffect;                                          // 0x0108   (0x0008)  
	class UClass*                                      AttackerLoseEffect;                                         // 0x0110   (0x0008)  
	class UClass*                                      AttackerLoseDueToInterruptEffect;                           // 0x0118   (0x0008)  
	class UClass*                                      DefenderWinEffect;                                          // 0x0120   (0x0008)  
	class UClass*                                      DefenderLoseEffect;                                         // 0x0128   (0x0008)  
	class UClass*                                      DefenderAreaEffect;                                         // 0x0130   (0x0008)  
	float                                              DefenderAreaEffectRadius;                                   // 0x0138   (0x0004)  
	float                                              DefenderIgnoreCollisionTime;                                // 0x013C   (0x0004)  
	ECloseEncounterWinnerSelection                     WinnerSelection;                                            // 0x0140   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0141   (0x0007)  MISSED
	class UClass*                                      MinigameClass;                                              // 0x0148   (0x0008)  
	bool                                               bSpawnSinglePlayerMinigameForDefender;                      // 0x0150   (0x0001)  
	bool                                               bEndEarlyWhenDefenderDone;                                  // 0x0151   (0x0001)  
	bool                                               bAttemptExecution;                                          // 0x0152   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x0153   (0x0001)  MISSED
	float                                              AttackerDamage;                                             // 0x0154   (0x0004)  
	float                                              DefenderDamage;                                             // 0x0158   (0x0004)  
	float                                              ClearanceAreaSize;                                          // 0x015C   (0x0004)  
	bool                                               bAutoRotateAttacker;                                        // 0x0160   (0x0001)  
	bool                                               bAutoRotateDefender;                                        // 0x0161   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0162   (0x0002)  MISSED
	FName                                              AttackerCameraState;                                        // 0x0164   (0x0008)  
	FName                                              MainDefenderCameraState;                                    // 0x016C   (0x0008)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0174   (0x0004)  MISSED
	class UAkAudioEvent*                               CloseEncounterActiveEvent;                                  // 0x0178   (0x0008)  
	class UAkAudioEvent*                               AttackerWinEvent;                                           // 0x0180   (0x0008)  
	class UAkAudioEvent*                               DefenderWinEvent;                                           // 0x0188   (0x0008)  
	class UAkRtpc*                                     MinigameActiveRTPC;                                         // 0x0190   (0x0008)  
	class UAkRtpc*                                     MinigameProgressRTPC;                                       // 0x0198   (0x0008)  
	TMap<ECloseEncounterState, FBBQCloseEncounterDialogDefinition> CloseEncounterStateDialogMap;                   // 0x01A0   (0x0050)  
};

/// Struct /Script/BBQGameSession.CommRuntimeState
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FCommRuntimeState
{ 
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x0000   (0x0038)  MISSED
};

/// Struct /Script/BBQGameSession.DialogRow
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FDialogRow : FTableRowBase
{ 
	FName                                              CommId;                                                     // 0x0008   (0x0008)  
	FString                                            TextLocKey;                                                 // 0x0010   (0x0010)  
	FString                                            CharacterName;                                              // 0x0020   (0x0010)  
	FString                                            AddresseeName;                                              // 0x0030   (0x0010)  
	EBBQEmotion                                        FacialAnim;                                                 // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              DurationOverride;                                           // 0x0044   (0x0004)  
	float                                              BlendOverride;                                              // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.CommRow
/// Size: 0x0070 (112 bytes) (0x000008 - 0x000070) align 8 MaxSize: 0x0070
struct FCommRow : FTableRowBase
{ 
	FString                                            SubCommId;                                                  // 0x0008   (0x0010)  
	FGameplayTagContainer                              RequiredTags;                                               // 0x0018   (0x0020)  
	FGameplayTagContainer                              BlockedTags;                                                // 0x0038   (0x0020)  
	float                                              Probability;                                                // 0x0058   (0x0004)  
	ECommBroadcastRule                                 FamilyBroadcastRule;                                        // 0x005C   (0x0001)  
	ECommBroadcastRule                                 VictimBroadcastRule;                                        // 0x005D   (0x0001)  
	ECommVocalisationType                              VocalisationType;                                           // 0x005E   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x005F   (0x0001)  MISSED
	float                                              CharacterCooldown;                                          // 0x0060   (0x0004)  
	float                                              GlobalCooldown;                                             // 0x0064   (0x0004)  
	float                                              MaxRange;                                                   // 0x0068   (0x0004)  
	char                                               Priority;                                                   // 0x006C   (0x0001)  
	bool                                               AllowInDanger;                                              // 0x006D   (0x0001)  
	bool                                               AllowIfPoolExhausted;                                       // 0x006E   (0x0001)  
	bool                                               ShuffleLines;                                               // 0x006F   (0x0001)  
};

/// Struct /Script/BBQGameSession.FootstepData
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FFootstepData
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/BBQGameSession.BBQGameplayAbilityTargetData_ClueInfo
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQGameplayAbilityTargetData_ClueInfo : FGameplayAbilityTargetData
{ 
	TArray<FBBQGameplayAbilityTargetingClueInfo>       TargetClueArray;                                            // 0x0008   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQGameplayAbilityTargetData_SingleLocationInfo
/// Size: 0x0080 (128 bytes) (0x000008 - 0x000080) align 16 MaxSize: 0x0080
struct FBBQGameplayAbilityTargetData_SingleLocationInfo : FGameplayAbilityTargetData
{ 
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0008   (0x0008)  MISSED
	FGameplayAbilityTargetingLocationInfo              TargetLocation;                                             // 0x0010   (0x0070)  
};

/// Struct /Script/BBQGameSession.BBQGameplayAbilityTargetData_CookListen
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQGameplayAbilityTargetData_CookListen : FGameplayAbilityTargetData
{ 
	float                                              DistanceToOwnerAvatar;                                      // 0x0008   (0x0004)  
	float                                              HoldTime;                                                   // 0x000C   (0x0004)  
	SDK_UNDEFINED(16,479) /* TArray<TWeakObjectPtr<AActor*>> */ __um(TargetActorArray);                            // 0x0010   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQGameplayActivityEvent
/// Size: 0x0098 (152 bytes) (0x000008 - 0x000098) align 8 MaxSize: 0x0098
struct FBBQGameplayActivityEvent : FTableRowBase
{ 
	FText                                              EventName;                                                  // 0x0008   (0x0018)  
	FText                                              HUDMessage;                                                 // 0x0020   (0x0018)  
	TWeakObjectPtr<class UTexture2D*>                  EventIcon;                                                  // 0x0038   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0040   (0x0020)  MISSED
	int64_t                                            ExperiencePoints;                                           // 0x0060   (0x0008)  
	EGameplayActivityEventReceiver                     ExperiencePointsBeneficiary;                                // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0069   (0x0003)  MISSED
	int32_t                                            TimesPointsCanBeReceived;                                   // 0x006C   (0x0004)  
	EGameplayActivityEventReceiver                     EventReceiver;                                              // 0x0070   (0x0001)  
	bool                                               bAllowSpectators;                                           // 0x0071   (0x0001)  
	EBBQNotificationType                               NotificationType;                                           // 0x0072   (0x0001)  
	unsigned char                                      UnknownData02_6[0x5];                                       // 0x0073   (0x0005)  MISSED
	class UClass*                                      NotificationWidget;                                         // 0x0078   (0x0008)  
	bool                                               bPlaySound;                                                 // 0x0080   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0081   (0x0007)  MISSED
	class UAkAudioEvent*                               NotificationSound;                                          // 0x0088   (0x0008)  
	int32_t                                            NotificationPriority;                                       // 0x0090   (0x0004)  
	unsigned char                                      UnknownData04_7[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.BBQNotificationData
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQNotificationData
{ 
	class ABBQPlayerState*                             PlayerState;                                                // 0x0000   (0x0008)  
	TArray<FText>                                      NotificationTexts;                                          // 0x0008   (0x0010)  
	SDK_UNDEFINED(16,480) /* TArray<TWeakObjectPtr<UTexture2D*>> */ __um(NotificationIcons);                       // 0x0018   (0x0010)  
	TArray<EUserPlatform>                              NotificationDisplayedPlatforms;                             // 0x0028   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQDynamicMontageParams
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQDynamicMontageParams
{ 
	class UAnimSequenceBase*                           Animation;                                                  // 0x0000   (0x0008)  
	float                                              BlendInTime;                                                // 0x0008   (0x0004)  
	float                                              BlendOutTime;                                               // 0x000C   (0x0004)  
	float                                              PlayRate;                                                   // 0x0010   (0x0004)  
	float                                              StartTime;                                                  // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQLeanAmount
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 MaxSize: 0x0008
struct FBBQLeanAmount
{ 
	float                                              LR;                                                         // 0x0000   (0x0004)  
	float                                              FB;                                                         // 0x0004   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQVelocityBlend
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FBBQVelocityBlend
{ 
	float                                              F;                                                          // 0x0000   (0x0004)  
	float                                              B;                                                          // 0x0004   (0x0004)  
	float                                              L;                                                          // 0x0008   (0x0004)  
	float                                              R;                                                          // 0x000C   (0x0004)  
};

/// Struct /Script/BBQGameSession.BBQComponentAndTransform
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 16 MaxSize: 0x0040
struct FBBQComponentAndTransform
{ 
	FTransform                                         Transform;                                                  // 0x0000   (0x0030)  
	class UPrimitiveComponent*                         Component;                                                  // 0x0030   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0038   (0x0008)  MISSED
};

/// Struct /Script/BBQGameSession.BBQHarvestAnimSections
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBBQHarvestAnimSections
{ 
	TMap<EHarvestOutcome, FName>                       SectionNames;                                               // 0x0000   (0x0050)  
};

/// Struct /Script/BBQGameSession.HidingPlayerInputState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FHidingPlayerInputState
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/BBQGameSession.InteractionEventTestFlags
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FInteractionEventTestFlags
{ 
	unsigned char                                      UnknownData00_2[0xC];                                       // 0x0000   (0x000C)  MISSED
};

/// Struct /Script/BBQGameSession.BBQInteractionEventList
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQInteractionEventList
{ 
	TArray<class UBBQInteractionEventComponent*>       PressEvents;                                                // 0x0000   (0x0010)  
	TArray<class UBBQInteractionEventComponent*>       HoldEvents;                                                 // 0x0010   (0x0010)  
};

/// Struct /Script/BBQGameSession.BBQLockAnimInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQLockAnimInfo
{ 
	class UAnimMontage*                                BeginMontage;                                               // 0x0000   (0x0008)  
	class UAnimMontage*                                LoopMontage;                                                // 0x0008   (0x0008)  
	class UAnimMontage*                                EndMontage;                                                 // 0x0010   (0x0008)  
};

/// Struct /Script/BBQGameSession.LockVisualState
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FLockVisualState
{ 
	class UStaticMesh*                                 StaticMesh;                                                 // 0x0000   (0x0008)  
	class UMaterial*                                   Material;                                                   // 0x0008   (0x0008)  
};

/// Struct /Script/BBQGameSession.BBQMinigameInputState
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 4 MaxSize: 0x0028
struct FBBQMinigameInputState
{ 
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0000   (0x0008)  MISSED
	bool                                               bAction;                                                    // 0x0008   (0x0001)  
	bool                                               bActionHold;                                                // 0x0009   (0x0001)  
	bool                                               bGenericAction1;                                            // 0x000A   (0x0001)  
	bool                                               bCancelPressed;                                             // 0x000B   (0x0001)  
	bool                                               bPrimaryAbilityKeyPressed;                                  // 0x000C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              XAxisLeftInput;                                             // 0x0010   (0x0004)  
	float                                              YAxisLeftInput;                                             // 0x0014   (0x0004)  
	float                                              XAxisRightInput;                                            // 0x0018   (0x0004)  
	float                                              YAxisRightInput;                                            // 0x001C   (0x0004)  
	float                                              ActionTimestamp;                                            // 0x0020   (0x0004)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.BBQPickupSpawnerMarkerDescription
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 16 MaxSize: 0x0040
struct FBBQPickupSpawnerMarkerDescription
{ 
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x0000   (0x0040)  MISSED
};

/// Struct /Script/BBQGameSession.BBQPointOfInterestDefinition
/// Size: 0x0090 (144 bytes) (0x000008 - 0x000090) align 8 MaxSize: 0x0090
struct FBBQPointOfInterestDefinition : FTableRowBase
{ 
	FDataTableRowHandle                                Category;                                                   // 0x0008   (0x0010)  
	ETeamID                                            RequiredTeam;                                               // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0019   (0x0007)  MISSED
	FGameplayTagContainer                              RequiredAnyCharacterTags;                                   // 0x0020   (0x0020)  
	FGameplayTagContainer                              RequiredAllCharacterTags;                                   // 0x0040   (0x0020)  
	FGameplayTagContainer                              ForbiddenCharacterTags;                                     // 0x0060   (0x0020)  
	float                                              Proximity;                                                  // 0x0080   (0x0004)  
	float                                              LookAtDurationMin;                                          // 0x0084   (0x0004)  
	float                                              LookAtDurationMax;                                          // 0x0088   (0x0004)  
	bool                                               bInfiniteLookAtDuration;                                    // 0x008C   (0x0001)  
	bool                                               bCheckLineOfSight;                                          // 0x008D   (0x0001)  
	unsigned char                                      UnknownData01_7[0x2];                                       // 0x008E   (0x0002)  MISSED
};

/// Struct /Script/BBQGameSession.BBQPointOfInterestCategory
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQPointOfInterestCategory : FTableRowBase
{ 
	int32_t                                            Priority;                                                   // 0x0008   (0x0004)  
	float                                              LookAtCooldownMin;                                          // 0x000C   (0x0004)  
	float                                              LookAtCooldownMax;                                          // 0x0010   (0x0004)  
	float                                              ProximityTolerance;                                         // 0x0014   (0x0004)  
};

/// Struct /Script/BBQGameSession.VisualDamageInstigatorSettings
/// Size: 0x0060 (96 bytes) (0x000000 - 0x000060) align 8 MaxSize: 0x0060
struct FVisualDamageInstigatorSettings
{ 
	EBBQAttackType                                     AttackTypeToUse;                                            // 0x0000   (0x0001)  
	bool                                               bInstigateOnOwningClient;                                   // 0x0001   (0x0001)  
	bool                                               bVectorsInLocalSpace;                                       // 0x0002   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0003   (0x0001)  MISSED
	FVector_NetQuantize100                             HitLocation;                                                // 0x0004   (0x000C)  
	FVector_NetQuantizeNormal                          HitNormal;                                                  // 0x0010   (0x000C)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	class AActor*                                      HitActor;                                                   // 0x0020   (0x0008)  
	class AActor*                                      Attacker;                                                   // 0x0028   (0x0008)  
	class USkeletalMeshComponent*                      HitActorMesh;                                               // 0x0030   (0x0008)  
	class USkeletalMeshComponent*                      AttackerMesh;                                               // 0x0038   (0x0008)  
	EBBQAnimationAttackDirection                       AnimationAttackDirection;                                   // 0x0040   (0x0001)  
	bool                                               bManualOverrideSuppressVFX;                                 // 0x0041   (0x0001)  
	bool                                               bManualOverrideWoundSettings;                               // 0x0042   (0x0001)  
	unsigned char                                      UnknownData02_6[0x1];                                       // 0x0043   (0x0001)  MISSED
	FRotator                                           OverrideWoundRotation;                                      // 0x0044   (0x000C)  
	FVector_NetQuantize                                OverrideActorWoundSize;                                     // 0x0050   (0x000C)  
	char                                               AttackVariation;                                            // 0x005C   (0x0001)  
	unsigned char                                      UnknownData03_7[0x3];                                       // 0x005D   (0x0003)  MISSED
};

/// Struct /Script/BBQGameSession.VisualDamageAttack
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FVisualDamageAttack
{ 
	class ABBQGameSessionCharacter*                    ActorCausingDamage;                                         // 0x0000   (0x0008)  
	class ABBQGameSessionCharacter*                    ActorReceivingDamage;                                       // 0x0008   (0x0008)  
	EBBQAttackType                                     AttackType;                                                 // 0x0010   (0x0001)  
	EBBQAttackVisualTraceType                          AttackVisualTraceType;                                      // 0x0011   (0x0001)  
	char                                               AttackVariation;                                            // 0x0012   (0x0001)  
	unsigned char                                      UnknownData00_7[0x5];                                       // 0x0013   (0x0005)  MISSED
};

/// Struct /Script/BBQGameSession.FamilyBondLevelProgressRow
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FFamilyBondLevelProgressRow : FTableRowBase
{ 
	int32_t                                            level;                                                      // 0x0008   (0x0004)  
	int32_t                                            TotalFamilyBondPoints;                                      // 0x000C   (0x0004)  
};

/// Struct /Script/BBQGameSession.InteractionEventVisualParams
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FInteractionEventVisualParams
{ 
	FText                                              Text;                                                       // 0x0000   (0x0018)  
	EInteractionMethod                                 InteractButton;                                             // 0x0018   (0x0001)  
	bool                                               bInteractionWithHold;                                       // 0x0019   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x001A   (0x0002)  MISSED
	float                                              CurrentHoldRatio;                                           // 0x001C   (0x0004)  
	EInteractionEventPromptType                        PromptType;                                                 // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0021   (0x0003)  MISSED
	FName                                              UIAssetIdentifier;                                          // 0x0024   (0x0008)  
	unsigned char                                      UnknownData02_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/BBQGameSession.InteractionHint
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FInteractionHint
{ 
	int32_t                                            Priority;                                                   // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FText                                              Content;                                                    // 0x0008   (0x0018)  
	FName                                              EventName;                                                  // 0x0020   (0x0008)  
	bool                                               bIsAlwaysVisible;                                           // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/BBQGameSession.InteractionVisualParams
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FInteractionVisualParams
{ 
	TArray<FInteractionEventVisualParams>              InteractionEventData;                                       // 0x0000   (0x0010)  
	class UTexture2D*                                  Icon;                                                       // 0x0010   (0x0008)  
	bool                                               bInteractionEnabled;                                        // 0x0018   (0x0001)  
	bool                                               bVisibility;                                                // 0x0019   (0x0001)  
	bool                                               bUsingHold;                                                 // 0x001A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x001B   (0x0001)  MISSED
	float                                              CurrentHoldRatio;                                           // 0x001C   (0x0004)  
	int32_t                                            ChosenPriority;                                             // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<FInteractionHint>                           AdditionalHints;                                            // 0x0028   (0x0010)  
};

/// Struct /Script/BBQGameSession.MottoPerkClassBonusRow
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000060) align 8 MaxSize: 0x0060
struct FMottoPerkClassBonusRow : FTableRowBase
{ 
	TMap<EMottoPerkCategory, int32_t>                  RequiredMottoPerks;                                         // 0x0008   (0x0050)  
	class UClass*                                      BonusPerks;                                                 // 0x0058   (0x0008)  
};

/// Struct /Script/BBQGameSession.NoiseEvent
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 MaxSize: 0x0014
struct FNoiseEvent
{ 
	ENoiseType                                         NoiseEmitterType;                                           // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	FVector                                            WorldLocation;                                              // 0x0004   (0x000C)  
	float                                              TimeToRemove;                                               // 0x0010   (0x0004)  
};

/// Class /Script/BBQGameSession.ABBQDismembermentActor
/// Size: 0x0228 (552 bytes) (0x000228 - 0x000228) align 8 MaxSize: 0x0228
class AABBQDismembermentActor : public AActor
{ 
public:
};

/// Class /Script/BBQGameSession.AssetSelectionDebugActor
/// Size: 0x0228 (552 bytes) (0x000228 - 0x000228) align 8 MaxSize: 0x0228
class AAssetSelectionDebugActor : public AActor
{ 
public:
};

/// Class /Script/BBQGameSession.BBQAbilityBarge
/// Size: 0x0738 (1848 bytes) (0x0004F0 - 0x000738) align 8 MaxSize: 0x0738
class UBBQAbilityBarge : public UBBQGameplayAbility
{ 
public:
	FGameplayVariableFloat                             ConeAngle;                                                  // 0x04F0   (0x0058)  
	FGameplayVariableFloat                             MaxDistance;                                                // 0x0548   (0x0058)  
	FGameplayVariableBool                              AffectVictimsOnly;                                          // 0x05A0   (0x0058)  
	TEnumAsByte<ECollisionChannel>                     LineTraceChannel;                                           // 0x05F8   (0x0001)  
	bool                                               bEnableLineTrace;                                           // 0x05F9   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x05FA   (0x0006)  MISSED
	FGameplayTagContainer                              BargeImmunityTags;                                          // 0x0600   (0x0020)  
	FGameplayTag                                       AreaOfEffectActivationTag;                                  // 0x0620   (0x0008)  
	FGameplayTag                                       AbilityActivationGameplayCueTag;                            // 0x0628   (0x0008)  
	class UClass*                                      ActivationEffect;                                           // 0x0630   (0x0008)  
	EBBQAnimSlot_AddOn1                                BargeAttackAnimSlot;                                        // 0x0638   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0639   (0x0007)  MISSED
	FDataTableRowHandle                                ActivityEventBargingPlayer;                                 // 0x0640   (0x0010)  
	FDataTableRowHandle                                ActivityEventBeingBarged;                                   // 0x0650   (0x0010)  
	class UBBQAbilityTask_BargeAimingAssistTask*       AimingAssistTask;                                           // 0x0660   (0x0008)  
	unsigned char                                      UnknownData02_6[0xC8];                                      // 0x0668   (0x00C8)  MISSED
	class UBBQAbilityTask_WaitBargeAreaOfEffectOverlap* OverlapTask;                                               // 0x0730   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityBarge.StartAimingAssist
	UBBQAbilityTask_BargeAimingAssistTask* StartAimingAssist(float AngleMargin, float DistanceMargin, float MaxRotationAngleDelta, float RotationInterpSpeed) // [0x1dfb990] Final|Native|Protected|BlueprintCallable 
	{
		typedef class UBBQAbilityTask_BargeAimingAssistTask* (*FuncPtr)(float, float, float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(AngleMargin, DistanceMargin, MaxRotationAngleDelta, RotationInterpSpeed);
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.OnCharacterBarged
	void OnCharacterBarged(ABBQGameSessionCharacterAnimated* BargeInstigator, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(BargeInstigator, BargedCharacter);
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.OnAnimInterrupted
	void OnAnimInterrupted() // [0x1dfb310] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.OnAnimCompleted
	void OnAnimCompleted() // [0x1dfb2f0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.OnAnimBlendOut
	void OnAnimBlendOut() // [0x1dfb2d0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.ExecuteBarge
	void ExecuteBarge() // [0x1dfb070] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityBarge.CanBargeCharacter
	bool CanBargeCharacter(ABBQGameSessionCharacterAnimated* BargingCharacter, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x1dfaf10] Native|Event|Public|BlueprintEvent 
	{
		typedef bool (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(BargingCharacter, BargedCharacter);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityTask_WaitGameplayTagWindow
/// Size: 0x00D0 (208 bytes) (0x0000A8 - 0x0000D0) align 8 MaxSize: 0x00D0
class UBBQAbilityTask_WaitGameplayTagWindow : public UAbilityTask_WaitGameplayTag
{ 
public:
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x00A8   (0x0028)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityTask_WaitBargeAreaOfEffectOverlap
/// Size: 0x00C0 (192 bytes) (0x000080 - 0x0000C0) align 8 MaxSize: 0x00C0
class UBBQAbilityTask_WaitBargeAreaOfEffectOverlap : public UAbilityTask
{ 
public:
	unsigned char                                      UnknownData00_8[0x10];                                      // 0x0080   (0x0010)  MISSED
	class ABBQGameSessionCharacterAnimated*            Instigator;                                                 // 0x0090   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0098   (0x0018)  MISSED
	TArray<class ABBQGameSessionCharacterAnimated*>    ObservedCharacters;                                         // 0x00B0   (0x0010)  
};

/// Class /Script/BBQGameSession.BBQAbilityTask_BargeAimingAssistTask
/// Size: 0x00D8 (216 bytes) (0x000080 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBBQAbilityTask_BargeAimingAssistTask : public UAbilityTask
{ 
public:
	class UBBQAbilityBarge*                            OwningAbility;                                              // 0x0080   (0x0008)  
	class ABBQGameSessionCharacterAnimated*            Instigator;                                                 // 0x0088   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0090   (0x0020)  MISSED
	TArray<class ABBQGameSessionCharacterAnimated*>    ObservedCharacters;                                         // 0x00B0   (0x0010)  
	unsigned char                                      UnknownData01_7[0x18];                                      // 0x00C0   (0x0018)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityBlowPowder
/// Size: 0x0500 (1280 bytes) (0x0004F0 - 0x000500) align 8 MaxSize: 0x0500
class UBBQAbilityBlowPowder : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       PowderInventoryItemTag;                                     // 0x04F0   (0x0008)  
	FGameplayTag                                       NoPowderFailureReasonTag;                                   // 0x04F8   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityBlowPowder.UsePowderInventoryItem
	void UsePowderInventoryItem() // [0x1dfbb40] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityBlowPowder.CalculatePoisonCloudTransform
	// FTransform CalculatePoisonCloudTransform(AActor* AvatarActor, FVector& StartPointLocalOffset, FVector& WorldDirection, float DesiredDistance, float CloudSize, TEnumAsByte<ECollisionChannel> TraceChannel); // [0x1dfacc0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
};

/// Class /Script/BBQGameSession.BBQAbilityClothesline
/// Size: 0x05D8 (1496 bytes) (0x0004F0 - 0x0005D8) align 8 MaxSize: 0x05D8
class UBBQAbilityClothesline : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       AbilityActivationGameplayCueTag;                            // 0x04F0   (0x0008)  
	class UClass*                                      ActivationEffect;                                           // 0x04F8   (0x0008)  
	FGameplayTag                                       MovementState;                                              // 0x0500   (0x0008)  
	bool                                               bCancelWhenMovementStateChanged;                            // 0x0508   (0x0001)  
	unsigned char                                      UnknownData00_7[0xCF];                                      // 0x0509   (0x00CF)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityClothesline.OnMovementStateChanged
	void OnMovementStateChanged() // [0x1dfb310] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityClothesline.EnableDebug
	void EnableDebug(bool bEnable) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(bEnable);
	}
};

/// Class /Script/BBQGameSession.HoldItemAnimNotifyState
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UHoldItemAnimNotifyState : public UAnimNotifyState
{ 
public:
};

/// Class /Script/BBQGameSession.BBQAbilityConsumeItem
/// Size: 0x05A0 (1440 bytes) (0x0004F0 - 0x0005A0) align 8 MaxSize: 0x05A0
class UBBQAbilityConsumeItem : public UBBQGameplayAbility
{ 
public:
	TMap<FGameplayTag, FConsumeItemEffects>            LookupEffectsToApply;                                       // 0x04F0   (0x0050)  
	class UAkAudioEvent*                               AudioEvent;                                                 // 0x0540   (0x0008)  
	class UClass*                                      ConsumingItemEffect;                                        // 0x0548   (0x0008)  
	FGameplayTagContainer                              PoisonedItemTypes;                                          // 0x0550   (0x0020)  
	class UClass*                                      ConsumeItemCharacterBehaviourClass;                         // 0x0570   (0x0008)  
	FActiveGameplayEffectHandle                        ConsumingItemEffectHandle;                                  // 0x0578   (0x0008)  
	FGameplayTag                                       InventoryTagWeAreApplying;                                  // 0x0580   (0x0008)  
	class AActor*                                      ConsumeItemEffectInstigator;                                // 0x0588   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0590   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityConsumeItem.OnTakeDamage
	void OnTakeDamage(AActor* DamagedActor, float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser) // [0x1dfb630] Final|Native|Private 
	{
		typedef void (*FuncPtr)(AActor*, float, UDamageType*, AController*, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(DamagedActor, Damage, DamageType, InstigatedBy, DamageCauser);
	}
	// Function /Script/BBQGameSession.BBQAbilityConsumeItem.OnSyncEvent
	void OnSyncEvent() // [0x1dfb610] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityConsumeItem.OnConsumeItemEnded
	void OnConsumeItemEnded(FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo) // [0x1dfb350] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(GameplayEffectRemovalInfo);
	}
	// Function /Script/BBQGameSession.BBQAbilityConsumeItem.GetDuration
	float GetDuration() // [0x1dfb0b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Script/BBQGameSession.BBQAbilityConsumeItem.BP_AfterConsumeItem
	void BP_AfterConsumeItem() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityCookListen
/// Size: 0x0748 (1864 bytes) (0x0004F0 - 0x000748) align 8 MaxSize: 0x0748
class UBBQAbilityCookListen : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      DepletionGE;                                                // 0x04F0   (0x0008)  
	FGameplayVariableFloat                             DepletionRate;                                              // 0x04F8   (0x0058)  
	class UClass*                                      BoostChargeGE;                                              // 0x0550   (0x0008)  
	FGameplayTag                                       BoostChargeEventTag;                                        // 0x0558   (0x0008)  
	FGameplayTag                                       BoostChargeMagnitudeTag;                                    // 0x0560   (0x0008)  
	FGameplayTag                                       CooldownTag;                                                // 0x0568   (0x0008)  
	class UDataTable*                                  AttributeSetInitDataTable;                                  // 0x0570   (0x0008)  
	FGameplayVariableFloat                             FocusDurationMin;                                           // 0x0578   (0x0058)  
	FGameplayVariableFloat                             FocusDurationMax;                                           // 0x05D0   (0x0058)  
	FGameplayVariableFloat                             FocusSilhouetteHighlightDuration;                           // 0x0628   (0x0058)  
	class UNiagaraSystem*                              VictimSilhouetteVFX;                                        // 0x0680   (0x0008)  
	class UClass*                                      GameplayAbilityTargetActorClass;                            // 0x0688   (0x0008)  
	class UClass*                                      SpottingCooldownEffect;                                     // 0x0690   (0x0008)  
	class UBBQAttributeSet_CookListen*                 GivenAttributeSet;                                          // 0x0698   (0x0008)  
	FTimerHandle                                       DepletionTimerHandle;                                       // 0x06A0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x06A8   (0x0010)  MISSED
	class UBBQAbilityTask_WaitAbilityBlocked*          TaskWaitAbilityBlocked;                                     // 0x06B8   (0x0008)  
	class UAbilityTask_WaitTargetData*                 TaskWaitTargetData;                                         // 0x06C0   (0x0008)  
	class AGameplayAbilityTargetActor*                 SpawnedTargetActor;                                         // 0x06C8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x06D0   (0x0018)  MISSED
	TMap<class AActor*, float>                         ActorsSpotted;                                              // 0x06E8   (0x0050)  
	class UAbilityTask_WaitDelay*                      TaskWaitFocusTime;                                          // 0x0738   (0x0008)  
	class UAkAudioEvent*                               AudioEventWhenTargetMarked;                                 // 0x0740   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityCookListen.StopTargeting
	void StopTargeting() // [0x1dfbb20] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.StartTargeting
	void StartTargeting() // [0x1dfbb00] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnValidTargetData
	void OnValidTargetData(FGameplayAbilityTargetDataHandle& Data) // [0x1dfb7e0] Final|Native|Protected|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayAbilityTargetDataHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Data);
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnFocusingTimeElapsed
	void OnFocusingTimeElapsed() // [0x1dfb510] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnFocusingStarted
	void OnFocusingStarted(AActor* Actor) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(Actor);
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnFocusingEnded
	void OnFocusingEnded(AActor* Actor, bool bCancelled, float HighlightDuration) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*, bool, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Actor, bCancelled, HighlightDuration);
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnAbilityUnblocked
	void OnAbilityUnblocked() // [0x1dfb090] Native|Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityCookListen.OnAbilityBlocked
	void OnAbilityBlocked() // [0x1dfb0e0] Native|Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityDetectGrandpa
/// Size: 0x0508 (1288 bytes) (0x0004F0 - 0x000508) align 8 MaxSize: 0x0508
class UBBQAbilityDetectGrandpa : public UBBQGameplayAbility
{ 
public:
	class UBBQGameplayEffect*                          DetectionEffectClass;                                       // 0x04F0   (0x0008)  
	float                                              ScremEventTime;                                             // 0x04F8   (0x0004)  
	unsigned char                                      UnknownData00_7[0xC];                                       // 0x04FC   (0x000C)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityDetectGrandpa.WaitDelayTaskFinished
	void WaitDelayTaskFinished() // [0x1dfbb60] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQGameSession.UBBQAbilityDodge
/// Size: 0x0528 (1320 bytes) (0x0004F0 - 0x000528) align 8 MaxSize: 0x0528
class UUBBQAbilityDodge : public UBBQGameplayAbility
{ 
public:
	FGameplayTagContainer                              RequiredTags;                                               // 0x04F0   (0x0020)  
	class UClass*                                      SuccessfulDodgeEffect;                                      // 0x0510   (0x0008)  
	class UClass*                                      UnsuccessfulDodgeEffect;                                    // 0x0518   (0x0008)  
	EDodgeDirection                                    DefaultDirection;                                           // 0x0520   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0521   (0x0003)  MISSED
	float                                              AnimationPlayRate;                                          // 0x0524   (0x0004)  
};

/// Class /Script/BBQGameSession.BBQAbilityMeleeAttack
/// Size: 0x07A0 (1952 bytes) (0x0004F0 - 0x0007A0) align 16 MaxSize: 0x0798
class UBBQAbilityMeleeAttack : public UBBQGameplayAbility
{ 
public:
	EBBQCombatAnimSlot                                 DefaultAttackAnimSlot;                                      // 0x04F0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x04F1   (0x0007)  MISSED
	TArray<FMeleeAttackAnimSlotSet>                    MeleeAnimMontageList;                                       // 0x04F8   (0x0010)  
	EBBQAnimSelectionMethod                            AnimSelectionMethod;                                        // 0x0508   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0509   (0x0003)  MISSED
	float                                              AnimSelectionResetTime;                                     // 0x050C   (0x0004)  
	float                                              MovingMontageSpeedThreshold;                                // 0x0510   (0x0004)  
	float                                              MovingMontageTimeThreshold;                                 // 0x0514   (0x0004)  
	EBBQStationaryTransitionType                       StationaryTransitionType;                                   // 0x0518   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0519   (0x0003)  MISSED
	float                                              MeleeLineOfSightRadius;                                     // 0x051C   (0x0004)  
	float                                              MeleeLineOfSightHeightOffset;                               // 0x0520   (0x0004)  
	float                                              MeleeLineOfSightWidthOffset;                                // 0x0524   (0x0004)  
	FName                                              MeleeHitBoxTag;                                             // 0x0528   (0x0008)  
	FGameplayTag                                       MeleeHitTag;                                                // 0x0530   (0x0008)  
	FGameplayTag                                       MeleeCueTag;                                                // 0x0538   (0x0008)  
	FGameplayTagContainer                              MeleeImmunityTags;                                          // 0x0540   (0x0020)  
	FGameplayTagContainer                              CloseEncounterImmunityTags;                                 // 0x0560   (0x0020)  
	FGameplayVariableFloat                             DamageAmountToCauseVar;                                     // 0x0580   (0x0058)  
	float                                              DamageInterval;                                             // 0x05D8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x05DC   (0x0004)  MISSED
	class UClass*                                      DamageTypeToInflictOnMeleeHit;                              // 0x05E0   (0x0008)  
	float                                              CloseEncounterDamageMargin;                                 // 0x05E8   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x05EC   (0x0004)  MISSED
	FDataTableRowHandle                                CloseEncounterDefinitionRow;                                // 0x05F0   (0x0010)  
	bool                                               bCanTriggerExecution;                                       // 0x0600   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x0601   (0x0007)  MISSED
	class UClass*                                      MeleeAttackerEffect;                                        // 0x0608   (0x0008)  
	class UClass*                                      MeleeAttackerSuccessEffect;                                 // 0x0610   (0x0008)  
	EBBQComboType                                      ComboType;                                                  // 0x0618   (0x0001)  
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x0619   (0x0007)  MISSED
	class UClass*                                      MeleeAttackerComboHitEffect;                                // 0x0620   (0x0008)  
	class UClass*                                      MeleeAttackerComboMissEffect;                               // 0x0628   (0x0008)  
	EBBQLockOnType                                     LockOnType;                                                 // 0x0630   (0x0001)  
	bool                                               bLockOnToCharacters;                                        // 0x0631   (0x0001)  
	unsigned char                                      UnknownData07_6[0x2];                                       // 0x0632   (0x0002)  MISSED
	float                                              LockOnRange;                                                // 0x0634   (0x0004)  
	float                                              LockOnAngle;                                                // 0x0638   (0x0004)  
	float                                              LockOnFocusAngle;                                           // 0x063C   (0x0004)  
	float                                              StationaryLockOnAngle;                                      // 0x0640   (0x0004)  
	float                                              CameraLockRange;                                            // 0x0644   (0x0004)  
	float                                              CameraLockDuration;                                         // 0x0648   (0x0004)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x064C   (0x0004)  MISSED
	class AActor*                                      TargetedActor;                                              // 0x0650   (0x0008)  
	class AActor*                                      PrevTargetedActor;                                          // 0x0658   (0x0008)  
	bool                                               bCurrentlyLockedOn;                                         // 0x0660   (0x0001)  
	bool                                               bAttackerMoving;                                            // 0x0661   (0x0001)  
	bool                                               bWasInterrupted;                                            // 0x0662   (0x0001)  
	unsigned char                                      UnknownData09_6[0x1];                                       // 0x0663   (0x0001)  MISSED
	float                                              HoldTime;                                                   // 0x0664   (0x0004)  
	float                                              Priority;                                                   // 0x0668   (0x0004)  
	FName                                              AttackCameraStateName;                                      // 0x066C   (0x0008)  
	bool                                               bCanApplyCameraState;                                       // 0x0674   (0x0001)  
	EBBQAttackType                                     AttackType;                                                 // 0x0675   (0x0001)  
	EBBQAttackVisualTraceType                          AttackVisualTraceType;                                      // 0x0676   (0x0001)  
	unsigned char                                      UnknownData10_6[0x9];                                       // 0x0677   (0x0009)  MISSED
	TMap<class UBBQMeleeArcNotifyState*, bool>         MeleeArcs;                                                  // 0x0680   (0x0050)  
	unsigned char                                      UnknownData11_6[0x18];                                      // 0x06D0   (0x0018)  MISSED
	class UBBQAbilityTask_ExecuteMeleeAttack*          CurrentMeleeTask;                                           // 0x06E8   (0x0008)  
	TArray<class AActor*>                              MeleeHitActors;                                             // 0x06F0   (0x0010)  
	unsigned char                                      UnknownData12_6[0x10];                                      // 0x0700   (0x0010)  MISSED
	TArray<class AActor*>                              MeleeOverlappedActors;                                      // 0x0710   (0x0010)  
	unsigned char                                      UnknownData13_6[0x58];                                      // 0x0720   (0x0058)  MISSED
	TArray<class UPrimitiveComponent*>                 HitBoxes;                                                   // 0x0778   (0x0010)  
	class UBBQMeleeComponent*                          OwnerMeleeComponent;                                        // 0x0788   (0x0008)  
	class UVisualDamageInstigatorComponent*            OwnerVisualDamageInstigatorComponent;                       // 0x0790   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_RequestStationaryToMovingBlend
	void Server_RequestStationaryToMovingBlend() // [0x1dfb090] Net|NetReliableNative|Event|Protected|NetServer 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_RequestMovementBreakout
	void Server_RequestMovementBreakout() // [0x1dfb0e0] Net|NetReliableNative|Event|Protected|NetServer 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_RequestHit
	void Server_RequestHit(AActor* Target) // [0x1dff8d0] Net|NetReliableNative|Event|Public|NetServer 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Target);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_PreActivateSync
	void Server_PreActivateSync(bool bNewAttackerMoving, AActor* NewTargetActor) // [0x1dff800] Net|NetReliableNative|Event|Public|NetServer 
	{
		typedef void (*FuncPtr)(bool, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(bNewAttackerMoving, NewTargetActor);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_MissCombo
	void Server_MissCombo() // [0x1dff7e0] Net|NetReliableNative|Event|Public|NetServer 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_ExecuteRepeat
	void Server_ExecuteRepeat(bool bNewAttackerMoving) // [0x1dff750] Net|NetReliableNative|Event|Public|NetServer 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(bNewAttackerMoving);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Server_ExecuteCombo
	void Server_ExecuteCombo(bool bNewAttackerMoving) // [0x1dff6c0] Net|NetReliableNative|Event|Public|NetServer 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(bNewAttackerMoving);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.OnMeleeAttackOverlapEnd
	void OnMeleeAttackOverlapEnd(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex) // [0x1dff330] Final|Native|Public  
	{
		typedef void (*FuncPtr)(UPrimitiveComponent*, AActor*, UPrimitiveComponent*, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(OverlappedComponent, OtherActor, OtherComp, OtherBodyIndex);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.OnMeleeAttackOverlapBegin
	void OnMeleeAttackOverlapBegin(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex) // [0x1dff1d0] Final|Native|Public  
	{
		typedef void (*FuncPtr)(UPrimitiveComponent*, AActor*, UPrimitiveComponent*, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(OverlappedComponent, OtherActor, OtherComp, OtherBodyIndex);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.OnFrustratedReactionEnded
	void OnFrustratedReactionEnded(UAnimMontage* Montage, bool bInterrupted) // [0x1dff100] Final|Native|Public  
	{
		typedef void (*FuncPtr)(UAnimMontage*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(Montage, bInterrupted);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.OnFinishedMeleeAttack
	void OnFinishedMeleeAttack() // [0x1dff0e0] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.NetMulticast_SetTarget
	void NetMulticast_SetTarget(AActor* TargetActor) // [0x1dff030] Net|NetReliableNative|Event|NetMulticast|Public 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(TargetActor);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Client_RejectHit
	void Client_RejectHit(AActor* Target) // [0x1dfeed0] Net|NetReliableNative|Event|Public|NetClient 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(Target);
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Client_ConfirmAttackSuccessful
	void Client_ConfirmAttackSuccessful() // [0x1dfeeb0] Net|NetReliableNative|Event|Public|NetClient 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.Client_ConfirmAttackFailed
	void Client_ConfirmAttackFailed() // [0x1dfee90] Net|NetReliableNative|Event|Public|NetClient 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityMeleeAttack.BP_OnMeleeAttackStarted
	void BP_OnMeleeAttackStarted() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityEnvironmentalAttack
/// Size: 0x07C0 (1984 bytes) (0x000798 - 0x0007C0) align 16 MaxSize: 0x07C0
class UBBQAbilityEnvironmentalAttack : public UBBQAbilityMeleeAttack
{ 
public:
	TEnumAsByte<ECollisionChannel>                     EnvironmentAttackCollisionChannel;                          // 0x0798   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0799   (0x0003)  MISSED
	float                                              TargetingRange;                                             // 0x079C   (0x0004)  
	float                                              TargetingAngle;                                             // 0x07A0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x07A4   (0x0004)  MISSED
	TArray<class UClass*>                              TargetableClasses;                                          // 0x07A8   (0x0010)  
	class ABBQTraversalActor*                          CachedTraversalTarget;                                      // 0x07B8   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityFirstAid
/// Size: 0x0548 (1352 bytes) (0x0004F0 - 0x000548) align 8 MaxSize: 0x0548
class UBBQAbilityFirstAid : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      FirstAidProgressEffect;                                     // 0x04F0   (0x0008)  
	class UClass*                                      FirstAidTargetProgressEffect;                               // 0x04F8   (0x0008)  
	TArray<class UClass*>                              AfterEffects;                                               // 0x0500   (0x0010)  
	class UAnimMontage*                                ApplyFirstAidAnim;                                          // 0x0510   (0x0008)  
	class UStaticMesh*                                 HandAttachment;                                             // 0x0518   (0x0008)  
	FGameplayTag                                       FirstAidProgressTag;                                        // 0x0520   (0x0008)  
	class UAbilityTask_WaitGameplayEffectRemoved*      ProgressEffectRemovedTask;                                  // 0x0528   (0x0008)  
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0530   (0x0018)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityFirstAid.SetFirstAidTarget
	void SetFirstAidTarget(AActor* NewTarget) // [0x1dfb900] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewTarget);
	}
	// Function /Script/BBQGameSession.BBQAbilityFirstAid.OnTakeDamage
	void OnTakeDamage(AActor* DamagedActor, float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser) // [0x1dfb630] Final|Native|Private 
	{
		typedef void (*FuncPtr)(AActor*, float, UDamageType*, AController*, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(DamagedActor, Damage, DamageType, InstigatedBy, DamageCauser);
	}
	// Function /Script/BBQGameSession.BBQAbilityFirstAid.OnFirstAidProgressEnd
	void OnFirstAidProgressEnd(FGameplayEffectRemovalInfo& RemovalInfo) // [0x1dfb430] Final|Native|Private|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(RemovalInfo);
	}
};

/// Class /Script/BBQGameSession.BBQStarSignAbility
/// Size: 0x05E0 (1504 bytes) (0x0004F0 - 0x0005E0) align 8 MaxSize: 0x05E0
class UBBQStarSignAbility : public UBBQGameplayAbility
{ 
public:
	bool                                               bListenTakeDamageEvent;                                     // 0x04F0   (0x0001)  
	bool                                               bCancelOnTakeDamage;                                        // 0x04F1   (0x0001)  
	bool                                               bShouldApplyTakeDamageEffects;                              // 0x04F2   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x04F3   (0x0005)  MISSED
	class UClass*                                      DurationEffect;                                             // 0x04F8   (0x0008)  
	class UClass*                                      StartingCooldownEffect;                                     // 0x0500   (0x0008)  
	FName                                              LinkedPrimaryCharacterAttribute;                            // 0x0508   (0x0008)  
	TMap<ESSAGameplayCueState, FGameplayCueData>       GameplayCueDataMap;                                         // 0x0510   (0x0050)  
	class UAbilityTask_WaitGameplayEffectRemoved*      DurationEffectWaitTask;                                     // 0x0560   (0x0008)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0568   (0x0010)  MISSED
	TArray<class UClass*>                              OnTakeDamageEffects;                                        // 0x0578   (0x0010)  
	FGameplayTag                                       BuffDurationTag;                                            // 0x0588   (0x0008)  
	FGameplayTag                                       DebuffDurationTag;                                          // 0x0590   (0x0008)  
	FGameplayTagContainer                              ChargeTags;                                                 // 0x0598   (0x0020)  
	FGameplayTagContainer                              StartingCooldownBlockedTags;                                // 0x05B8   (0x0020)  
	bool                                               bApplyCooldownOnStart;                                      // 0x05D8   (0x0001)  
	bool                                               bTriggerSuccessDialogOnBuff;                                // 0x05D9   (0x0001)  
	bool                                               bIsSuccessDialogEnabled;                                    // 0x05DA   (0x0001)  
	unsigned char                                      UnknownData02_7[0x5];                                       // 0x05DB   (0x0005)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQStarSignAbility.TryTriggerAbilitySuccessDialog
	void TryTriggerAbilitySuccessDialog() // [0x1e7ed40] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.OnTakeDamageInternal
	void OnTakeDamageInternal(AActor* DamagedActor, float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser) // [0x1e7ea00] Native|Protected     
	{
		typedef void (*FuncPtr)(AActor*, float, UDamageType*, AController*, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(DamagedActor, Damage, DamageType, InstigatedBy, DamageCauser);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.OnDurationEffectRemoved
	void OnDurationEffectRemoved(FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo) // [0x1e7e230] Native|Protected|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(GameplayEffectRemovalInfo);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.OnCooldownEffectRemoved
	void OnCooldownEffectRemoved(FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo) // [0x1e7e150] Final|Native|Protected|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(GameplayEffectRemovalInfo);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.GetDebuffDurationAndRemainingTime
	void GetDebuffDurationAndRemainingTime(UAbilitySystemComponent* ASC, float& OutDuration, float& OutRemainingTime) // [0x1e7dda0] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(UAbilitySystemComponent*, float&, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(ASC, OutDuration, OutRemainingTime);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.GetAbilityDurationAndRemainingTime
	void GetAbilityDurationAndRemainingTime(UAbilitySystemComponent* AbilitySystemComponent, float& OutDuration, float& OutRemainingTime) // [0x1e7dae0] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(UAbilitySystemComponent*, float&, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(AbilitySystemComponent, OutDuration, OutRemainingTime);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.GetAbilityChargeProgress
	float GetAbilityChargeProgress(ABBQBaseCharacter* Character) // [0x1e7da40] Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef float (*FuncPtr)(ABBQBaseCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(Character);
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.CommitDurationEffect
	bool CommitDurationEffect() // [0x1e7da10] Final|Native|Protected|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.BP_OnDurationEffectCommited
	void BP_OnDurationEffectCommited() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Script/BBQGameSession.BBQStarSignAbility.BP_OnAbilityCooldownEnded
	void BP_OnAbilityCooldownEnded() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityFocusPerk
/// Size: 0x0620 (1568 bytes) (0x0005E0 - 0x000620) align 8 MaxSize: 0x0620
class UBBQAbilityFocusPerk : public UBBQStarSignAbility
{ 
public:
	TArray<class UClass*>                              OnActivationEffects;                                        // 0x05E0   (0x0010)  
	float                                              MinimumStaminaToActivate;                                   // 0x05F0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x05F4   (0x0004)  MISSED
	class UClass*                                      FocusActiveEffectClass;                                     // 0x05F8   (0x0008)  
	FGameplayTag                                       FocusedCooldownTag;                                         // 0x0600   (0x0008)  
	unsigned char                                      UnknownData01_7[0x18];                                      // 0x0608   (0x0018)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityFullVial
/// Size: 0x05B8 (1464 bytes) (0x0004F0 - 0x0005B8) align 8 MaxSize: 0x05B8
class UBBQAbilityFullVial : public UBBQGameplayAbility
{ 
public:
	FBBQOutlineRendererConfig                          OutlineConfig;                                              // 0x04F0   (0x0098)  
	float                                              OutlineDurationAtMaxFamilyBond;                             // 0x0588   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x058C   (0x0004)  MISSED
	FDataTableRowHandle                                BloodVialFullNotificationRow;                               // 0x0590   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x05A0   (0x0008)  MISSED
	class ABBQGameSessionCharacter*                    OwnerCharacter;                                             // 0x05A8   (0x0008)  
	class ABBQGrandpa*                                 GrandpaActor;                                               // 0x05B0   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityGrandpaSonar
/// Size: 0x0670 (1648 bytes) (0x0004F0 - 0x000670) align 8 MaxSize: 0x0670
class UBBQAbilityGrandpaSonar : public UBBQGameplayAbility
{ 
public:
	float                                              SphereOverlapRadius;                                        // 0x04F0   (0x0004)  
	float                                              ScremEventTime;                                             // 0x04F4   (0x0004)  
	FGameplayTagContainer                              IgnoreDetectionTags;                                        // 0x04F8   (0x0020)  
	TArray<class AActor*>                              VictimsInRadius;                                            // 0x0518   (0x0010)  
	FBBQOutlineRendererConfig                          OutlineConfig;                                              // 0x0528   (0x0098)  
	FBBQOutlineRendererConfig                          OutlineConfigMarkedForDeath;                                // 0x05C0   (0x0098)  
	FGameplayTag                                       MarkedForDeathTag;                                          // 0x0658   (0x0008)  
	class UClass*                                      AffectedByGrandpasSonarEffect;                              // 0x0660   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0668   (0x0008)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityGrandpaSonar.WaitDelayTaskFinished
	void WaitDelayTaskFinished() // [0x1dfbb80] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityGrandpaSonar.PopulateOverlappingActorsInSphere
	void PopulateOverlappingActorsInSphere(FVector GrandpaPos, float OverlapRadius) // [0x2438a30] Event|Protected|HasDefaults|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FVector, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(GrandpaPos, OverlapRadius);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityHearing
/// Size: 0x04F8 (1272 bytes) (0x0004F0 - 0x0004F8) align 8 MaxSize: 0x04F8
class UBBQAbilityHearing : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      EffectToApply;                                              // 0x04F0   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityHeightenedSense
/// Size: 0x06B8 (1720 bytes) (0x0005E0 - 0x0006B8) align 8 MaxSize: 0x06B8
class UBBQAbilityHeightenedSense : public UBBQStarSignAbility
{ 
public:
	TArray<class UClass*>                              ActivationEffects;                                          // 0x05E0   (0x0010)  
	class UClass*                                      PerkChargeReductionEffect;                                  // 0x05F0   (0x0008)  
	class UClass*                                      PerkChargeRechargeEffect;                                   // 0x05F8   (0x0008)  
	FGameplayAttribute                                 PerkChargeAttribute;                                        // 0x0600   (0x0038)  
	FGameplayAttribute                                 PerkChargeMaxAttribute;                                     // 0x0638   (0x0038)  
	FGameplayTag                                       AbilityRechargingTag;                                       // 0x0670   (0x0008)  
	bool                                               bCanActivateWhileRecharging;                                // 0x0678   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0679   (0x0007)  MISSED
	class UClass*                                      SpottingTargetActor;                                        // 0x0680   (0x0008)  
	FDataTableRowHandle                                ActivatedCameraState;                                       // 0x0688   (0x0010)  
	int32_t                                            CameraStateSlotIdx;                                         // 0x0698   (0x0004)  
	unsigned char                                      UnknownData01_7[0x1C];                                      // 0x069C   (0x001C)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityHeightenedSense.OnPerkChargeReductionRemoved
	void OnPerkChargeReductionRemoved(FGameplayEffectRemovalInfo& RemovalInfo) // [0x1dfb530] Final|Native|Private|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(RemovalInfo);
	}
	// Function /Script/BBQGameSession.BBQAbilityHeightenedSense.BP_OnAbilityActivated
	void BP_OnAbilityActivated() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityHuntMode
/// Size: 0x0808 (2056 bytes) (0x0004F0 - 0x000808) align 8 MaxSize: 0x0808
class UBBQAbilityHuntMode : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      ActivationEffect;                                           // 0x04F0   (0x0008)  
	class UClass*                                      ChargeEffect;                                               // 0x04F8   (0x0008)  
	class UClass*                                      DischargeEffect;                                            // 0x0500   (0x0008)  
	float                                              RequiredAbilityCharge;                                      // 0x0508   (0x0004)  
	FName                                              OutlineInstanceName;                                        // 0x050C   (0x0008)  
	char                                               OutlineColorIndex;                                          // 0x0514   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0515   (0x0003)  MISSED
	FGameplayTag                                       LocalGameplayCue;                                           // 0x0518   (0x0008)  
	TArray<FBBQHuntModeDetectableObject>               DetectableObjects;                                          // 0x0520   (0x0010)  
	FGameplayVariableFloat                             ObjectsDetectionRange;                                      // 0x0530   (0x0058)  
	float                                              ObjectsDetectionUpdateRate;                                 // 0x0588   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x058C   (0x0004)  MISSED
	FGameplayVariableFloat                             BloodBucketDetectionRange;                                  // 0x0590   (0x0058)  
	FGameplayVariableFloat                             BloodBucketDetectionRangeHysteresis;                        // 0x05E8   (0x0058)  
	float                                              BloodBucketDetectionUpdateRate;                             // 0x0640   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0644   (0x0004)  MISSED
	FGameplayVariableBool                              HighlightObjectsDetectedWhileActive;                        // 0x0648   (0x0058)  
	FGameplayTag                                       OnCooldownFailureReasonTag;                                 // 0x06A0   (0x0008)  
	TMap<class AActor*, bool>                          DetectableObjectsState;                                     // 0x06A8   (0x0050)  
	TArray<class ABBQBloodBucket*>                     BloodBucketsInRange;                                        // 0x06F8   (0x0010)  
	TArray<class AActor*>                              ActorsWithActiveOutline;                                    // 0x0708   (0x0010)  
	FGameplayCueParameters                             GameplayCueParameters;                                      // 0x0718   (0x00C0)  
	unsigned char                                      UnknownData03_7[0x30];                                      // 0x07D8   (0x0030)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.OnChargeDepleted
	void OnChargeDepleted() // [0x1dfb330] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.OnActivationEffectRemoved
	void OnActivationEffectRemoved(FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo) // [0x1dfb1f0] Final|Native|Protected|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(GameplayEffectRemovalInfo);
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.HighlightDetectedObjects
	void HighlightDetectedObjects() // [0x1dfb1d0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.HighlightAllFamilyMembers
	void HighlightAllFamilyMembers(bool bIncludeOwner, bool bIncludeGrandpa) // [0x1dfb100] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(bIncludeOwner, bIncludeGrandpa);
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.HighlightAdditionalObjects
	void HighlightAdditionalObjects() // [0x1dfb0e0] Native|Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.GatherDetectableObjects
	void GatherDetectableObjects() // [0x1dfb090] Native|Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.EnableBloodBucketsHighlight
	void EnableBloodBucketsHighlight(bool bEnable) // [0x1dfafe0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(bEnable);
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.AddOutlineToActor
	void AddOutlineToActor(AActor* Actor) // [0x1dfac30] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Actor);
	}
	// Function /Script/BBQGameSession.BBQAbilityHuntMode.AddDetectableObject
	void AddDetectableObject(AActor* Actor, bool bIsInitiallyDetected) // [0x1dfab60] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(AActor*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(Actor, bIsInitiallyDetected);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityIncapacitatedRecover
/// Size: 0x0508 (1288 bytes) (0x0004F0 - 0x000508) align 8 MaxSize: 0x0508
class UBBQAbilityIncapacitatedRecover : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      SpendWillToLiveEffect;                                      // 0x04F0   (0x0008)  
	float                                              RequiredAmountWillToLiveToExchange;                         // 0x04F8   (0x0004)  
	unsigned char                                      UnknownData00_7[0xC];                                       // 0x04FC   (0x000C)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityIncapacitatedRecover.OnSwapEffectFinished
	void OnSwapEffectFinished(FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo) // [0x1dfb350] Final|Native|Public|HasOutParms 
	{
		typedef void (*FuncPtr)(FGameplayEffectRemovalInfo&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(GameplayEffectRemovalInfo);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityInvestigateFootsteps
/// Size: 0x04F0 (1264 bytes) (0x0004F0 - 0x0004F0) align 8 MaxSize: 0x04F0
class UBBQAbilityInvestigateFootsteps : public UBBQGameplayAbility
{ 
public:
};

/// Class /Script/BBQGameSession.BBQAbilityISeeYou
/// Size: 0x05B8 (1464 bytes) (0x0004F0 - 0x0005B8) align 8 MaxSize: 0x05B8
class UBBQAbilityISeeYou : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       HiddenTag;                                                  // 0x04F0   (0x0008)  
	float                                              AreaOfEffectRadius;                                         // 0x04F8   (0x0004)  
	float                                              VictimDetectionFrequency;                                   // 0x04FC   (0x0004)  
	float                                              VictimHighlightTime;                                        // 0x0500   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0504   (0x0004)  MISSED
	class UAbilityTask_Repeat*                         DetectNewVictimsRepeatTask;                                 // 0x0508   (0x0008)  
	TMap<class ABBQGameSessionCharacter*, class UAbilityTask_WaitGameplayTagRemoved*> HideDoneRunningTasksMap;     // 0x0510   (0x0050)  
	TMap<class ABBQGameSessionCharacter*, class UAbilityTask_WaitGameplayTagAdded*> HideStartRunningTasksMap;      // 0x0560   (0x0050)  
	TWeakObjectPtr<class ABBQGameSessionCharacter*>    OwningCharacter;                                            // 0x05B0   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityISeeYou.HiddenTagRemoved
	void HiddenTagRemoved() // [0x1dff010] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityISeeYou.HiddenTagAdded
	void HiddenTagAdded() // [0x1dfeff0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityISeeYou.DetectVictimsInRadiusRepeat
	void DetectVictimsInRadiusRepeat(int32_t InActionNumber) // [0x1dfef60] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(InActionNumber);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityJohnnyBloodlust
/// Size: 0x0520 (1312 bytes) (0x0004F0 - 0x000520) align 8 MaxSize: 0x0520
class UBBQAbilityJohnnyBloodlust : public UBBQGameplayAbility
{ 
public:
	class ABBQGameSessionCharacter*                    TempGameSessionPtr;                                         // 0x04F0   (0x0008)  
	TArray<class UClass*>                              ActivationEffect;                                           // 0x04F8   (0x0010)  
	FGameplayTag                                       CooldownTag;                                                // 0x0508   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0510   (0x0008)  MISSED
	int32_t                                            JohnnyKillcount;                                            // 0x0518   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x051C   (0x0004)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityJohnnyBloodlust.ApplyBloodlustGameEffects
	void ApplyBloodlustGameEffects() // [0x1dfee70] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityKnowWatch
/// Size: 0x05D0 (1488 bytes) (0x0004F0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UBBQAbilityKnowWatch : public UBBQGameplayAbility
{ 
public:
	class UMaterialInstance*                           KnowYouWatchMaterial;                                       // 0x04F0   (0x0008)  
	FGameplayVariableFloat                             ProximityWarningZThresholdVar;                              // 0x04F8   (0x0058)  
	TEnumAsByte<ECollisionChannel>                     ProximityCollisionChannel;                                  // 0x0550   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0551   (0x0003)  MISSED
	float                                              RepeatInterval;                                             // 0x0554   (0x0004)  
	FGameplayVariableFloat                             AbilityRadius;                                              // 0x0558   (0x0058)  
	class UCurveFloat*                                 ProximityWarningCurve;                                      // 0x05B0   (0x0008)  
	class UAbilityTask_Repeat*                         WatchingRepeatTask;                                         // 0x05B8   (0x0008)  
	class UMaterialInstanceDynamic*                    KnowYouWatchDynamicMaterial;                                // 0x05C0   (0x0008)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x05C8   (0x0008)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityKnowWatch.RepeatTask
	void RepeatTask(int32_t InActionNumber) // [0x1dff630] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(InActionNumber);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityListenTagChange
/// Size: 0x0528 (1320 bytes) (0x0004F0 - 0x000528) align 8 MaxSize: 0x0528
class UBBQAbilityListenTagChange : public UBBQGameplayAbility
{ 
public:
	FGameplayTagContainer                              ListenTags;                                                 // 0x04F0   (0x0020)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0510   (0x0010)  MISSED
	class UAbilitySystemComponent*                     OwnerASC;                                                   // 0x0520   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityListenTagChange.OnTagRemoved
	void OnTagRemoved(FGameplayTag& Tag, int32_t Count) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FGameplayTag&, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Tag, Count);
	}
	// Function /Script/BBQGameSession.BBQAbilityListenTagChange.OnTagAdded
	void OnTagAdded(FGameplayTag& Tag, int32_t Count) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FGameplayTag&, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Tag, Count);
	}
};

/// Class /Script/BBQGameSession.BBQAbilityLocateGrandpa
/// Size: 0x05E0 (1504 bytes) (0x0005E0 - 0x0005E0) align 8 MaxSize: 0x05E0
class UBBQAbilityLocateGrandpa : public UBBQStarSignAbility
{ 
public:
};

/// Class /Script/BBQGameSession.BBQAbilityTask_ExecuteMeleeAttack
/// Size: 0x00D8 (216 bytes) (0x000080 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBBQAbilityTask_ExecuteMeleeAttack : public UAbilityTask
{ 
public:
	unsigned char                                      UnknownData00_8[0x18];                                      // 0x0080   (0x0018)  MISSED
	class UAnimMontage*                                MyCurrentMontage;                                           // 0x0098   (0x0008)  
	unsigned char                                      UnknownData01_7[0x38];                                      // 0x00A0   (0x0038)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityTask_ExecuteMeleeAttack.OnMontageEnded
	void OnMontageEnded(UAnimMontage* Montage, bool bInterrupted) // [0x1dff560] Final|Native|Public  
	{
		typedef void (*FuncPtr)(UAnimMontage*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Montage, bInterrupted);
	}
	// Function /Script/BBQGameSession.BBQAbilityTask_ExecuteMeleeAttack.OnMontageBlendingOut
	void OnMontageBlendingOut(UAnimMontage* Montage, bool bInterrupted) // [0x1dff490] Final|Native|Public  
	{
		typedef void (*FuncPtr)(UAnimMontage*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Montage, bInterrupted);
	}
	// Function /Script/BBQGameSession.BBQAbilityTask_ExecuteMeleeAttack.OnAbilityCancelled
	void OnAbilityCancelled() // [0x1dff0c0] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQMeleeHitFrameNotifyState
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class UBBQMeleeHitFrameNotifyState : public UAnimNotifyState
{ 
public:
	EBBQMeleeAttackHitFrameType                        HitFrameType;                                               // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/BBQGameSession.MeleeAttackVisualiserComponent
/// Size: 0x00B8 (184 bytes) (0x0000B0 - 0x0000B8) align 8 MaxSize: 0x00B8
class UMeleeAttackVisualiserComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x00B0   (0x0008)  MISSED
};

/// Class /Script/BBQGameSession.BBQMeleeArcNotifyState
/// Size: 0x0050 (80 bytes) (0x000030 - 0x000050) align 8 MaxSize: 0x0050
class UBBQMeleeArcNotifyState : public UAnimNotifyState
{ 
public:
	float                                              StartAngle;                                                 // 0x0030   (0x0004)  
	float                                              EndAngle;                                                   // 0x0034   (0x0004)  
	float                                              Range;                                                      // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	class UClass*                                      CameraShakeOnHit;                                           // 0x0040   (0x0008)  
	float                                              CameraShakeScale;                                           // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityMeleeChainsaw
/// Size: 0x07F0 (2032 bytes) (0x000798 - 0x0007F0) align 16 MaxSize: 0x07F0
class UBBQAbilityMeleeChainsaw : public UBBQAbilityMeleeAttack
{ 
public:
	FGameplayTagContainer                              ClientActivationRequiredTags;                               // 0x0798   (0x0020)  
	FGameplayTagContainer                              ClientActivationBlockedTags;                                // 0x07B8   (0x0020)  
	float                                              HeatLevelRequiredToUse;                                     // 0x07D8   (0x0004)  
	float                                              HeatLevelToAdd;                                             // 0x07DC   (0x0004)  
	bool                                               bOverheatPostAttackAnimEnd;                                 // 0x07E0   (0x0001)  
	bool                                               bStallPostAttackAnimEnd;                                    // 0x07E1   (0x0001)  
	bool                                               bIgnoreHeatIfStallDeferred;                                 // 0x07E2   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x07E3   (0x0005)  MISSED
	class UBBQChainsawComponent*                       CachedChainsawComponent;                                    // 0x07E8   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityMeleeChainsawSlam
/// Size: 0x0800 (2048 bytes) (0x0007F0 - 0x000800) align 16 MaxSize: 0x0800
class UBBQAbilityMeleeChainsawSlam : public UBBQAbilityMeleeChainsaw
{ 
public:
	EBBQCombatAnimSlot                                 NoTargetAnimSlot;                                           // 0x07F0   (0x0001)  
	unsigned char                                      UnknownData00_7[0xF];                                       // 0x07F1   (0x000F)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityMeleeReaction
/// Size: 0x04F8 (1272 bytes) (0x0004F0 - 0x0004F8) align 8 MaxSize: 0x04F8
class UBBQAbilityMeleeReaction : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      MeleeHitEffect;                                             // 0x04F0   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityPainIsNothing
/// Size: 0x06A0 (1696 bytes) (0x0005E0 - 0x0006A0) align 8 MaxSize: 0x06A0
class UBBQAbilityPainIsNothing : public UBBQStarSignAbility
{ 
public:
	FGameplayVariableInt                               MaxDamageEffectApplyCount;                                  // 0x05E0   (0x0058)  
	FGameplayVariableBool                              AlwaysApplyDamageEffects;                                   // 0x0638   (0x0058)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0690   (0x0010)  MISSED
};

/// Class /Script/BBQGameSession.BBQPerfumeBottleBreakNotifyState
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UBBQPerfumeBottleBreakNotifyState : public UAnimNotifyState
{ 
public:
};

/// Class /Script/BBQGameSession.BBQAbilityPerfume
/// Size: 0x05A0 (1440 bytes) (0x0005A0 - 0x0005A0) align 8 MaxSize: 0x05A0
class UBBQAbilityPerfume : public UBBQAbilityConsumeItem
{ 
public:


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityPerfume.OnReachedNotify
	void OnReachedNotify() // [0x1dfb090] Native|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityPerfume.CalculatePoisonCloudTransform
	// FTransform CalculatePoisonCloudTransform(AActor* AvatarActor, FVector& StartPointLocalOffset, FVector& WorldDirection, float DesiredDistance, float CloudSize, TEnumAsByte<ECollisionChannel> TraceChannel); // [0x1dfacc0] Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
};

/// Class /Script/BBQGameSession.BBQAbilityPerkAdrenalineRush
/// Size: 0x0578 (1400 bytes) (0x0004F0 - 0x000578) align 8 MaxSize: 0x0578
class UBBQAbilityPerkAdrenalineRush : public UBBQGameplayAbility
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x04F0   (0x0008)  MISSED
	class UClass*                                      AdrenalineRushRestoreStaminaClass;                          // 0x04F8   (0x0008)  
	class UClass*                                      AdrenalineRushHasChargeEffectClass;                         // 0x0500   (0x0008)  
	class UGameplayVariableMod*                        PerkConsumptionVarMod;                                      // 0x0508   (0x0008)  
	FGameplayVariableInt                               AdrenalineRushChargesVar;                                   // 0x0510   (0x0058)  
	class ABBQGameSessionCharacter*                    OwnerCharacter;                                             // 0x0568   (0x0008)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x0570   (0x0008)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityPerkAttributePoints
/// Size: 0x0638 (1592 bytes) (0x0004F0 - 0x000638) align 8 MaxSize: 0x0638
class UBBQAbilityPerkAttributePoints : public UBBQGameplayAbility
{ 
public:
	FName                                              CharacterAttribute;                                         // 0x04F0   (0x0008)  
	FGameplayVariableInt                               AttributeLevelOffsetVariable;                               // 0x04F8   (0x0058)  
	FGameplayAttribute                                 PlayerCurrentAttribute;                                     // 0x0550   (0x0038)  
	FGameplayAttribute                                 PlayerMaxAttribute;                                         // 0x0588   (0x0038)  
	FGameplayVariableFloat                             AttributeThresholdPercentVariable;                          // 0x05C0   (0x0058)  
	class UClass*                                      AbilityActiveEffectClass;                                   // 0x0618   (0x0008)  
	class UAbilityTask_WaitAttributeChange*            AttributeChangeTask;                                        // 0x0620   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0628   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityPerkAttributePoints.OnAttributeChangedLessThan
	void OnAttributeChangedLessThan() // [0x1dfb090] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQGameSession.BBQAbilityPerkAttributePoints.OnAttributeChangedGreaterThan
	void OnAttributeChangedGreaterThan() // [0x1dfb0e0] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityPerkHelpMe
/// Size: 0x05A0 (1440 bytes) (0x0004F0 - 0x0005A0) align 8 MaxSize: 0x05A0
class UBBQAbilityPerkHelpMe : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       PerkActiveTag;                                              // 0x04F0   (0x0008)  
	FGameplayVariableFloat                             PerkActivePercentage;                                       // 0x04F8   (0x0058)  
	FGameplayTagContainer                              RemoveHighlightTags;                                        // 0x0550   (0x0020)  
	class ABBQGameSessionCharacter*                    OwnerCharacter;                                             // 0x0570   (0x0008)  
	unsigned char                                      UnknownData00_7[0x28];                                      // 0x0578   (0x0028)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityPerkNoStopping
/// Size: 0x0508 (1288 bytes) (0x0004F0 - 0x000508) align 8 MaxSize: 0x0508
class UBBQAbilityPerkNoStopping : public UBBQGameplayAbility
{ 
public:
	TArray<class UClass*>                              AbilityLifetimeEffects;                                     // 0x04F0   (0x0010)  
	class AActor*                                      CurrentInteractable;                                        // 0x0500   (0x0008)  
};

/// Class /Script/BBQGameSession.BBQAbilityPerkSticksAndStones
/// Size: 0x05C0 (1472 bytes) (0x0004F0 - 0x0005C0) align 8 MaxSize: 0x05C0
class UBBQAbilityPerkSticksAndStones : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       ShardItemTag;                                               // 0x04F0   (0x0008)  
	FGameplayVariableFloat                             RequiredHealth;                                             // 0x04F8   (0x0058)  
	FGameplayVariableInt                               SticksAndStonesCharges;                                     // 0x0550   (0x0058)  
	class UGameplayVariableMod*                        PerkConsumptionVarMod;                                      // 0x05A8   (0x0008)  
	class ABBQGameSessionCharacter*                    OwnerCharacter;                                             // 0x05B0   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x05B8   (0x0008)  MISSED
};

/// Class /Script/BBQGameSession.BBQAbilityPerkWellTrained
/// Size: 0x0570 (1392 bytes) (0x0004F0 - 0x000570) align 8 MaxSize: 0x0570
class UBBQAbilityPerkWellTrained : public UBBQGameplayAbility
{ 
public:
	float                                              HighlightRange;                                             // 0x04F0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x04F4   (0x0004)  MISSED
	FGameplayTagContainer                              PickupsToHighlight;                                         // 0x04F8   (0x0020)  
	FGameplayVariableFloat                             HighlightDuration;                                          // 0x0518   (0x0058)  
};

/// Class /Script/BBQGameSession.BBQAbilityPlaceTrap
/// Size: 0x05D0 (1488 bytes) (0x0004F0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UBBQAbilityPlaceTrap : public UBBQGameplayAbility
{ 
public:
	class UClass*                                      TrapClass;                                                  // 0x04F0   (0x0008)  
	class UClass*                                      TrapPlacementTargetActorClass;                              // 0x04F8   (0x0008)  
	FGameplayVariableFloat                             TrapOriginOffset;                                           // 0x0500   (0x0058)  
	FGameplayVariableFloat                             PlacementHoldTime;                                          // 0x0558   (0x0058)  
	FGameplayTag                                       TrapInventoryItemTag;                                       // 0x05B0   (0x0008)  
	FGameplayTag                                       NoTrapsFailureReasonTag;                                    // 0x05B8   (0x0008)  
	TWeakObjectPtr<class ABBQGameSessionCharacterAnimated*> OwnerCharacter;                                        // 0x05C0   (0x0008)  
	bool                                               bPlacementAllowed;                                          // 0x05C8   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x05C9   (0x0007)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityPlaceTrap.SpawnTrap
	void SpawnTrap(FTransform& Transform) // [0x1e02d80] Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FTransform&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Transform);
	}
	// Function /Script/BBQGameSession.BBQAbilityPlaceTrap.GetHoldElapsedTimeInternal
	float GetHoldElapsedTimeInternal() // [0x1e021f0] Native|Event|Protected|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Script/BBQGameSession.BBQAbilityPlaceTrap.GetHoldElapsedTime
	float GetHoldElapsedTime() // [0x1e02190] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Script/BBQGameSession.BBQAbilityPlaceTrap.GetHoldDuration
	float GetHoldDuration() // [0x1e02160] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilityRipstall
/// Size: 0x0508 (1288 bytes) (0x0004F0 - 0x000508) align 8 MaxSize: 0x0508
class UBBQAbilityRipstall : public UBBQGameplayAbility
{ 
public:
	FDataTableRowHandle                                ActivationMessageEvent;                                     // 0x04F0   (0x0010)  
	float                                              ActivationMessageCooldown;                                  // 0x0500   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0504   (0x0004)  MISSED


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilityRipstall.ShowActivationMessage
	void ShowActivationMessage() // [0x1e02d60] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQGameSession.BBQAbilitySneakAttack
/// Size: 0x07B0 (1968 bytes) (0x000798 - 0x0007B0) align 16 MaxSize: 0x07B0
class UBBQAbilitySneakAttack : public UBBQAbilityMeleeAttack
{ 
public:
	float                                              SneakAttackArc;                                             // 0x0798   (0x0004)  
	FGameplayTag                                       SneakAttackTag;                                             // 0x079C   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x07A4   (0x0004)  MISSED
	class UClass*                                      SneakAttackEffect;                                          // 0x07A8   (0x0008)  


	/// Functions
	// Function /Script/BBQGameSession.BBQAbilitySneakAttack.BP_OnSneakAttackSuccessful
	void BP_OnSneakAttackSuccessful(AActor* Attacker, AActor* Target) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Attacker, Target);
	}
};

/// Class /Script/BBQGameSession.BBQAbilitySpyOnPlayer
/// Size: 0x0588 (1416 bytes) (0x0004F0 - 0x000588) align 8 MaxSize: 0x0588
class UBBQAbilitySpyOnPlayer : public UBBQGameplayAbility
{ 
public:
	FGameplayTag                                       PowderInventoryItemTag;                                     // 0x04F0   (0x0008)  
	bool                                               bRequireEquippedPowder;                                     // 0x04F8   (0x0001)  
	bool                                               bConsumesEquippedPowderOnActivate;                          // 0x04F9   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x04FA   (0x0002)  MISSED
