
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "AkAudio.h"
#include "BBQBackendServices.h"
#include "BBQCore.h"
#include "BBQGameSession.h"
#include "BBQInterface.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "EnhancedInput.h"
#include "GameMessages.h"
#include "GameplayAbilities.h"
#include "GameplayTags.h"
#include "GameplayVariables.h"
#include "InputCore.h"
#include "LevelSequence.h"
#include "MediaAssets.h"
#include "OnlineSubsystemBBQ.h"
#include "Slate.h"
#include "SlateCore.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"

#pragma pack(push, 0x1)

class ABBQBootFlowGameMode;
class ABBQBootFlowGameState;
class ABBQGameHUD;
class ABBQMenuBackground;
class ABBQMetaGameHUD;
class ABBQScreenStack;
class ABBQUICharacter;
class ABBQUI_BootFlowHUD;
class ABBQUI_HUD;
class ABBQUI_MenuHUD;
class UBBQChatWidget;
class UBBQLoadoutWidget;
class UBBQLobbyWidget;
class UBBQScreenGroup;
class UBBQScreenStackItem;
class UBBQUICharacterPreviewWidget;
class UBBQUIFunctionLibrary;
class UBBQUIQuitMatchScreen_UserWidget;
class UBBQUIRoomWidget;
class UBBQUITimerWidget;
class UBBQUI_AbilityTree;

class UBBQUI_MetaGamePopupWidget;
class UBBQUI_MetaProgress;
class UBBQUI_MetaProgressPerk;
class UBBQUI_MovieProgressBar;
class UBBQUI_MultiStateSelectableWidget;
class UBBQUI_MuseumMainMenu;
class UBBQUI_Notification;
class UBBQUI_NotificationContainer;
class UBBQUI_OptionButton;
class UBBQUI_OptionItem;
class UBBQUI_OptionSelection;
class UBBQUI_OptionSlider;
class UBBQUI_Options;
class UBBQUI_OptionsMenuWidget;
class UBBQUI_PageIndicator;
class UBBQUI_PageNumber;
class UBBQUI_PagePanel;
class UBBQUI_PartyIcon;
class UBBQUI_PartyMenu;
class UBBQUI_PauseMenu;
class UBBQUI_Perk;
class UBBQUI_PerkIconHUD;
class UBBQUI_PerkProgress;
class UBBQUI_PlatformIcon;
class UBBQUI_PlayGame;
class UBBQUI_PlayerAvatar;
class UBBQUI_PlayerListHolder;
class UBBQUI_PlayerListMenu;
class UBBQUI_PopUpWidget;
class UBBQUI_PreMatchObjectiveImage;
class UBBQUI_PreMatchObjectives;
class UBBQUI_PrivacyStatement;
class UBBQUI_ProgressBarChunk;
class UBBQUI_Progression;
class UBBQUI_ProgressionBar;
class UBBQUI_ProgressionProgressTab;
class UBBQUI_ProgressionStatistic;
class UBBQUI_ProgressionStatsTab;
class UBBQUI_PromotionalImage;
class UBBQUI_QueuedNotifications;
class UBBQUI_ReportMenu;
class UBBQUI_ResultScreen;
class UBBQUI_ResultScreenPlayer;
class UBBQUI_RichTextPopUpWidget;
class UBBQUI_Scoreboard;
class UBBQUI_Screen;
class UBBQUI_SecondaryAbilityIcon;
class UBBQUI_SelectableContentPassWidget;
class UBBQUI_SelectableEditBox;
class UBBQUI_SelectableWidget;
class UBBQUI_SelectionArrow;
class UBBQUI_ServerList;
class UBBQUI_Settings;
class UBBQUI_StarSignPerk;
class UBBQUI_StartScreen;
class UBBQUI_StoreItemPopupWidget;
class UBBQUI_SubtitleWidget;
class UBBQUI_TabButton;
class UBBQUI_TeamBaseHUD;
class UBBQUI_TextBlock;
class UBBQUI_TextCrawl;
class UBBQUI_TimerPopUp;
class UBBQUI_TopBarMenu;
class UBBQUI_TopBarMenuScreen;
class UBBQUI_TopBarMenuSeparator;
class UBBQUI_TopBarMenuWidget;
class UBBQUI_TopLevelMenu;
class UBBQUI_TutorialScreen;
class UBBQUI_TutorialSelection;
class UBBQUI_TutorialWidget;
class UBBQUI_Tutorials;
class UBBQUI_TutorialsTab;
class UBBQUI_TutorialsTabItem;
class UBBQUI_UnlockTree;
class UBBQUI_UnlockTreeFullScreen;
class UBBQUI_UnlockTreeGridData;
class UBBQUI_UnlockTreeItemInfoPanel;
class UBBQUI_UnlockTreeNodeButton;
class UBBQUI_UnlockTreeNodeData;
class UBBQUI_UnlockTreeNodeWidget;
class UBBQUI_UnlockableCard;
class UBBQUI_UnlockableFullScreen;
class UBBQUI_Unlockables;
class UBBQUI_UserWidget;
class UBBQUI_VictimAbilityDataAsset;
class UBBQUI_VictimHUD;
class UBBQUI_VictimStatus;
class UBBQUI_VictimStatusBar;
class UBBQUI_VictimStatusImage;
class UBBQUI_VideoCinematic;
class UBBQUI_VideoOptions;
class UBBQUI_VisualAttachment;
class UBBQUI_VoiceChatIndicator;
class UBBQUI_VoiceChatIndicatorGroup;
class UBBQUI_WidgetCacheSubsystem;
class UBBQUI_WidgetComponent;
class UCustomizeCharacterListItem;
class UFindServersCallbackProxy;
class UJoinServerCallbackProxy;
class UServerListResult;

/// Enum /Script/BBQUI.EUIAction
/// Size: 0x01 (1 bytes)
enum class EUIAction : uint8_t
{
	EUIAction__UP                                                                    = 0,
	EUIAction__DOWN                                                                  = 1,
	EUIAction__LEFT                                                                  = 2,
	EUIAction__RIGHT                                                                 = 3,
	EUIAction__ACCEPT                                                                = 4,
	EUIAction__BACK                                                                  = 5,
	EUIAction__PREVIOUS                                                              = 6,
	EUIAction__NEXT                                                                  = 7,
	EUIAction__PREVIOUS_PAGE                                                         = 8,
	EUIAction__NEXT_PAGE                                                             = 9,
	EUIAction__PRIMARY_MISC                                                          = 10,
	EUIAction__SECONDARY_MISC                                                        = 11,
	EUIAction__FOCUS_CHAT                                                            = 12,
	EUIAction__NONE                                                                  = 13,
	EUIAction__PUSH_TO_TALK                                                          = 14,
	EUIAction__SPECIAL_LEFT                                                          = 15,
	EUIAction__SPECIAL_RIGHT                                                         = 16,
	EUIAction__MAX_ACTION                                                            = 17
};

/// Enum /Script/BBQUI.EBBQHUDFocusRegainPriority
/// Size: 0x01 (1 bytes)
enum class EBBQHUDFocusRegainPriority : uint8_t
{
	EBBQHUDFocusRegainPriority__Invalid                                              = 0,
	EBBQHUDFocusRegainPriority__None                                                 = 1,
	EBBQHUDFocusRegainPriority__Menu                                                 = 2
};

/// Enum /Script/BBQUI.EBBQUI_SelectableState
/// Size: 0x01 (1 bytes)
enum class EBBQUI_SelectableState : uint8_t
{
	EBBQUI_SelectableState__EMPTY                                                    = 0,
	EBBQUI_SelectableState__IDLE                                                     = 1,
	EBBQUI_SelectableState__CHOSEN                                                   = 2,
	EBBQUI_SelectableState__HOVERED                                                  = 3,
	EBBQUI_SelectableState__NEW                                                      = 4,
	EBBQUI_SelectableState__LOCKED                                                   = 5,
	EBBQUI_SelectableState__AVAILABLE                                                = 6,
	EBBQUI_SelectableState__PURCHASED                                                = 7,
	EBBQUI_SelectableState__EQUIPPED                                                 = 8,
	EBBQUI_SelectableState__PURCHASABLE_CONTENT                                      = 9
};

/// Enum /Script/BBQUI.EBBQUI_ButtonState
/// Size: 0x01 (1 bytes)
enum class EBBQUI_ButtonState : uint8_t
{
	EBBQUI_ButtonState__EMPTY                                                        = 0,
	EBBQUI_ButtonState__IDLE                                                         = 1,
	EBBQUI_ButtonState__SELECTED                                                     = 2,
	EBBQUI_ButtonState__HOVERED                                                      = 3,
	EBBQUI_ButtonState__NEW                                                          = 4,
	EBBQUI_ButtonState__LOCKED                                                       = 5,
	EBBQUI_ButtonState__AVAILABLE                                                    = 6,
	EBBQUI_ButtonState__PURCHASED                                                    = 7
};

/// Enum /Script/BBQUI.EPushMode
/// Size: 0x01 (1 bytes)
enum class EPushMode : uint8_t
{
	Normal                                                                           = 0,
	LayerOnTop                                                                       = 1,
	FromChildren                                                                     = 2
};

/// Enum /Script/BBQUI.EBBQUI_CharacterAugmentAttributeCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_CharacterAugmentAttributeCategory : uint8_t
{
	EBBQUI_CharacterAugmentAttributeCategory__ALL                                    = 0,
	EBBQUI_CharacterAugmentAttributeCategory__PROFICIENCY                            = 1,
	EBBQUI_CharacterAugmentAttributeCategory__STEALTH                                = 2,
	EBBQUI_CharacterAugmentAttributeCategory__STRENGTH                               = 3,
	EBBQUI_CharacterAugmentAttributeCategory__PERCEPTION                             = 4,
	EBBQUI_CharacterAugmentAttributeCategory__ENDURANCE                              = 5,
	EBBQUI_CharacterAugmentAttributeCategory__SAVAGERY                               = 6,
	EBBQUI_CharacterAugmentAttributeCategory__BLOOD_HARVESTING                       = 7,
	EBBQUI_CharacterAugmentAttributeCategory__PERSISTENCE                            = 8,
	EBBQUI_CharacterAugmentAttributeCategory__UNIQUE                                 = 9,
	EBBQUI_CharacterAugmentAttributeCategory__MOTTO_PERK_LVL_01                      = 10,
	EBBQUI_CharacterAugmentAttributeCategory__MOTTO_PERK_LVL_02                      = 11,
	EBBQUI_CharacterAugmentAttributeCategory__MOTTO_PERK_LVL_03                      = 12,
	EBBQUI_CharacterAugmentAttributeCategory__NONE                                   = 13
};

/// Enum /Script/BBQUI.EBBQUI_CharacterAugmentMainCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_CharacterAugmentMainCategory : uint8_t
{
	EBBQUI_CharacterAugmentMainCategory__NONE                                        = 0,
	EBBQUI_CharacterAugmentMainCategory__FAMILY_ABILITY                              = 1,
	EBBQUI_CharacterAugmentMainCategory__FAMILY_PERK                                 = 2,
	EBBQUI_CharacterAugmentMainCategory__FAMILY_EXECUTION                            = 3,
	EBBQUI_CharacterAugmentMainCategory__GRANDPA_ABILITY                             = 4,
	EBBQUI_CharacterAugmentMainCategory__VICTIM_STARSIGN_ABILITY                     = 5,
	EBBQUI_CharacterAugmentMainCategory__VICTIM_PERK                                 = 6
};

/// Enum /Script/BBQUI.EBBQUI_CharacterRequestPopUpState
/// Size: 0x01 (1 bytes)
enum class EBBQUI_CharacterRequestPopUpState : uint8_t
{
	EBBQUI_CharacterRequestPopUpState__NONE                                          = 0,
	EBBQUI_CharacterRequestPopUpState__REQUESTER_SEND                                = 1,
	EBBQUI_CharacterRequestPopUpState__REQUESTER_ACCEPTED                            = 2,
	EBBQUI_CharacterRequestPopUpState__REQUESTER_DECLINED                            = 3,
	EBBQUI_CharacterRequestPopUpState__REQUESTEE_RECEIVE                             = 4,
	EBBQUI_CharacterRequestPopUpState__REQUESTEE_ACCEPTING                           = 5,
	EBBQUI_CharacterRequestPopUpState__REQUESTEE_ACCEPTED                            = 6,
	EBBQUI_CharacterRequestPopUpState__REQUESTEE_CANCELED                            = 7
};

/// Enum /Script/BBQUI.EBBQUI_CreditsLineType
/// Size: 0x01 (1 bytes)
enum class EBBQUI_CreditsLineType : uint8_t
{
	EBBQUI_CreditsLineType__NONE                                                     = 0,
	EBBQUI_CreditsLineType__ORGANIZATION                                             = 1,
	EBBQUI_CreditsLineType__DEPARTMENT                                               = 2,
	EBBQUI_CreditsLineType__TITLE                                                    = 3,
	EBBQUI_CreditsLineType__NAME                                                     = 4,
	EBBQUI_CreditsLineType__PARAGRAPH                                                = 5,
	EBBQUI_CreditsLineType__LOGO                                                     = 6
};

/// Enum /Script/BBQUI.EBBQUI_FamilyAbilityType
/// Size: 0x01 (1 bytes)
enum class EBBQUI_FamilyAbilityType : uint8_t
{
	EBBQUI_FamilyAbilityType__Chainsaw                                               = 0,
	EBBQUI_FamilyAbilityType__ChargeBased                                            = 1,
	EBBQUI_FamilyAbilityType__InventoryBased                                         = 2,
	EBBQUI_FamilyAbilityType__CooldownBased                                          = 3
};

/// Enum /Script/BBQUI.EInputDisplayCategory
/// Size: 0x01 (1 bytes)
enum class EInputDisplayCategory : uint8_t
{
	EInputDisplayCategory__VICTIMS                                                   = 0,
	EInputDisplayCategory__FAMILY                                                    = 1,
	EInputDisplayCategory__LEATHERFACE                                               = 2
};

/// Enum /Script/BBQUI.EBBQUI_InputIcon_Playstation
/// Size: 0x01 (1 bytes)
enum class EBBQUI_InputIcon_Playstation : uint8_t
{
	EBBQUI_InputIcon_Playstation__NONE                                               = 0,
	EBBQUI_InputIcon_Playstation__CROSS                                              = 1,
	EBBQUI_InputIcon_Playstation__SQUARE                                             = 2,
	EBBQUI_InputIcon_Playstation__TRIANGLE                                           = 3,
	EBBQUI_InputIcon_Playstation__CIRCLE                                             = 4,
	EBBQUI_InputIcon_Playstation__R1                                                 = 5,
	EBBQUI_InputIcon_Playstation__L1                                                 = 6,
	EBBQUI_InputIcon_Playstation__R2                                                 = 7,
	EBBQUI_InputIcon_Playstation__L2                                                 = 8,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK_PRESS                              = 9,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK_PRESS                             = 10,
	EBBQUI_InputIcon_Playstation__PS                                                 = 11,
	EBBQUI_InputIcon_Playstation__CREATE                                             = 12,
	EBBQUI_InputIcon_Playstation__OPTIONS                                            = 13,
	EBBQUI_InputIcon_Playstation__TOUCHPAD                                           = 14,
	EBBQUI_InputIcon_Playstation__MUTE                                               = 15,
	EBBQUI_InputIcon_Playstation__DPAD_UP                                            = 16,
	EBBQUI_InputIcon_Playstation__DPAD_DOWN                                          = 17,
	EBBQUI_InputIcon_Playstation__DPAD_LEFT                                          = 18,
	EBBQUI_InputIcon_Playstation__DPAD_RIGHT                                         = 19,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK                                    = 20,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK_MOVE_UP                            = 21,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK_MOVE_DOWN                          = 22,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK_MOVE_LEFT                          = 23,
	EBBQUI_InputIcon_Playstation__LEFT_THUMBSTICK_MOVE_RIGHT                         = 24,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK                                   = 25,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK_MOVE_UP                           = 26,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK_MOVE_DOWN                         = 27,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK_MOVE_LEFT                         = 28,
	EBBQUI_InputIcon_Playstation__RIGHT_THUMBSTICK_MOVE_RIGHT                        = 29,
	EBBQUI_InputIcon_Playstation__DPAD_ALL                                           = 30
};

/// Enum /Script/BBQUI.EBBQUI_InputIcon_Xbox
/// Size: 0x01 (1 bytes)
enum class EBBQUI_InputIcon_Xbox : uint8_t
{
	EBBQUI_InputIcon_Xbox__NONE                                                      = 0,
	EBBQUI_InputIcon_Xbox__A                                                         = 1,
	EBBQUI_InputIcon_Xbox__B                                                         = 2,
	EBBQUI_InputIcon_Xbox__X                                                         = 3,
	EBBQUI_InputIcon_Xbox__Y                                                         = 4,
	EBBQUI_InputIcon_Xbox__LB                                                        = 5,
	EBBQUI_InputIcon_Xbox__RB                                                        = 6,
	EBBQUI_InputIcon_Xbox__LT                                                        = 7,
	EBBQUI_InputIcon_Xbox__RT                                                        = 8,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK_PRESS                                     = 9,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK_PRESS                                    = 10,
	EBBQUI_InputIcon_Xbox__VIEW                                                      = 11,
	EBBQUI_InputIcon_Xbox__MENU                                                      = 12,
	EBBQUI_InputIcon_Xbox__SHARE                                                     = 13,
	EBBQUI_InputIcon_Xbox__DPAD_UP                                                   = 14,
	EBBQUI_InputIcon_Xbox__DPAD_DOWN                                                 = 15,
	EBBQUI_InputIcon_Xbox__DPAD_LEFT                                                 = 16,
	EBBQUI_InputIcon_Xbox__DPAD_RIGHT                                                = 17,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK                                           = 18,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK_MOVE_UP                                   = 19,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK_MOVE_DOWN                                 = 20,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK_MOVE_LEFT                                 = 21,
	EBBQUI_InputIcon_Xbox__LEFT_THUMBSTICK_MOVE_RIGHT                                = 22,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK                                          = 23,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK_MOVE_UP                                  = 24,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK_MOVE_DOWN                                = 25,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK_MOVE_LEFT                                = 26,
	EBBQUI_InputIcon_Xbox__RIGHT_THUMBSTICK_MOVE_RIGHT                               = 27,
	EBBQUI_InputIcon_Xbox__DPAD_ALL                                                  = 28
};

/// Enum /Script/BBQUI.EBBQUI_InputIcon_PC
/// Size: 0x01 (1 bytes)
enum class EBBQUI_InputIcon_PC : uint8_t
{
	EBBQUI_InputIcon_PC__NONE                                                        = 0,
	EBBQUI_InputIcon_PC__KEY                                                         = 1,
	EBBQUI_InputIcon_PC__KEY3                                                        = 2,
	EBBQUI_InputIcon_PC__KEY4                                                        = 3,
	EBBQUI_InputIcon_PC__KEY5                                                        = 4,
	EBBQUI_InputIcon_PC__KEY6                                                        = 5,
	EBBQUI_InputIcon_PC__KEY7                                                        = 6,
	EBBQUI_InputIcon_PC__KEY8                                                        = 7,
	EBBQUI_InputIcon_PC__KEY9                                                        = 8,
	EBBQUI_InputIcon_PC__KEY10                                                       = 9,
	EBBQUI_InputIcon_PC__KEY11                                                       = 10,
	EBBQUI_InputIcon_PC__A                                                           = 11,
	EBBQUI_InputIcon_PC__B                                                           = 12,
	EBBQUI_InputIcon_PC__C                                                           = 13,
	EBBQUI_InputIcon_PC__D                                                           = 14,
	EBBQUI_InputIcon_PC__E                                                           = 15,
	EBBQUI_InputIcon_PC__F                                                           = 16,
	EBBQUI_InputIcon_PC__G                                                           = 17,
	EBBQUI_InputIcon_PC__H                                                           = 18,
	EBBQUI_InputIcon_PC__I                                                           = 19,
	EBBQUI_InputIcon_PC__J                                                           = 20,
	EBBQUI_InputIcon_PC__K                                                           = 21,
	EBBQUI_InputIcon_PC__L                                                           = 22,
	EBBQUI_InputIcon_PC__M                                                           = 23,
	EBBQUI_InputIcon_PC__N                                                           = 24,
	EBBQUI_InputIcon_PC__O                                                           = 25,
	EBBQUI_InputIcon_PC__P                                                           = 26,
	EBBQUI_InputIcon_PC__Q                                                           = 27,
	EBBQUI_InputIcon_PC__R                                                           = 28,
	EBBQUI_InputIcon_PC__S                                                           = 29,
	EBBQUI_InputIcon_PC__T                                                           = 30,
	EBBQUI_InputIcon_PC__U                                                           = 31,
	EBBQUI_InputIcon_PC__V                                                           = 32,
	EBBQUI_InputIcon_PC__W                                                           = 33,
	EBBQUI_InputIcon_PC__X                                                           = 34,
	EBBQUI_InputIcon_PC__Y                                                           = 35,
	EBBQUI_InputIcon_PC__Z                                                           = 36,
	EBBQUI_InputIcon_PC__F1                                                          = 37,
	EBBQUI_InputIcon_PC__F2                                                          = 38,
	EBBQUI_InputIcon_PC__F3                                                          = 39,
	EBBQUI_InputIcon_PC__F4                                                          = 40,
	EBBQUI_InputIcon_PC__F5                                                          = 41,
	EBBQUI_InputIcon_PC__F6                                                          = 42,
	EBBQUI_InputIcon_PC__F7                                                          = 43,
	EBBQUI_InputIcon_PC__F8                                                          = 44,
	EBBQUI_InputIcon_PC__F9                                                          = 45,
	EBBQUI_InputIcon_PC__F10                                                         = 46,
	EBBQUI_InputIcon_PC__F11                                                         = 47,
	EBBQUI_InputIcon_PC__F12                                                         = 48,
	EBBQUI_InputIcon_PC__NUM                                                         = 49,
	EBBQUI_InputIcon_PC__NUM51                                                       = 50,
	EBBQUI_InputIcon_PC__NUM52                                                       = 51,
	EBBQUI_InputIcon_PC__NUM53                                                       = 52,
	EBBQUI_InputIcon_PC__NUM54                                                       = 53,
	EBBQUI_InputIcon_PC__NUM55                                                       = 54,
	EBBQUI_InputIcon_PC__NUM56                                                       = 55,
	EBBQUI_InputIcon_PC__NUM57                                                       = 56,
	EBBQUI_InputIcon_PC__NUM58                                                       = 57,
	EBBQUI_InputIcon_PC__NUM59                                                       = 58,
	EBBQUI_InputIcon_PC__MOUSE                                                       = 59,
	EBBQUI_InputIcon_PC__MOUSE_LEFT                                                  = 60,
	EBBQUI_InputIcon_PC__MOUSE_RIGHT                                                 = 61,
	EBBQUI_InputIcon_PC__MOUSE_MIDDLE                                                = 62,
	EBBQUI_InputIcon_PC__ENTER                                                       = 63,
	EBBQUI_InputIcon_PC__ESC                                                         = 64,
	EBBQUI_InputIcon_PC__SPACE                                                       = 65,
	EBBQUI_InputIcon_PC__SHIFT                                                       = 66,
	EBBQUI_InputIcon_PC__TAB                                                         = 67,
	EBBQUI_InputIcon_PC__ALT                                                         = 68,
	EBBQUI_InputIcon_PC__ARROW_UP                                                    = 69,
	EBBQUI_InputIcon_PC__ARROW_DOWN                                                  = 70,
	EBBQUI_InputIcon_PC__ARROW_LEFT                                                  = 71,
	EBBQUI_InputIcon_PC__ARROW_RIGHT                                                 = 72,
	EBBQUI_InputIcon_PC__ALL_ARROW_KEYS                                              = 73,
	EBBQUI_InputIcon_PC__ALL_WASD_KEYS                                               = 74
};

/// Enum /Script/BBQUI.EBBQUI_TipsTeams
/// Size: 0x01 (1 bytes)
enum class EBBQUI_TipsTeams : uint8_t
{
	EBBQUI_TipsTeams__BOTH                                                           = 0,
	EBBQUI_TipsTeams__VICTIMS                                                        = 1,
	EBBQUI_TipsTeams__FAMILY                                                         = 2,
	EBBQUI_TipsTeams__RUSH_WEEK                                                      = 3
};

/// Enum /Script/BBQUI.EBBQUI_LoadoutItemSubCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_LoadoutItemSubCategory : uint8_t
{
	EBBQUI_LoadoutItemSubCategory__NONE                                              = 0,
	EBBQUI_LoadoutItemSubCategory__PROFICIENCY                                       = 1,
	EBBQUI_LoadoutItemSubCategory__STEALTH                                           = 2,
	EBBQUI_LoadoutItemSubCategory__STRENGTH                                          = 3,
	EBBQUI_LoadoutItemSubCategory__PERCEPTION                                        = 4,
	EBBQUI_LoadoutItemSubCategory__ENDURANCE                                         = 5
};

/// Enum /Script/BBQUI.EBBQUI_LoadoutItemCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_LoadoutItemCategory : uint8_t
{
	EBBQUI_LoadoutItemCategory__FAMILY_ABILITY                                       = 0,
	EBBQUI_LoadoutItemCategory__FAMILY_PERK                                          = 1,
	EBBQUI_LoadoutItemCategory__FAMILY_EXECUTION                                     = 2,
	EBBQUI_LoadoutItemCategory__GRANDPA_ABILITY                                      = 3,
	EBBQUI_LoadoutItemCategory__VICTIM_STARSIGN_ABILITY                              = 4,
	EBBQUI_LoadoutItemCategory__VICTIM_PERK                                          = 5
};

/// Enum /Script/BBQUI.EMatchResultsState
/// Size: 0x01 (1 bytes)
enum class EMatchResultsState : uint8_t
{
	EMatchResultsState__NONE                                                         = 0,
	EMatchResultsState__END_SEQUENCE                                                 = 1,
	EMatchResultsState__SEQUENCE_TRANSITION                                          = 2,
	EMatchResultsState__PROGRESSION_ENTRY                                            = 3,
	EMatchResultsState__PROGRESSION_EXIT                                             = 4,
	EMatchResultsState__PROGRESSION_EXIT_SPECTATOR                                   = 5,
	EMatchResultsState__MATCH_RESULT_ENTRY                                           = 6
};

/// Enum /Script/BBQUI.EBBQUI_InputIconSourceType
/// Size: 0x01 (1 bytes)
enum class EBBQUI_InputIconSourceType : uint8_t
{
	EBBQUI_InputIconSourceType__ACTION                                               = 0,
	EBBQUI_InputIconSourceType__KEY                                                  = 1,
	EBBQUI_InputIconSourceType__OTHER                                                = 2
};

/// Enum /Script/BBQUI.EDestructiveSettingReason
/// Size: 0x01 (1 bytes)
enum class EDestructiveSettingReason : uint8_t
{
	EDestructiveSettingReason__No                                                    = 0,
	EDestructiveSettingReason__PartyDestructive                                      = 1,
	EDestructiveSettingReason__MatchDestructive                                      = 2
};

/// Enum /Script/BBQUI.EBBQPartyIconState
/// Size: 0x01 (1 bytes)
enum class EBBQPartyIconState : uint8_t
{
	EBBQPartyIconState__Party1                                                       = 0,
	EBBQPartyIconState__Party2                                                       = 1,
	EBBQPartyIconState__Party3                                                       = 2,
	EBBQPartyIconState__None                                                         = 3
};

/// Enum /Script/BBQUI.EPlayerListAction
/// Size: 0x01 (1 bytes)
enum class EPlayerListAction : uint8_t
{
	EPlayerListAction__NoneAction                                                    = 0,
	EPlayerListAction__MuteAction                                                    = 1,
	EPlayerListAction__UnmuteAction                                                  = 2,
	EPlayerListAction__ReportAction                                                  = 3,
	EPlayerListAction__AlreadyReportedAction                                         = 4,
	EPlayerListAction__BlockAction                                                   = 5,
	EPlayerListAction__UnblockAction                                                 = 6
};

/// Enum /Script/BBQUI.EBBQ_StatTextFormatType
/// Size: 0x01 (1 bytes)
enum class EBBQ_StatTextFormatType : uint8_t
{
	EBBQ_StatTextFormatType__Number                                                  = 0,
	EBBQ_StatTextFormatType__H_MM_SS                                                 = 1,
	EBBQ_StatTextFormatType__BitCount                                                = 2
};

/// Enum /Script/BBQUI.EBBQUI_UnlockTreeTestStates
/// Size: 0x01 (1 bytes)
enum class EBBQUI_UnlockTreeTestStates : uint8_t
{
	EBBQUI_UnlockTreeTestStates__ALL_REVEALED                                        = 0,
	EBBQUI_UnlockTreeTestStates__ALL_REVEALED_HIDDEN_DESCRIPTIONS                    = 1,
	EBBQUI_UnlockTreeTestStates__HIDE_ALL_REVEAL_ONE                                 = 2,
	EBBQUI_UnlockTreeTestStates__HIDE_ALL_REVEAL_BRANCH                              = 3
};

/// Enum /Script/BBQUI.EBBQUI_UnlockTreeNodeDirection
/// Size: 0x01 (1 bytes)
enum class EBBQUI_UnlockTreeNodeDirection : uint8_t
{
	EBBQUI_UnlockTreeNodeDirection__NONE                                             = 0,
	EBBQUI_UnlockTreeNodeDirection__UP                                               = 1,
	EBBQUI_UnlockTreeNodeDirection__DOWN                                             = 2,
	EBBQUI_UnlockTreeNodeDirection__LEFT                                             = 3,
	EBBQUI_UnlockTreeNodeDirection__RIGHT                                            = 4
};

/// Enum /Script/BBQUI.EBBQUI_UnlockTreeNodePurchasedFillCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_UnlockTreeNodePurchasedFillCategory : uint8_t
{
	EBBQUI_UnlockTreeNodePurchasedFillCategory__NONE                                 = 0,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_SMALL_CONNECTORS                = 1,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_LARGE_CONNECTORS                = 2,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_LINE                            = 3,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_CORNER                          = 4,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_UP_DOWN_T                       = 5,
	EBBQUI_UnlockTreeNodePurchasedFillCategory__FILL_BRANCH                          = 6
};

/// Enum /Script/BBQUI.EBBQUI_UnlockTreeNodeMainCategory
/// Size: 0x01 (1 bytes)
enum class EBBQUI_UnlockTreeNodeMainCategory : uint8_t
{
	EBBQUI_UnlockTreeNodeMainCategory__NONE                                          = 0,
	EBBQUI_UnlockTreeNodeMainCategory__PERK                                          = 1,
	EBBQUI_UnlockTreeNodeMainCategory__EXTRA_ATTRIBUTE_POINT                         = 2,
	EBBQUI_UnlockTreeNodeMainCategory__STAR_SIGN_ABILITY                             = 3,
	EBBQUI_UnlockTreeNodeMainCategory__FAMILY_ABILITY                                = 4,
	EBBQUI_UnlockTreeNodeMainCategory__GRANDPA_ABILITY                               = 5,
	EBBQUI_UnlockTreeNodeMainCategory__RANDOM                                        = 6,
	EBBQUI_UnlockTreeNodeMainCategory__BRANCH_TWO_WAY                                = 7,
	EBBQUI_UnlockTreeNodeMainCategory__BRANCH_TWO_WAY_SHOW_ALL_BEHIND                = 8,
	EBBQUI_UnlockTreeNodeMainCategory__BRANCH_THREE_WAY                              = 9,
	EBBQUI_UnlockTreeNodeMainCategory__BRANCH_THREE_WAY_SHOW_ALL_BEHIND              = 10,
	EBBQUI_UnlockTreeNodeMainCategory__HORIZONTAL_CONNECTOR_RIGHT                    = 11,
	EBBQUI_UnlockTreeNodeMainCategory__HORIZONTAL_CONNECTOR_LEFT                     = 12,
	EBBQUI_UnlockTreeNodeMainCategory__VERTICAL_CONNECTOR                            = 13,
	EBBQUI_UnlockTreeNodeMainCategory__TOP_RIGHT_CONNECTOR                           = 14,
	EBBQUI_UnlockTreeNodeMainCategory__TOP_LEFT_CONNECTOR                            = 15,
	EBBQUI_UnlockTreeNodeMainCategory__BOTTOM_RIGHT_CONNECTOR                        = 16,
	EBBQUI_UnlockTreeNodeMainCategory__BOTTOM_LEFT_CONNECTOR                         = 17,
	EBBQUI_UnlockTreeNodeMainCategory__UP_T_JUNCTION_CONNECTOR                       = 18,
	EBBQUI_UnlockTreeNodeMainCategory__DOWN_T_JUNCTION_CONNECTOR                     = 19,
	EBBQUI_UnlockTreeNodeMainCategory__EXECUTION                                     = 20,
	EBBQUI_UnlockTreeNodeMainCategory__UNLOCKABLES                                   = 21
};

/// Enum /Script/BBQUI.EBBQVictimUIStatus
/// Size: 0x01 (1 bytes)
enum class EBBQVictimUIStatus : uint8_t
{
	EBBQVictimUIStatus__None                                                         = 0,
	EBBQVictimUIStatus__Disconnected                                                 = 1,
	EBBQVictimUIStatus__Escaped                                                      = 2,
	EBBQVictimUIStatus__Dead                                                         = 3
};

/// Struct /Script/BBQUI.ScreenStackEntry
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FScreenStackEntry
{ 
	class UBBQScreenStackItem*                         Item;                                                       // 0x0000   (0x0008)  
	int32_t                                            ZOrder;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UClass*                                      BackgroundClass;                                            // 0x0010   (0x0008)  
};

/// Struct /Script/BBQUI.BBQUI_AnimationInfo
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQUI_AnimationInfo
{ 
	class UWidgetAnimation*                            Animation;                                                  // 0x0000   (0x0008)  
	float                                              StartAtTime;                                                // 0x0008   (0x0004)  
	int32_t                                            NumberOfLoops;                                              // 0x000C   (0x0004)  
	TEnumAsByte<EUMGSequencePlayMode>                  PlayMode;                                                   // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              PlaybackSpeed;                                              // 0x0014   (0x0004)  
	bool                                               bRestoreState;                                              // 0x0018   (0x0001)  
	bool                                               bSetStateRootVisibilityAtStart;                             // 0x0019   (0x0001)  
	bool                                               bShouldPlay;                                                // 0x001A   (0x0001)  
	unsigned char                                      UnknownData01_7[0x5];                                       // 0x001B   (0x0005)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_StateChangeAnimationInfo
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FBBQUI_StateChangeAnimationInfo
{ 
	FBBQUI_AnimationInfo                               OnStateEnabled;                                             // 0x0000   (0x0020)  
	FBBQUI_AnimationInfo                               OnStateDisabled;                                            // 0x0020   (0x0020)  
};

/// Struct /Script/BBQUI.BBQUI_TextureAndColourPalette
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQUI_TextureAndColourPalette
{ 
	TWeakObjectPtr<class UTexture2D*>                  LayerTexture;                                               // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0008   (0x0020)  MISSED
	FDataTableRowHandle                                ColorPalette;                                               // 0x0028   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_TopBarMenuTabData
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQUI_TopBarMenuTabData
{ 
	FText                                              TabDisplayName;                                             // 0x0000   (0x0018)  
	bool                                               bDisplaySeparator;                                          // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0019   (0x0007)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_CharacterAugmentUniqueCosmeticData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQUI_CharacterAugmentUniqueCosmeticData
{ 
	EBBQUI_CharacterAugmentMainCategory                AugmentMainCategory;                                        // 0x0000   (0x0001)  
	EBBQUI_CharacterAugmentAttributeCategory           AugmentAttributeCategory;                                   // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<FBBQUI_TextureAndColourPalette>             AugmentIconLayers;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_CharacterAugmentSharedCosmeticData
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_CharacterAugmentSharedCosmeticData
{ 
	TArray<FBBQUI_TextureAndColourPalette>             AugmentBaseIconLayers;                                      // 0x0000   (0x0010)  
	FText                                              MainCategoryDisplayText;                                    // 0x0010   (0x0018)  
};

/// Struct /Script/BBQUI.BBQUI_CharacterAugmentAttributeData
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQUI_CharacterAugmentAttributeData
{ 
	FName                                              AttributeFName;                                             // 0x0000   (0x0008)  
	FDataTableRowHandle                                AttributeColourPalette;                                     // 0x0008   (0x0010)  
	FText                                              AttributeText;                                              // 0x0018   (0x0018)  
	bool                                               bIsFamilyAttribute;                                         // 0x0030   (0x0001)  
	EBBQUI_CharacterAugmentMainCategory                TargetCategory;                                             // 0x0031   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x0032   (0x0006)  MISSED
};

/// Struct /Script/BBQUI.BBQCharacterCardData
/// Size: 0x05A0 (1440 bytes) (0x000000 - 0x0005A0) align 8 MaxSize: 0x05A0
struct FBBQCharacterCardData
{ 
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x0000   (0x0010)  MISSED
	FPlayerSetup                                       CharacterSetup;                                             // 0x0010   (0x0588)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x0598   (0x0008)  MISSED
};

/// Struct /Script/BBQUI.ControlsKeyDescription
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FControlsKeyDescription
{ 
	TArray<FText>                                      ActionDescriptions;                                         // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.ControlsPresetData
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FControlsPresetData
{ 
	TMap<FKey, FControlsKeyDescription>                KeyDescriptions;                                            // 0x0000   (0x0050)  
};

/// Struct /Script/BBQUI.BBQUI_InputPromptData
/// Size: 0x0090 (144 bytes) (0x000000 - 0x000090) align 8 MaxSize: 0x0090
struct FBBQUI_InputPromptData
{ 
	FText                                              DisplayLabel;                                               // 0x0000   (0x0018)  
	class UInputAction*                                InputAction;                                                // 0x0018   (0x0008)  
	FName                                              UIAssetIdentifier;                                          // 0x0020   (0x0008)  
	bool                                               bUseCustomFont;                                             // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FSlateFontInfo                                     Font;                                                       // 0x0030   (0x0058)  
	bool                                               bHoldInputPrompt;                                           // 0x0088   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0089   (0x0007)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_FamilyAbilityInfo
/// Size: 0x00C0 (192 bytes) (0x000000 - 0x0000C0) align 8 MaxSize: 0x00C0
struct FBBQUI_FamilyAbilityInfo
{ 
	EBBQUI_FamilyAbilityType                           AbilityType;                                                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  AbilityIcon;                                                // 0x0008   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0010   (0x0020)  MISSED
	class UInputAction*                                AbilityInputAction;                                         // 0x0030   (0x0008)  
	EBBQAbilityInputID                                 AbilityInputID;                                             // 0x0038   (0x0001)  
	EBBQAbilityInputID                                 SecondaryAbilityInputID;                                    // 0x0039   (0x0001)  
	bool                                               bShowAbilityProgressBar;                                    // 0x003A   (0x0001)  
	bool                                               bShowPromptsForSecondaryAbility;                            // 0x003B   (0x0001)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	FGameplayAttribute                                 ChargeAttribute;                                            // 0x0040   (0x0038)  
	FGameplayAttribute                                 ChargeAttributeMax;                                         // 0x0078   (0x0038)  
	TArray<FBBQUI_InputPromptData>                     PromptsToShowWhileActive;                                   // 0x00B0   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_FearConditionLevelData
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQUI_FearConditionLevelData : FTableRowBase
{ 
	int32_t                                            ConditionLevel;                                             // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDataTableRowHandle                                CurrentConditionLevelColour;                                // 0x0010   (0x0010)  
	FDataTableRowHandle                                NextConditionLevelColour;                                   // 0x0020   (0x0010)  
	float                                              BeatsPerMinute;                                             // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_GameHUDWidgetVisibilityConditions
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_GameHUDWidgetVisibilityConditions
{ 
	class UWidget*                                     Widget;                                                     // 0x0000   (0x0008)  
	TArray<EBBQHUDVisibleGroup>                        GameHUDConditions;                                          // 0x0008   (0x0010)  
	TArray<EHUDVisibilityOptions>                      PlayerPrefConditions;                                       // 0x0018   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_HeartConditionLevelData
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FBBQUI_HeartConditionLevelData : FTableRowBase
{ 
	int32_t                                            ConditionLevel;                                             // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FDataTableRowHandle                                CurrentConditionLevelColour;                                // 0x0010   (0x0010)  
	FDataTableRowHandle                                NextConditionLevelColour;                                   // 0x0020   (0x0010)  
	float                                              BeatsPerMinute;                                             // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/BBQUI.InputDescriptionForInputKey
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 MaxSize: 0x0068
struct FInputDescriptionForInputKey
{ 
	TMap<FKey, FText>                                  DescriptionsForKeys;                                        // 0x0000   (0x0050)  
	FKey                                               NegativeKey;                                                // 0x0050   (0x0018)  
};

/// Struct /Script/BBQUI.InputDescriptionDetails
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FInputDescriptionDetails
{ 
	TMap<EInputDisplayCategory, FInputDescriptionForInputKey> DescriptionsCategoryMap;                             // 0x0000   (0x0050)  
};

/// Struct /Script/BBQUI.InputDescriptionDetailsForPresets
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FInputDescriptionDetailsForPresets
{ 
	TArray<FInputDescriptionDetails>                   PresetsDescriptionsData;                                    // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.BBQGroupedMappings
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQGroupedMappings
{ 
	FName                                              GroupName;                                                  // 0x0000   (0x0008)  
	TArray<FBBQActionKeyMapping>                       MappingsGroup;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_LoadoutItemCategoryRow
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQUI_LoadoutItemCategoryRow
{ 
	EBBQUI_LoadoutItemCategory                         ItemCategory;                                               // 0x0000   (0x0001)  
	EBBQUI_LoadoutItemSubCategory                      ItemSubCategory;                                            // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<class UBBQUI_LoadoutItemData*>              ItemsInCategory;                                            // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_TextureAndColour
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQUI_TextureAndColour
{ 
	class UTexture2D*                                  LayerTexture;                                               // 0x0000   (0x0008)  
	FDataTableRowHandle                                ColorPalette;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQNotificationsPool
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQNotificationsPool
{ 
	TArray<class UBBQUI_Notification*>                 Pool;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.BBQPlatformFlags
/// Size: 0x0009 (9 bytes) (0x000000 - 0x000009) align 1 MaxSize: 0x0009
struct FBBQPlatformFlags
{ 
	bool                                               bPC;                                                        // 0x0000   (0x0001)  
	bool                                               bPS5;                                                       // 0x0001   (0x0001)  
	bool                                               bXboxSeriesS;                                               // 0x0002   (0x0001)  
	bool                                               bXboxSeriesX;                                               // 0x0003   (0x0001)  
	bool                                               bPS4;                                                       // 0x0004   (0x0001)  
	bool                                               bPS4Pro;                                                    // 0x0005   (0x0001)  
	bool                                               bXboxOne;                                                   // 0x0006   (0x0001)  
	bool                                               bXboxOneS;                                                  // 0x0007   (0x0001)  
	bool                                               bXboxOneX;                                                  // 0x0008   (0x0001)  
};

/// Struct /Script/BBQUI.BBQUIAvailableGameModeFlags
/// Size: 0x0002 (2 bytes) (0x000000 - 0x000002) align 1 MaxSize: 0x0002
struct FBBQUIAvailableGameModeFlags
{ 
	bool                                               bLobby;                                                     // 0x0000   (0x0001)  
	bool                                               bMuseum;                                                    // 0x0001   (0x0001)  
};

/// Struct /Script/BBQUI.BBQNumberFormattingOptions
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 MaxSize: 0x0014
struct FBBQNumberFormattingOptions
{ 
	bool                                               bAlwaysSign;                                                // 0x0000   (0x0001)  
	bool                                               bUseGrouping;                                               // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0002   (0x0002)  MISSED
	int32_t                                            MinimumIntegralDigits;                                      // 0x0004   (0x0004)  
	int32_t                                            MaximumIntegralDigits;                                      // 0x0008   (0x0004)  
	int32_t                                            MinimumFractionalDigits;                                    // 0x000C   (0x0004)  
	int32_t                                            MaximumFractionalDigits;                                    // 0x0010   (0x0004)  
};

/// Struct /Script/BBQUI.BBQUI_ObjectiveUI
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_ObjectiveUI
{ 
	class UTexture2D*                                  ObjectiveBackground;                                        // 0x0000   (0x0008)  
	class UTexture2D*                                  ObjectiveImage;                                             // 0x0008   (0x0008)  
	FText                                              ObjectiveText;                                              // 0x0010   (0x0018)  
};

/// Struct /Script/BBQUI.BBQNotificationQueueElemData
/// Size: 0x00D0 (208 bytes) (0x000000 - 0x0000D0) align 8 MaxSize: 0x00D0
struct FBBQNotificationQueueElemData
{ 
	FBBQGameplayActivityEvent                          ActivityEvent;                                              // 0x0000   (0x0098)  
	FBBQNotificationData                               CustomNotificationData;                                     // 0x0098   (0x0038)  
};

/// Struct /Script/BBQUI.UIActionInput
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FUIActionInput
{ 
	EUIAction                                          Action;                                                     // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<FKey>                                       Input;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQGameMessagePopUp
/// Size: 0x0098 (152 bytes) (0x000000 - 0x000098) align 8 MaxSize: 0x0098
struct FBBQGameMessagePopUp
{ 
	FName                                              Template;                                                   // 0x0000   (0x0008)  
	TMap<FName, EGameMessageHandlerAction>             Actions;                                                    // 0x0008   (0x0050)  
	FName                                              DefaultAction;                                              // 0x0058   (0x0008)  
	FText                                              Title;                                                      // 0x0060   (0x0018)  
	FText                                              Message;                                                    // 0x0078   (0x0018)  
	bool                                               bShouldPauseGame;                                           // 0x0090   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0091   (0x0007)  MISSED
};

/// Struct /Script/BBQUI.BBQGameMessageLog
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FBBQGameMessageLog
{ 
	FText                                              Category;                                                   // 0x0000   (0x0018)  
	FText                                              Message;                                                    // 0x0018   (0x0018)  
};

/// Struct /Script/BBQUI.BBQGameMessageHandlerData
/// Size: 0x00D0 (208 bytes) (0x000000 - 0x0000D0) align 8 MaxSize: 0x00D0
struct FBBQGameMessageHandlerData
{ 
	bool                                               bEnablePopUp;                                               // 0x0000   (0x0001)  
	bool                                               bEnableLog;                                                 // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0002   (0x0006)  MISSED
	FBBQGameMessagePopUp                               PopUp;                                                      // 0x0008   (0x0098)  
	FBBQGameMessageLog                                 Log;                                                        // 0x00A0   (0x0030)  
};

/// Struct /Script/BBQUI.BBQUnlockableTypeTextureData
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 MaxSize: 0x0050
struct FBBQUnlockableTypeTextureData
{ 
	TWeakObjectPtr<class UTexture2D*>                  SmallTypeTexture;                                           // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0008   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  BigTypeTexture;                                             // 0x0028   (0x0008)  
	unsigned char                                      UnknownData01_7[0x20];                                      // 0x0030   (0x0020)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeNodeChain
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_UnlockTreeNodeChain
{ 
	TArray<class UBBQUI_UnlockTreeNodeWidget*>         NodesInChain;                                               // 0x0000   (0x0010)  
	int32_t                                            CurrentIndex;                                               // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FTimerHandle                                       ChainAnimTimerHandle;                                       // 0x0018   (0x0008)  
	int32_t                                            PlayOrder;                                                  // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeGridPositionData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQUI_UnlockTreeGridPositionData
{ 
	bool                                               IsBaseNode;                                                 // 0x0000   (0x0001)  
	bool                                               IsHiddenNode;                                               // 0x0001   (0x0001)  
	bool                                               IsBranchReconnectNode;                                      // 0x0002   (0x0001)  
	bool                                               IsBranchChoiceNode;                                         // 0x0003   (0x0001)  
	bool                                               StopNodeNavUp;                                              // 0x0004   (0x0001)  
	bool                                               StopNodeNavDown;                                            // 0x0005   (0x0001)  
	bool                                               StopNodeNavLeft;                                            // 0x0006   (0x0001)  
	bool                                               StopNodeNavRight;                                           // 0x0007   (0x0001)  
	class UBBQUI_UnlockTreeNodeData*                   NodeData;                                                   // 0x0008   (0x0008)  
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeGridDataRow
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQUI_UnlockTreeGridDataRow
{ 
	TArray<FBBQUI_UnlockTreeGridPositionData>          GridRowData;                                                // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeNodeCosmeticData
/// Size: 0x0058 (88 bytes) (0x000000 - 0x000058) align 8 MaxSize: 0x0058
struct FBBQUI_UnlockTreeNodeCosmeticData
{ 
	EBBQUI_UnlockTreeNodeMainCategory                  NodeCategory;                                               // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<FBBQUI_TextureAndColourPalette>             NodeLayers;                                                 // 0x0008   (0x0010)  
	TArray<EBBQUI_UnlockTreeNodePurchasedFillCategory> FillCategories;                                             // 0x0018   (0x0010)  
	FText                                              NodeDisplayTitle;                                           // 0x0028   (0x0018)  
	FText                                              NodeDisplayDescription;                                     // 0x0040   (0x0018)  
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeRandomNodePossibilities
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQUI_UnlockTreeRandomNodePossibilities
{ 
	TArray<FName>                                      UIAssetIdentifiers;                                         // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeNodeFillCosmeticData
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 MaxSize: 0x0010
struct FBBQUI_UnlockTreeNodeFillCosmeticData
{ 
	TArray<FBBQUI_TextureAndColourPalette>             NodeFillLayers;                                             // 0x0000   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_VictimAbilityInfo
/// Size: 0x0070 (112 bytes) (0x000000 - 0x000070) align 8 MaxSize: 0x0070
struct FBBQUI_VictimAbilityInfo
{ 
	bool                                               bHasAdditionalHighlight;                                    // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FGameplayVariableFloat                             HighlightValue;                                             // 0x0008   (0x0058)  
	FGameplayTag                                       AbilityDisabledTag;                                         // 0x0060   (0x0008)  
	bool                                               bIgnoreAbilityDisabledTagOnFullProgress;                    // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Struct /Script/BBQUI.BBQStatusTextureData
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 MaxSize: 0x0048
struct FBBQStatusTextureData
{ 
	TWeakObjectPtr<class UTexture2D*>                  StatusTexture;                                              // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0008   (0x0020)  MISSED
	FLinearColor                                       StatusColor;                                                // 0x0028   (0x0010)  
	FLinearColor                                       BackgroundColor;                                            // 0x0038   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUICharacterPreviewSetup
/// Size: 0x00B0 (176 bytes) (0x000008 - 0x0000B0) align 16 MaxSize: 0x00B0
struct FBBQUICharacterPreviewSetup : FTableRowBase
{ 
	TWeakObjectPtr<class UWorld*>                      LevelToStream;                                              // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0010   (0x0020)  MISSED
	FTransform                                         LevelTransform;                                             // 0x0030   (0x0030)  
	SDK_UNDEFINED(16,555) /* TArray<TSoftObjectPtr<UClass*>> */ __um(CharacterClasses);                            // 0x0060   (0x0010)  
	FTransform                                         CharacterTransform;                                         // 0x0070   (0x0030)  
	class UDataTable*                                  CameraProfiles;                                             // 0x00A0   (0x0008)  
	unsigned char                                      UnknownData01_7[0x8];                                       // 0x00A8   (0x0008)  MISSED
};

/// Struct /Script/BBQUI.LobbyPlayerData
/// Size: 0x0078 (120 bytes) (0x000000 - 0x000078) align 8 MaxSize: 0x0078
struct FLobbyPlayerData
{ 
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0000   (0x0018)  MISSED
	FString                                            Nickname;                                                   // 0x0018   (0x0010)  
	ETeamID                                            Team;                                                       // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FString                                            Character;                                                  // 0x0030   (0x0010)  
	TArray<class UClass*>                              Perks;                                                      // 0x0040   (0x0010)  
	class UClass*                                      MottoPerk;                                                  // 0x0050   (0x0008)  
	TArray<class UClass*>                              AbilityPerks;                                               // 0x0058   (0x0010)  
	FLobbyPlayerMetaData                               MetaData;                                                   // 0x0068   (0x000C)  
	bool                                               bReady;                                                     // 0x0074   (0x0001)  
	bool                                               bInLobby;                                                   // 0x0075   (0x0001)  
	unsigned char                                      UnknownData02_7[0x2];                                       // 0x0076   (0x0002)  MISSED
};

/// Struct /Script/BBQUI.ScreenTransitionData
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FScreenTransitionData
{ 
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0000   (0x0018)  MISSED
	class ABBQScreenStack*                             PopFromStack;                                               // 0x0018   (0x0008)  
};

/// Struct /Script/BBQUI.BBQUI_CompleteCharacterAugmentCosmeticData
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_CompleteCharacterAugmentCosmeticData
{ 
	unsigned char                                      UnknownData00_2[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/BBQUI.BBQColourPalette
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FBBQColourPalette : FTableRowBase
{ 
	FLinearColor                                       Color;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_CreditsEntry
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FBBQUI_CreditsEntry : FTableRowBase
{ 
	EBBQUI_CreditsLineType                             Type;                                                       // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            Value;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/BBQUI.BBQUI_InputPromptInfo
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FBBQUI_InputPromptInfo : FTableRowBase
{ 
	EBBQUI_InputIcon_PC                                PCPromptIcon;                                               // 0x0008   (0x0001)  
	EBBQUI_InputIcon_Xbox                              XboxPromptIcon;                                             // 0x0009   (0x0001)  
	EBBQUI_InputIcon_Playstation                       PlaystationPromptIcon;                                      // 0x000A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x000B   (0x0005)  MISSED
	FText                                              PromptText;                                                 // 0x0010   (0x0018)  
};

/// Struct /Script/BBQUI.BBQUI_LoadingTip
/// Size: 0x0078 (120 bytes) (0x000008 - 0x000078) align 8 MaxSize: 0x0078
struct FBBQUI_LoadingTip : FTableRowBase
{ 
	EBBQUI_TipsTeams                                   TeamToDisplayFor;                                           // 0x0008   (0x0001)  
	bool                                               bHideInDemoBuild;                                           // 0x0009   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x000A   (0x0006)  MISSED
	FText                                              TipText;                                                    // 0x0010   (0x0018)  
	TMap<FString, FBBQActionKeyMapping>                ActionsForIconDisplayInTextTip;                             // 0x0028   (0x0050)  
};

/// Struct /Script/BBQUI.BBQOtherInputIcons
/// Size: 0x00A8 (168 bytes) (0x000008 - 0x0000A8) align 8 MaxSize: 0x00A8
struct FBBQOtherInputIcons : FTableRowBase
{ 
	TWeakObjectPtr<class UTexture2D*>                  KeyboardIcon;                                               // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0010   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  PS4Icon;                                                    // 0x0030   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0038   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  PS5Icon;                                                    // 0x0058   (0x0008)  
	unsigned char                                      UnknownData02_6[0x20];                                      // 0x0060   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  XboxIcon;                                                   // 0x0080   (0x0008)  
	unsigned char                                      UnknownData03_7[0x20];                                      // 0x0088   (0x0020)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_ProgressionStatDisplayDetails
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000060) align 8 MaxSize: 0x0060
struct FBBQUI_ProgressionStatDisplayDetails : FTableRowBase
{ 
	EPlayerStatType                                    StatType;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FText                                              TitleText;                                                  // 0x0010   (0x0018)  
	FText                                              DescriptionText;                                            // 0x0028   (0x0018)  
	FText                                              UnitText;                                                   // 0x0040   (0x0018)  
	EBBQ_StatTextFormatType                            StatTextFormatType;                                         // 0x0058   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0059   (0x0007)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_ScreenTransitionData
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FBBQUI_ScreenTransitionData : FTableRowBase
{ 
	class ULevelSequence*                              TransitionSequence;                                         // 0x0008   (0x0008)  
	TSoftObjectPtr<class UClass*>                      DesiredBackground;                                          // 0x0010   (0x0028)  
	FName                                              DesiredScreenName;                                          // 0x0038   (0x0008)  
	float                                              TransitionPlayRate;                                         // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeGridNodeData
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 MaxSize: 0x0018
struct FBBQUI_UnlockTreeGridNodeData
{ 
	FName                                              NodeAssetIdentifier;                                        // 0x0000   (0x0008)  
	bool                                               bIsBaseNode;                                                // 0x0008   (0x0001)  
	bool                                               bIsUnlocked;                                                // 0x0009   (0x0001)  
	bool                                               bIsHiddenNode;                                              // 0x000A   (0x0001)  
	bool                                               bIsBranchReconnectNode;                                     // 0x000B   (0x0001)  
	bool                                               bIsBranchChoiceNode;                                        // 0x000C   (0x0001)  
	bool                                               bShouldShowAllBehindOnReveal;                               // 0x000D   (0x0001)  
	bool                                               bStopNodeNavUp;                                             // 0x000E   (0x0001)  
	bool                                               bStopNodeNavDown;                                           // 0x000F   (0x0001)  
	bool                                               bStopNodeNavLeft;                                           // 0x0010   (0x0001)  
	bool                                               bStopNodeNavRight;                                          // 0x0011   (0x0001)  
	bool                                               bIsOneWayUp;                                                // 0x0012   (0x0001)  
	bool                                               bIsOneWayDown;                                              // 0x0013   (0x0001)  
	bool                                               bIsOneWayLeft;                                              // 0x0014   (0x0001)  
	bool                                               bIsOneWayRight;                                             // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_7[0x2];                                       // 0x0016   (0x0002)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeRow
/// Size: 0x02E0 (736 bytes) (0x000008 - 0x0002E0) align 8 MaxSize: 0x02E0
struct FBBQUI_UnlockTreeRow : FTableRowBase
{ 
	FBBQUI_UnlockTreeGridNodeData                      Column;                                                     // 0x0008   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column0;                                                    // 0x0020   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column1;                                                    // 0x0038   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column2;                                                    // 0x0050   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column3;                                                    // 0x0068   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column4;                                                    // 0x0080   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column5;                                                    // 0x0098   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column6;                                                    // 0x00B0   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column7;                                                    // 0x00C8   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column8;                                                    // 0x00E0   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column9;                                                    // 0x00F8   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column10;                                                   // 0x0110   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column11;                                                   // 0x0128   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column12;                                                   // 0x0140   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column13;                                                   // 0x0158   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column14;                                                   // 0x0170   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column15;                                                   // 0x0188   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column16;                                                   // 0x01A0   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column17;                                                   // 0x01B8   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column18;                                                   // 0x01D0   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column19;                                                   // 0x01E8   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column20;                                                   // 0x0200   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column21;                                                   // 0x0218   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column22;                                                   // 0x0230   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column23;                                                   // 0x0248   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column24;                                                   // 0x0260   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column25;                                                   // 0x0278   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column26;                                                   // 0x0290   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column27;                                                   // 0x02A8   (0x0018)  
	FBBQUI_UnlockTreeGridNodeData                      Column28;                                                   // 0x02C0   (0x0018)  
	int32_t                                            MaxColumns;                                                 // 0x02D8   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x02DC   (0x0004)  MISSED
};

/// Struct /Script/BBQUI.BBQUI_UnlockTreeCompleteNodeData
/// Size: 0x00B8 (184 bytes) (0x000000 - 0x0000B8) align 8 MaxSize: 0x00B8
struct FBBQUI_UnlockTreeCompleteNodeData
{ 
	unsigned char                                      UnknownData00_2[0xB8];                                      // 0x0000   (0x00B8)  MISSED
};

/// Struct /Script/BBQUI.BBQWidgetComponentInstanceData
/// Size: 0x00C8 (200 bytes) (0x0000B8 - 0x0000C8) align 8 MaxSize: 0x00C8
struct FBBQWidgetComponentInstanceData : FSceneComponentInstanceData
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x00B8   (0x0010)  MISSED
};

/// Struct /Script/BBQUI.BBQUICharacterCameraProfile
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000058) align 8 MaxSize: 0x0058
struct FBBQUICharacterCameraProfile : FTableRowBase
{ 
	FName                                              TargetBone;                                                 // 0x0008   (0x0008)  
	FVector                                            TargetRelativeOffset;                                       // 0x0010   (0x000C)  
	FVector                                            TargetAbsoluteOffset;                                       // 0x001C   (0x000C)  
	FVector                                            CameraOffset;                                               // 0x0028   (0x000C)  
	FRotator                                           CameraRotation;                                             // 0x0034   (0x000C)  
	float                                              CameraDistance;                                             // 0x0040   (0x0004)  
	float                                              FOV;                                                        // 0x0044   (0x0004)  
	float                                              PitchMin;                                                   // 0x0048   (0x0004)  
	float                                              PitchMax;                                                   // 0x004C   (0x0004)  
	float                                              CameraTurnSpeed;                                            // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Class /Script/BBQUI.BBQBootFlowGameMode
/// Size: 0x03B0 (944 bytes) (0x0003B0 - 0x0003B0) align 8 MaxSize: 0x03B0
class ABBQBootFlowGameMode : public ABBQGameMode
{ 
public:
};

/// Class /Script/BBQUI.BBQBootFlowGameState
/// Size: 0x05D0 (1488 bytes) (0x0005D0 - 0x0005D0) align 8 MaxSize: 0x05D0
class ABBQBootFlowGameState : public ABBQGameState
{ 
public:
};

/// Class /Script/BBQUI.BBQUI_UserWidget
/// Size: 0x03B0 (944 bytes) (0x000260 - 0x0003B0) align 8 MaxSize: 0x03B0
class UBBQUI_UserWidget : public UUserWidget
{ 
public:
	class UWidget*                                     DefaultFocusableWidget;                                     // 0x0260   (0x0008)  
	SDK_UNDEFINED(16,556) /* FMulticastInlineDelegate */ __um(NativeMouseUpdate);                                  // 0x0268   (0x0010)  
	class ABBQScreenStack*                             ParentStack;                                                // 0x0278   (0x0008)  
	EBBQHUDFocusRegainPriority                         FocusRegainPriority;                                        // 0x0280   (0x0001)  
	unsigned char                                      UnknownData00_7[0x12F];                                     // 0x0281   (0x012F)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindWidgetToCallBack
	void UnBindWidgetToCallBack(UWidget* Widget) // [0x1fe0880] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UWidget*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Widget);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindWidgetCallbacks
	void UnBindWidgetCallbacks() // [0x1fe0860] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindGeneralCallbacks
	void UnBindGeneralCallbacks() // [0x1fe0840] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindGeneralCallBack
	void UnBindGeneralCallBack(EUIAction Action) // [0x1fe07c0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EUIAction);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Action);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindActionPreviewCallbacks
	void UnBindActionPreviewCallbacks() // [0x1fe07a0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.UnBindActionPreviewCallback
	void UnBindActionPreviewCallback(EUIAction Action) // [0x1fe0720] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EUIAction);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Action);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.OnWidgetActionPreview__DelegateSignature
	bool OnWidgetActionPreview__DelegateSignature() // [0x2438a30] Public|Delegate      
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.OnWidgetAction__DelegateSignature
	void OnWidgetAction__DelegateSignature() // [0x2438a30] Public|Delegate      
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.OnNewWidgetFocused
	void OnNewWidgetFocused(UWidget* FocusedWidget, UWidget* PreviousFocusedWidget) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UWidget*, UWidget*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(FocusedWidget, PreviousFocusedWidget);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.IsShown
	bool IsShown() // [0x1fded50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.IsOnStack
	bool IsOnStack() // [0x1fded20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.GetFocusRegainPriority
	EBBQHUDFocusRegainPriority GetFocusRegainPriority() // [0x1fdea60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef EBBQHUDFocusRegainPriority (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.GetDefaultFocusableWidget
	UWidget* GetDefaultFocusableWidget() // [0x1e5e130] Final|Native|Public|BlueprintCallable 
	{
		typedef class UWidget* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.GetAbsolutePositionForWidget
	FVector2D GetAbsolutePositionForWidget() // [0x1fde920] Final|Native|Public|HasDefaults|BlueprintCallable 
	{
		typedef FVector2D (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.ExecuteWidgetFunc
	bool ExecuteWidgetFunc(UWidget* Widget, EUIAction Action) // [0x1fde850] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UWidget*, EUIAction);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func(Widget, Action);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.ExecuteGeneralFunc
	bool ExecuteGeneralFunc(EUIAction Action) // [0x1fde7c0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(EUIAction);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func(Action);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.ExecuteActionPreviewFunc
	bool ExecuteActionPreviewFunc(EUIAction Action) // [0x1fde730] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(EUIAction);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		return func(Action);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BP_OnShow
	void BP_OnShow() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BP_OnPush
	void BP_OnPush() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BP_OnPop
	void BP_OnPop() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BP_OnHide
	void BP_OnHide() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BP_OnAnalogValueChanged
	void BP_OnAnalogValueChanged(FGeometry& InGeometry, FAnalogInputEvent& InAnalogEvent) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FGeometry&, FAnalogInputEvent&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func(InGeometry, InAnalogEvent);
	}
	// Function /Script/BBQUI.BBQUI_UserWidget.BindWidgetToCallBack
	// void BindWidgetToCallBack(UWidget* Widget, FDelegateProperty& Callback, EUIAction Action);                               // [0x1fde590] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_UserWidget.BindGeneralCallBack
	// void BindGeneralCallBack(FDelegateProperty& Callback, EUIAction Action);                                                 // [0x1fde490] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_UserWidget.BindActionPreviewCallback
	// void BindActionPreviewCallback(FDelegateProperty& Callback, EUIAction Action);                                           // [0x1fde390] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/BBQUI.BBQChatWidget
/// Size: 0x0488 (1160 bytes) (0x0003B0 - 0x000488) align 8 MaxSize: 0x0488
class UBBQChatWidget : public UBBQUI_UserWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x18];                                      // 0x03B0   (0x0018)  MISSED
	class UEditableText*                               MsgEditableText;                                            // 0x03C8   (0x0008)  
	class UScrollBox*                                  MsgScrollBox;                                               // 0x03D0   (0x0008)  
	class UBBQUI_SelectableWidget*                     ChatBtn;                                                    // 0x03D8   (0x0008)  
	unsigned char                                      UnknownData01_7[0xA8];                                      // 0x03E0   (0x00A8)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQChatWidget.ShowChatMessage
	void ShowChatMessage(FString InMessage) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(InMessage);
	}
	// Function /Script/BBQUI.BBQChatWidget.SendChatMessage
	EBBQSendTextMessageResult SendChatMessage(FString Message, EBBQChatGroup TargetGroup) // [0x1f8f3a0] Final|Native|Protected|BlueprintCallable 
	{
		typedef EBBQSendTextMessageResult (*FuncPtr)(FString, EBBQChatGroup);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(Message, TargetGroup);
	}
	// Function /Script/BBQUI.BBQChatWidget.ReceiveChatMessage
	void ReceiveChatMessage(FString Name, FString Message, EBBQChatGroup TargetGroup, EUserPlatform UserPlatform) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString, FString, EBBQChatGroup, EUserPlatform);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Name, Message, TargetGroup, UserPlatform);
	}
	// Function /Script/BBQUI.BBQChatWidget.OnTextCommitted
	// void OnTextCommitted(FText& Text, TEnumAsByte<ETextCommit> CommitMethod);                                                // [0x1f8ed20] Final|Native|Protected|HasOutParms 
	// Function /Script/BBQUI.BBQChatWidget.OnMessageSent
	void OnMessageSent(EBBQSendTextMessageResult Result) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQSendTextMessageResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(Result);
	}
	// Function /Script/BBQUI.BBQChatWidget.OnEditableTextFocused
	void OnEditableTextFocused() // [0x1f8eaa0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQUI.BBQChatWidget.OnChatButtonClicked
	void OnChatButtonClicked() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/BBQUI.BBQChatWidget.IsLocalPlayerChatBlocked
	bool IsLocalPlayerChatBlocked() // [0x1f8ea30] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
	// Function /Script/BBQUI.BBQChatWidget.HasPendingUserFocus
	bool HasPendingUserFocus() // [0x1f8ea00] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/BBQUI.BBQChatWidget.GetPartyMembersNum
	int32_t GetPartyMembersNum() // [0x1f8e8a0] Final|Native|Protected|BlueprintCallable|BlueprintPure 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQChatWidget.GetChatGroup
	EBBQChatGroup GetChatGroup() // [0x1f8e750] Native|Event|Protected|BlueprintEvent|Const 
	{
		typedef EBBQChatGroup (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/BBQUI.BBQChatWidget.BP_OnLocalPlayerChatBlockedChanged
	void BP_OnLocalPlayerChatBlockedChanged(bool bIsLocalPlayerBlocked) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(bIsLocalPlayerBlocked);
	}
};

/// Class /Script/BBQUI.BBQUI_HUD
/// Size: 0x0338 (824 bytes) (0x000318 - 0x000338) align 8 MaxSize: 0x0338
class ABBQUI_HUD : public AHUD
{ 
public:
	class UBBQScreenGroup*                             MainScreenGroup;                                            // 0x0318   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0320   (0x0008)  MISSED
	class UBBQUI_GameHUDWidget*                        GameHUDWidget;                                              // 0x0328   (0x0008)  
	class UBBQUI_Screen*                               GameHUDScreen;                                              // 0x0330   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_HUD.TryPopTopItem
	bool TryPopTopItem(UBBQScreenStackItem* Item) // [0x1faaed0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Item);
	}
	// Function /Script/BBQUI.BBQUI_HUD.SetVisibleGroup
	void SetVisibleGroup(EBBQHUDVisibleGroup VisibleGroup) // [0x1faad80] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EBBQHUDVisibleGroup);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(VisibleGroup);
	}
	// Function /Script/BBQUI.BBQUI_HUD.SetHideHUD
	void SetHideHUD(bool bHide) // [0x1faabd0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(bHide);
	}
	// Function /Script/BBQUI.BBQUI_HUD.PushItem
	// bool PushItem(UBBQScreenStackItem* Item, TEnumAsByte<EPushMode> PushMode);                                               // [0x1faa870] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_HUD.PopUntillItem
	bool PopUntillItem(UBBQScreenStackItem* Item, bool bPopTargetScreen) // [0x1faa7a0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(Item, bPopTargetScreen);
	}
	// Function /Script/BBQUI.BBQUI_HUD.PopTopItems
	void PopTopItems(int32_t ItemsCount) // [0x1faa710] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(ItemsCount);
	}
	// Function /Script/BBQUI.BBQUI_HUD.PopTopItem
	bool PopTopItem() // [0x1faa6e0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_HUD.PopAll
	void PopAll() // [0x1faa6c0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_HUD.IsHidden
	bool IsHidden() // [0x1faa100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_HUD.GetTopItem
	UBBQScreenStackItem* GetTopItem() // [0x1faa0d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQScreenStackItem* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_HUD.GetItemCount
	int32_t GetItemCount() // [0x1faa070] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
};

/// Class /Script/BBQUI.BBQGameHUD
/// Size: 0x0378 (888 bytes) (0x000338 - 0x000378) align 8 MaxSize: 0x0378
class ABBQGameHUD : public ABBQUI_HUD
{ 
public:
	class UBBQUI_Screen*                               PlayersList;                                                // 0x0338   (0x0008)  
	class UBBQUI_Screen*                               ReportMenu;                                                 // 0x0340   (0x0008)  
	unsigned char                                      UnknownData00_7[0x30];                                      // 0x0348   (0x0030)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQGameHUD.UpdateScreensShown
	void UpdateScreensShown(ETeamID TeamId) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ETeamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(TeamId);
	}
	// Function /Script/BBQUI.BBQGameHUD.UpdatePlayerCount
	void UpdatePlayerCount(int32_t VictimCount, int32_t FamilyCount) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(VictimCount, FamilyCount);
	}
	// Function /Script/BBQUI.BBQGameHUD.UpdateInputPromptVisibility
	void UpdateInputPromptVisibility(FBBQUI_InputPromptData& PromptData, bool bSetVisible) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQUI_InputPromptData&, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(PromptData, bSetVisible);
	}
	// Function /Script/BBQUI.BBQGameHUD.UpdateHoldProgress
	void UpdateHoldProgress(float Percent) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Percent);
	}
	// Function /Script/BBQUI.BBQGameHUD.UpdateChatMessages
	void UpdateChatMessages(FString SenderName, FString Message, bool bMessageAll) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString, FString, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(SenderName, Message, bMessageAll);
	}
	// Function /Script/BBQUI.BBQGameHUD.ToggleDebugWidget
	void ToggleDebugWidget() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowSpectatorModeWidget
	void ShowSpectatorModeWidget(bool bIsInSpectatorMode, bool bIsFirstSpectate) // [0x1f8f490] Native|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(bIsInSpectatorMode, bIsFirstSpectate);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowMercuryCarHidingSpotWidget
	void ShowMercuryCarHidingSpotWidget(ABBQMercuryCarHidingSpot* InHidingSpot) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQMercuryCarHidingSpot*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(InHidingSpot);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowInputPrompt
	void ShowInputPrompt(FBBQUI_InputPromptData& PromptData) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQUI_InputPromptData&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(PromptData);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowHidingSpotWidget
	void ShowHidingSpotWidget(ABBQHidingSpot* InHidingSpot) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQHidingSpot*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(InHidingSpot);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowGameplayActivityEvent
	void ShowGameplayActivityEvent(FBBQGameplayActivityEvent& ActivityEvent, FBBQNotificationData& CustomNotificationData) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQGameplayActivityEvent&, FBBQNotificationData&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(ActivityEvent, CustomNotificationData);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowBondUpdateNotificationParam
	void ShowBondUpdateNotificationParam(FBBQFamilyBondActivity& InFamilyBondActivity, float FamilyBondLevelChange) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQFamilyBondActivity&, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(InFamilyBondActivity, FamilyBondLevelChange);
	}
	// Function /Script/BBQUI.BBQGameHUD.ShowBBQChatWidget
	void ShowBBQChatWidget(bool bMessageAll) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(bMessageAll);
	}
	// Function /Script/BBQUI.BBQGameHUD.SetScreenBlurStrength
	void SetScreenBlurStrength(float ALPHA) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(ALPHA);
	}
	// Function /Script/BBQUI.BBQGameHUD.SetInteractionVisuals
	void SetInteractionVisuals(FInteractionVisualParams& Params) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FInteractionVisualParams&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(Params);
	}
	// Function /Script/BBQUI.BBQGameHUD.SetCheatManagerWidget
	void SetCheatManagerWidget(bool bIsVisible) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(bIsVisible);
	}
	// Function /Script/BBQUI.BBQGameHUD.RemoveInventoryWidget
	void RemoveInventoryWidget() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.RefreshScoreboard
	void RefreshScoreboard() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.RefreshHUDArea
	void RefreshHUDArea(EHUDArea HUDAreaToRefresh) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EHUDArea);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func(HUDAreaToRefresh);
	}
	// Function /Script/BBQUI.BBQGameHUD.ReceiveChatMessage
	void ReceiveChatMessage(FString SenderName, FString Message, bool bMessageAll) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString, FString, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func(SenderName, Message, bMessageAll);
	}
	// Function /Script/BBQUI.BBQGameHUD.PushReportMenu
	bool PushReportMenu(bool IsNormalPush) // [0x1f8f1c0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func(IsNormalPush);
	}
	// Function /Script/BBQUI.BBQGameHUD.PushPlayerList
	bool PushPlayerList(bool IsNormalPush) // [0x1f8f120] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		return func(IsNormalPush);
	}
	// Function /Script/BBQUI.BBQGameHUD.PushLobbyScreen
	void PushLobbyScreen() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.PopReportMenu
	bool PopReportMenu() // [0x1f8ee90] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func();
	}
	// Function /Script/BBQUI.BBQGameHUD.PopPlayerList
	bool PopPlayerList() // [0x1f8ee60] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		return func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnToggleStatsWidget
	void OnToggleStatsWidget(bool bIsChecked) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func(bIsChecked);
	}
	// Function /Script/BBQUI.BBQGameHUD.OnToggleResultScreenVisibility
	void OnToggleResultScreenVisibility() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnShowStunTimeMessage
	void OnShowStunTimeMessage(float InDuration) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func(InDuration);
	}
	// Function /Script/BBQUI.BBQGameHUD.OnShowQuitScreen
	void OnShowQuitScreen() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnShowNotEnoughFamilyBondMessage
	void OnShowNotEnoughFamilyBondMessage() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnPostMatchSummamry
	void OnPostMatchSummamry() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnPlayerAdded
	void OnPlayerAdded(APlayerState* PlayerState, ETeamID TeamId) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerState*, ETeamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func(PlayerState, TeamId);
	}
	// Function /Script/BBQUI.BBQGameHUD.OnPauseKeyPressed
	void OnPauseKeyPressed() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.OnFamilyMottoPerkStateUpdate
	void OnFamilyMottoPerkStateUpdate(int32_t MottoIndex, bool bActivated) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func(MottoIndex, bActivated);
	}
	// Function /Script/BBQUI.BBQGameHUD.OnBBQPlayerStateChange
	void OnBBQPlayerStateChange(ABBQPlayerState* PState) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQPlayerState*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func(PState);
	}
	// Function /Script/BBQUI.BBQGameHUD.OnBBQMatchStarted
	void OnBBQMatchStarted() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.InitializeInventoryWidget
	// void InitializeInventoryWidget(TArray<FBBQInventoryItem>& InventoryItems);                                               // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/BBQUI.BBQGameHUD.HideSpectatorModeWidget
	void HideSpectatorModeWidget() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		func();
	}
	// Function /Script/BBQUI.BBQGameHUD.HideInputPrompt
	void HideInputPrompt(FBBQUI_InputPromptData& PromptData) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQUI_InputPromptData&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		func(PromptData);
	}
	// Function /Script/BBQUI.BBQGameHUD.FadeScreenBlur
	void FadeScreenBlur(bool bFadeOut) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		func(bFadeOut);
	}
};

/// Class /Script/BBQUI.BBQLoadoutWidget
/// Size: 0x03B0 (944 bytes) (0x0003B0 - 0x0003B0) align 8 MaxSize: 0x03B0
class UBBQLoadoutWidget : public UBBQUI_UserWidget
{ 
public:
};

/// Class /Script/BBQUI.BBQUI_MenuBase
/// Size: 0x03C8 (968 bytes) (0x0003B0 - 0x0003C8) align 8 MaxSize: 0x03C8
class UBBQUI_MenuBase : public UBBQUI_UserWidget
{ 
public:
	bool                                               bUseThumbStickForNavEvents;                                 // 0x03B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x03B1   (0x0003)  MISSED
	float                                              TimeLimitBetweenFiringHeldNavigationInputs;                 // 0x03B4   (0x0004)  
	unsigned char                                      UnknownData01_7[0x10];                                      // 0x03B8   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_MenuBase.OnRemoveLoadingScreenComplete
	void OnRemoveLoadingScreenComplete() // [0xd68f40] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_MenuBase.OnPopUpClosed
	void OnPopUpClosed() // [0x1f97a00] Native|Public        
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_TopBarMenuScreen
/// Size: 0x03D0 (976 bytes) (0x0003C8 - 0x0003D0) align 8 MaxSize: 0x03D0
class UBBQUI_TopBarMenuScreen : public UBBQUI_MenuBase
{ 
public:
	class UBBQUI_TopBarMenu*                           TopBarMenu;                                                 // 0x03C8   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_TopBarMenuScreen.SetMenuColors
	void SetMenuColors(FDataTableRowHandle& NewColor, FDataTableRowHandle& NewAdditionalColor) // [0x1fd0190] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FDataTableRowHandle&, FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewColor, NewAdditionalColor);
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuScreen.OpenTab
	void OpenTab(int32_t TabIndex, bool bForce) // [0x1fcfcb0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(TabIndex, bForce);
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuScreen.OpenPrevTab
	void OpenPrevTab() // [0x1fcfb60] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuScreen.OpenNextTab
	void OpenNextTab() // [0x1fcfb40] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuScreen.OnTopBarMenuTabChanged
	void OnTopBarMenuTabChanged(int32_t TabIndex) // [0x1fcf940] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(TabIndex);
	}
};

/// Class /Script/BBQUI.BBQLobbyWidget
/// Size: 0x0DD0 (3536 bytes) (0x0003D0 - 0x000DD0) align 8 MaxSize: 0x0DD0
class UBBQLobbyWidget : public UBBQUI_TopBarMenuScreen
{ 
public:
	int32_t                                            TimeElapsedSinceAllPlayersReady;                            // 0x03D0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x03D4   (0x0004)  MISSED
	TMap<FString, class UClass*>                       AvailableGameModes;                                         // 0x03D8   (0x0050)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0428   (0x0008)  
	class UBBQChatWidget*                              ChatWidget;                                                 // 0x0430   (0x0008)  
	class URichTextBlock*                              PlayersCountText;                                           // 0x0438   (0x0008)  
	class UTextBlock*                                  TimerTextNextMatch;                                         // 0x0440   (0x0008)  
	class UTextBlock*                                  TimerTextFindingPlayers;                                    // 0x0448   (0x0008)  
	class UTextBlock*                                  NextMatchTimeText;                                          // 0x0450   (0x0008)  
	class UProgressBar*                                NextMatchProgressBar;                                       // 0x0458   (0x0008)  
	class UWidget*                                     NextMatchPanel;                                             // 0x0460   (0x0008)  
	class UWidget*                                     TimerBarCorner;                                             // 0x0468   (0x0008)  
	class UBBQUICharacterPreviewWidget*                CharacterPreview;                                           // 0x0470   (0x0008)  
	class UBBQUI_LobbyLoadoutTab*                      LoadoutTab;                                                 // 0x0478   (0x0008)  
	class UBBQUI_LobbyUnlockTreeTab*                   UnlockTreeTab;                                              // 0x0480   (0x0008)  
	class UBBQUI_LobbyTeamsTab*                        TeamsTab;                                                   // 0x0488   (0x0008)  
	class UWidget*                                     DemoBanner;                                                 // 0x0490   (0x0008)  
	class UBBQUI_CharacterSelection*                   CharactersTab;                                              // 0x0498   (0x0008)  
	class UBBQUI_CharacterCosmetics*                   CosmeticsTab;                                               // 0x04A0   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      ReadyBtn;                                                   // 0x04A8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      UnreadyBtn;                                                 // 0x04B0   (0x0008)  
	class UWidget*                                     GamerDetail;                                                // 0x04B8   (0x0008)  
	FBBQPopUpSpec                                      ExitPopUpSpec;                                              // 0x04C0   (0x00E0)  
	FBBQPopUpSpec                                      ExitAsPartyHostPopUpSpec;                                   // 0x05A0   (0x00E0)  
	FBBQPopUpSpec                                      ExitAsPartyMemberPopUpSpec;                                 // 0x0680   (0x00E0)  
	FText                                              PlayersCountTextFormat;                                     // 0x0760   (0x0018)  
	class UAkAudioEvent*                               LobbyEnterAKEvent;                                          // 0x0778   (0x0008)  
	class UAkAudioEvent*                               LobbyLeaveAKEvent;                                          // 0x0780   (0x0008)  
	class UAkAudioEvent*                               PlayerJoinedAKEvent;                                        // 0x0788   (0x0008)  
	class UAkAudioEvent*                               PlayerLeftAKEvent;                                          // 0x0790   (0x0008)  
	TWeakObjectPtr<class UAkAudioEvent*>               TimerTickerAKEvent;                                         // 0x0798   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x07A0   (0x0020)  MISSED
	class UWidgetAnimation*                            TimeRunningOutAnim;                                         // 0x07C0   (0x0008)  
	class UWidgetAnimation*                            TimerTextFindingPlayersAnim;                                // 0x07C8   (0x0008)  
	float                                              TimeRunningOutAnimStartTime;                                // 0x07D0   (0x0004)  
	float                                              bShouldTimeRunningOutAnimLoop;                              // 0x07D4   (0x0004)  
	FName                                              UnlockTreeFullScreenNameIdentifier;                         // 0x07D8   (0x0008)  
	FName                                              AbilityTreeScreenNameIdentifier;                            // 0x07E0   (0x0008)  
	FName                                              OptionsMenuStackIdentifier;                                 // 0x07E8   (0x0008)  
	FName                                              LobbyOptionsMenuIdentifier;                                 // 0x07F0   (0x0008)  
	FName                                              MapSelectionMenuIdentifier;                                 // 0x07F8   (0x0008)  
	FName                                              LobbyControlsScreenIdentifier;                              // 0x0800   (0x0008)  
	FName                                              GammaBrightnessScreenIdentifier;                            // 0x0808   (0x0008)  
	class UWidget*                                     DebugServerInfoContainer;                                   // 0x0810   (0x0008)  
	class UTextBlock*                                  DebugServerNameTextBlock;                                   // 0x0818   (0x0008)  
	class UTextBlock*                                  DebugServerAddressTextBlock;                                // 0x0820   (0x0008)  
	FDataTableRowHandle                                TopBarColour;                                               // 0x0828   (0x0010)  
	FDataTableRowHandle                                TopBarAdditonalColour;                                      // 0x0838   (0x0010)  
	float                                              CharSwapCooldown;                                           // 0x0848   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x084C   (0x0004)  MISSED
	FBBQPopUpSpec                                      CharSwapRequestPopUp;                                       // 0x0850   (0x00E0)  
	FBBQPopUpSpec                                      CharSwapRequestPendingPopUp;                                // 0x0930   (0x00E0)  
	FBBQPopUpSpec                                      CharSwapRequestAlreadyReceivedPopUp;                        // 0x0A10   (0x00E0)  
	FBBQPopUpSpec                                      CharSwapRequestAntiSpamPopUp;                               // 0x0AF0   (0x00E0)  
	FBBQPopUpSpec                                      CharSwapRequesteeDisconnected;                              // 0x0BD0   (0x00E0)  
	FBBQPopUpSpec                                      CharSwapMissingDLC;                                         // 0x0CB0   (0x00E0)  
	unsigned char                                      UnknownData03_6[0x18];                                      // 0x0D90   (0x0018)  MISSED
	class UBBQCharacterOutfit*                         MercuryModeJohnnyOutfit;                                    // 0x0DA8   (0x0008)  
	unsigned char                                      UnknownData04_7[0x20];                                      // 0x0DB0   (0x0020)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQLobbyWidget.RefreshPlayersCount
	void RefreshPlayersCount() // [0x1f8f380] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.QuitToMainMenuDueBlockedPlayer
	void QuitToMainMenuDueBlockedPlayer(APlayerController* PlayerController) // [0x1f8f2f0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(PlayerController);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.QuitToMainMenu
	void QuitToMainMenu(APlayerController* PlayerController) // [0x1f8f260] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(PlayerController);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnTabChanged
	void OnTabChanged(int32_t NewWidgetIndex) // [0x1f8ec90] Final|Native|Private 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(NewWidgetIndex);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnPlayerStateChanged
	void OnPlayerStateChanged(ABBQPlayerState* PS) // [0x1f8ec00] Final|Native|Private 
	{
		typedef void (*FuncPtr)(ABBQPlayerState*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(PS);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnPlayersCountChanged_BP
	void OnPlayersCountChanged_BP(int32_t PlayersNum) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(PlayersNum);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnMatchMakingRuleSkipped_BP
	void OnMatchMakingRuleSkipped_BP(EMMTeamID TeamId) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EMMTeamID);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(TeamId);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnLobbyPointOfNoReturnFadeToBlackComplete
	void OnLobbyPointOfNoReturnFadeToBlackComplete() // [0x1f8ebe0] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.OnCountdownComplete
	void OnCountdownComplete() // [0x1f8ea80] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.IsServerLobby
	bool IsServerLobby() // [0x1f8ea60] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetUnlockTreeTab
	UBBQUI_LobbyUnlockTreeTab* GetUnlockTreeTab() // [0x1f8e9e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_LobbyUnlockTreeTab* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetPlayerPlayFabIdString
	FString GetPlayerPlayFabIdString(APlayerState* PlayerState) // [0x1f8e8d0] Final|Native|Public|BlueprintCallable 
	{
		typedef FString (*FuncPtr)(APlayerState*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func(PlayerState);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetMatchMakingQueueStatistics
	void GetMatchMakingQueueStatistics(FString QueueName) // [0x1e13820] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(QueueName);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetLobbyTabAtSwitcherIndex
	UBBQUI_LobbyTab* GetLobbyTabAtSwitcherIndex(int32_t Index) // [0x1f8e800] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_LobbyTab* (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func(Index);
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetLoadoutTab
	UBBQUI_LobbyLoadoutTab* GetLoadoutTab() // [0x1f8e7e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_LobbyLoadoutTab* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		return func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.GetActiveLobbyTabWidget
	UBBQUI_LobbyTab* GetActiveLobbyTabWidget() // [0x1f8e720] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_LobbyTab* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		return func();
	}
	// Function /Script/BBQUI.BBQLobbyWidget.FocusChat
	void FocusChat() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
};

/// Class /Script/BBQUI.BBQMenuBackground
/// Size: 0x0228 (552 bytes) (0x000228 - 0x000228) align 8 MaxSize: 0x0228
class ABBQMenuBackground : public AActor
{ 
public:
};

/// Class /Script/BBQUI.BBQMetaGameHUD
/// Size: 0x0338 (824 bytes) (0x000338 - 0x000338) align 8 MaxSize: 0x0338
class ABBQMetaGameHUD : public ABBQUI_HUD
{ 
public:


	/// Functions
	// Function /Script/BBQUI.BBQMetaGameHUD.ShowBBQChatWidget
	void ShowBBQChatWidget() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQMetaGameHUD.ReturnToStartScreen
	void ReturnToStartScreen() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQMetaGameHUD.ReceiveChatMessage
	void ReceiveChatMessage(FString Message) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Message);
	}
};

/// Class /Script/BBQUI.BBQScreenStackItem
/// Size: 0x0260 (608 bytes) (0x0001F8 - 0x000260) align 16 MaxSize: 0x0258
class UBBQScreenStackItem : public USceneComponent
{ 
public:
	unsigned char                                      UnknownData00_8[0x30];                                      // 0x01F8   (0x0030)  MISSED
	FName                                              Name;                                                       // 0x0228   (0x0008)  
	EBBQHUDFocusRegainPriority                         FocusRegainPriority;                                        // 0x0230   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0231   (0x0007)  MISSED
	class ABBQScreenStack*                             ParentStack;                                                // 0x0238   (0x0008)  
	class APlayerController*                           FocusedPlayerController;                                    // 0x0240   (0x0008)  
	unsigned char                                      UnknownData02_7[0x10];                                      // 0x0248   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQScreenStackItem.SetMaxLayersCount
	void SetMaxLayersCount(int32_t NewValue) // [0x1f93f10] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewValue);
	}
	// Function /Script/BBQUI.BBQScreenStackItem.IsShown
	bool IsShown() // [0x1f92ff0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.IsOnStack
	bool IsOnStack() // [0x1f92f60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.IsLayeredOnTop
	bool IsLayeredOnTop() // [0x1f92f30] Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.IsFocused
	bool IsFocused() // [0x1f92f00] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.GetTopScreenOnItem
	UBBQUI_Screen* GetTopScreenOnItem() // [0x1f92e70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_Screen* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.GetStackItemName
	FName GetStackItemName() // [0x1f92d80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef FName (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStackItem.GetMaxLayersCount
	int32_t GetMaxLayersCount() // [0x1f92d20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
};

/// Class /Script/BBQUI.BBQScreenGroup
/// Size: 0x0290 (656 bytes) (0x000258 - 0x000290) align 16 MaxSize: 0x0290
class UBBQScreenGroup : public UBBQScreenStackItem
{ 
public:
	SDK_UNDEFINED(16,557) /* FMulticastInlineDelegate */ __um(OnItemPushed);                                       // 0x0258   (0x0010)  
	SDK_UNDEFINED(16,558) /* FMulticastInlineDelegate */ __um(OnItemPopped);                                       // 0x0268   (0x0010)  
	class ABBQScreenStack*                             ScreenStack;                                                // 0x0278   (0x0008)  
	class UClass*                                      StackClass;                                                 // 0x0280   (0x0008)  
	class UClass*                                      MercuryStackClassOverride;                                  // 0x0288   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQScreenGroup.TryPopTopItem
	bool TryPopTopItem(UBBQScreenStackItem* Item) // [0x1f8f570] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Item);
	}
	// Function /Script/BBQUI.BBQScreenGroup.PushItem
	// bool PushItem(UBBQScreenStackItem* Item, TEnumAsByte<EPushMode> PushMode);                                               // [0x1f8f050] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQScreenGroup.PopUntilItem
	bool PopUntilItem(UBBQScreenStackItem* Item, bool bPopTargetItem) // [0x1f8ef80] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(Item, bPopTargetItem);
	}
	// Function /Script/BBQUI.BBQScreenGroup.PopTopItems
	void PopTopItems(int32_t ItemCount) // [0x1f8eef0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(ItemCount);
	}
	// Function /Script/BBQUI.BBQScreenGroup.PopTopItem
	bool PopTopItem() // [0x1f8eec0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenGroup.PopAll
	void PopAll() // [0x1f8ee40] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQUI.BBQScreenGroup.OnItemPushedCallback
	void OnItemPushedCallback(UBBQScreenStackItem* Item) // [0x1f8eb50] Final|Native|Private 
	{
		typedef void (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(Item);
	}
	// Function /Script/BBQUI.BBQScreenGroup.OnItemPoppedCallback
	void OnItemPoppedCallback(UBBQScreenStackItem* Item) // [0x1f8eac0] Final|Native|Private 
	{
		typedef void (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Item);
	}
	// Function /Script/BBQUI.BBQScreenGroup.GetTopItem
	UBBQScreenStackItem* GetTopItem() // [0x1f8e9b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQScreenStackItem* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenGroup.GetItemStack
	ABBQScreenStack* GetItemStack() // [0x1f8e7b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class ABBQScreenStack* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenGroup.GetItemCount
	int32_t GetItemCount() // [0x1f8e780] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
};

/// Class /Script/BBQUI.BBQScreenStack
/// Size: 0x0360 (864 bytes) (0x000228 - 0x000360) align 8 MaxSize: 0x0360
class ABBQScreenStack : public AActor
{ 
public:
	unsigned char                                      UnknownData00_8[0x48];                                      // 0x0228   (0x0048)  MISSED
	SDK_UNDEFINED(16,559) /* FMulticastInlineDelegate */ __um(OnItemPushed);                                       // 0x0270   (0x0010)  
	SDK_UNDEFINED(16,560) /* FMulticastInlineDelegate */ __um(OnItemPopped);                                       // 0x0280   (0x0010)  
	class ABBQScreenStack*                             ParentStack;                                                // 0x0290   (0x0008)  
	TArray<FScreenStackEntry>                          Stack;                                                      // 0x0298   (0x0010)  
	bool                                               bAutoPopStack;                                              // 0x02A8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x02A9   (0x0007)  MISSED
	class UClass*                                      DefaultBackgroundActor;                                     // 0x02B0   (0x0008)  
	class ALevelSequenceActor*                         TransitionSequenceActor;                                    // 0x02B8   (0x0008)  
	TMap<class UClass*, class AActor*>                 BackgroundActorsMap;                                        // 0x02C0   (0x0050)  
	class AActor*                                      ActiveBackgroundActor;                                      // 0x0310   (0x0008)  
	class UMediaSoundComponent*                        MediaSoundComponent;                                        // 0x0318   (0x0008)  
	unsigned char                                      UnknownData02_7[0x40];                                      // 0x0320   (0x0040)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQScreenStack.TryPopTopItemByName
	bool TryPopTopItemByName(FName Name) // [0x1f94110] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Name);
	}
	// Function /Script/BBQUI.BBQScreenStack.TryPopTopItem
	bool TryPopTopItem(UBBQScreenStackItem* Item) // [0x1f94070] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(Item);
	}
	// Function /Script/BBQUI.BBQScreenStack.SetScreenOpacity
	void SetScreenOpacity(UBBQScreenStackItem* ScreenItem, float InOpacity) // [0x1f93fa0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UBBQScreenStackItem*, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(ScreenItem, InOpacity);
	}
	// Function /Script/BBQUI.BBQScreenStack.ResetWidgetKeyboardFocus
	void ResetWidgetKeyboardFocus() // [0x1f93ef0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQScreenStack.PushItemWithTransition
	bool PushItemWithTransition(FDataTableRowHandle& TransitionData) // [0x1f93e40] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(TransitionData);
	}
	// Function /Script/BBQUI.BBQScreenStack.PushItemWithBackground
	bool PushItemWithBackground(UBBQScreenStackItem* Item, UClass* BackgroundClass) // [0x1f93d70] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*, UClass*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(Item, BackgroundClass);
	}
	// Function /Script/BBQUI.BBQScreenStack.PushItemByNameWithBackground
	bool PushItemByNameWithBackground(FName Name, UClass* BackgroundClass) // [0x1f93ca0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FName, UClass*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(Name, BackgroundClass);
	}
	// Function /Script/BBQUI.BBQScreenStack.PushItemByName
	// bool PushItemByName(FName Name, TEnumAsByte<EPushMode> PushMode, UClass* BackgroundClass);                               // [0x1f93b90] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQScreenStack.PushItem
	// bool PushItem(UBBQScreenStackItem* Item, TEnumAsByte<EPushMode> PushMode, UClass* BackgroundClass);                      // [0x1f93a80] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQScreenStack.PopUntilItemByName
	bool PopUntilItemByName(FName Name, bool bPopTargetItem) // [0x1f939b0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FName, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(Name, bPopTargetItem);
	}
	// Function /Script/BBQUI.BBQScreenStack.PopUntilItem
	bool PopUntilItem(UBBQScreenStackItem* Item, bool bPopTargetItem) // [0x1f938e0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(UBBQScreenStackItem*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func(Item, bPopTargetItem);
	}
	// Function /Script/BBQUI.BBQScreenStack.PopTopItems
	void PopTopItems(int32_t ItemCount) // [0x1f93850] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(ItemCount);
	}
	// Function /Script/BBQUI.BBQScreenStack.PopTopItem
	bool PopTopItem() // [0x1f93820] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.PopItemWithTransition
	bool PopItemWithTransition(FDataTableRowHandle& TransitionData) // [0x1f93770] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func(TransitionData);
	}
	// Function /Script/BBQUI.BBQScreenStack.PopAll
	void PopAll() // [0x1f93750] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Script/BBQUI.BBQScreenStack.OnMaxLayersCountChangedCallback
	void OnMaxLayersCountChangedCallback(UBBQScreenStackItem* Item, int32_t NewValue) // [0x1f93360] Final|Native|Private 
	{
		typedef void (*FuncPtr)(UBBQScreenStackItem*, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(Item, NewValue);
	}
	// Function /Script/BBQUI.BBQScreenStack.OnLayerOnTopChangedCallback
	void OnLayerOnTopChangedCallback(UBBQScreenStackItem* Item, bool bNewValue) // [0x1f931c0] Final|Native|Private 
	{
		typedef void (*FuncPtr)(UBBQScreenStackItem*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func(Item, bNewValue);
	}
	// Function /Script/BBQUI.BBQScreenStack.IsShown
	bool IsShown() // [0x1f92fc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.IsScreenTransitionInProgress
	bool IsScreenTransitionInProgress() // [0x1f92f90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.IsFocused
	bool IsFocused() // [0x1f92ed0] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.IsAnyWidgetKeyboardFocused
	bool IsAnyWidgetKeyboardFocused() // [0x1f92ea0] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.GetTopLayeredItems
	// TArray<FScreenStackEntry> GetTopLayeredItems();                                                                          // [0x1f92df0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/BBQUI.BBQScreenStack.GetTopItem
	UBBQScreenStackItem* GetTopItem() // [0x1f92dc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQScreenStackItem* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.GetMediaSoundComponent
	UMediaSoundComponent* GetMediaSoundComponent() // [0x1f92d50] Final|Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef class UMediaSoundComponent* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.GetItemIndex
	int32_t GetItemIndex(UBBQScreenStackItem* Item) // [0x1f92c80] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	{
		typedef int32_t (*FuncPtr)(UBBQScreenStackItem*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		return func(Item);
	}
	// Function /Script/BBQUI.BBQScreenStack.GetItemCount
	int32_t GetItemCount() // [0x1f92c50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef int32_t (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.GetFocusedPlayerController
	APlayerController* GetFocusedPlayerController() // [0xc70160] Final|Native|Public|BlueprintCallable 
	{
		typedef class APlayerController* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		return func();
	}
	// Function /Script/BBQUI.BBQScreenStack.BP_OnPush
	void BP_OnPush() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Script/BBQUI.BBQScreenStack.BP_OnPop
	void BP_OnPop() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_AbilityTree
/// Size: 0x0B58 (2904 bytes) (0x000260 - 0x000B58) align 8 MaxSize: 0x0B58
class UBBQUI_AbilityTree : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x30];                                      // 0x0260   (0x0030)  MISSED
	class UBBQUI_TextBlock*                            MainTitleText;                                              // 0x0290   (0x0008)  
	class UBBQUI_AbilityTreeItemInfoPanel*             InfoPanel;                                                  // 0x0298   (0x0008)  
	class UCanvasPanel*                                Connectors;                                                 // 0x02A0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorBaseLevel1Left;                                    // 0x02A8   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorBaseLevel1Mid;                                     // 0x02B0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorBaseLevel1Right;                                   // 0x02B8   (0x0008)  
	class UCanvasPanel*                                ConnectorsBaseToLevel1;                                     // 0x02C0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1LeftLevel2Left;                              // 0x02C8   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1LeftLevel2Mid;                               // 0x02D0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1MidLevel2Left;                               // 0x02D8   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1MidLevel2Mid;                                // 0x02E0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1MidLevel2Right;                              // 0x02E8   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1RightLevel2Mid;                              // 0x02F0   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel1RightLevel2Right;                            // 0x02F8   (0x0008)  
	class UCanvasPanel*                                ConnectorsLevel1ToLevel2;                                   // 0x0300   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2LeftLevel3Left;                              // 0x0308   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2LeftLevel3Mid;                               // 0x0310   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2MidLevel3Left;                               // 0x0318   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2MidLevel3Mid;                                // 0x0320   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2MidLevel3Right;                              // 0x0328   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2RightLevel3Mid;                              // 0x0330   (0x0008)  
	class UBBQUI_AbilityTreeConnector*                 ConnectorLevel2RightLevel3Right;                            // 0x0338   (0x0008)  
	class UCanvasPanel*                                ConnectorsLevel2ToLevel3;                                   // 0x0340   (0x0008)  
	class UVerticalBox*                                LevelIndicators;                                            // 0x0348   (0x0008)  
	class UBBQUI_AbilityTreeLevelIndicator*            IndicatorBase;                                              // 0x0350   (0x0008)  
	class UBBQUI_AbilityTreeLevelIndicator*            IndicatorLevel1;                                            // 0x0358   (0x0008)  
	class UBBQUI_AbilityTreeLevelIndicator*            IndicatorLevel2;                                            // 0x0360   (0x0008)  
	class UBBQUI_AbilityTreeLevelIndicator*            IndicatorLevel3;                                            // 0x0368   (0x0008)  
	class UCanvasPanel*                                Buttons;                                                    // 0x0370   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonBase;                                        // 0x0378   (0x0008)  
	class UCanvasPanel*                                ButtonsLevel1;                                              // 0x0380   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel1Left;                                  // 0x0388   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel1Mid;                                   // 0x0390   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel1Right;                                 // 0x0398   (0x0008)  
	class UCanvasPanel*                                ButtonsLevel2;                                              // 0x03A0   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel2Left;                                  // 0x03A8   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel2Mid;                                   // 0x03B0   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel2Right;                                 // 0x03B8   (0x0008)  
	class UCanvasPanel*                                ButtonsLevel3;                                              // 0x03C0   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel3Left;                                  // 0x03C8   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel3Mid;                                   // 0x03D0   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    SelectionButtonLevel3Right;                                 // 0x03D8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      SelectBtn;                                                  // 0x03E0   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      ResetBtn;                                                   // 0x03E8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      BackBtn;                                                    // 0x03F0   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    CurrentlySelectedButton;                                    // 0x03F8   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    ChosenButtonToAquireModifier;                               // 0x0400   (0x0008)  
	class UBBQUI_CharacterAugmentData*                 CompleteCharacterAugmentData;                               // 0x0408   (0x0008)  
	FString                                            DefaultRichTextFormat;                                      // 0x0410   (0x0010)  
	FString                                            HoveredRichTextFormat;                                      // 0x0420   (0x0010)  
	FString                                            AcquiredRichTextFormat;                                     // 0x0430   (0x0010)  
	FName                                              FormatArgumentLevel1;                                       // 0x0440   (0x0008)  
	FName                                              FormatArgumentLevel2;                                       // 0x0448   (0x0008)  
	FName                                              FormatArgumentLevel3;                                       // 0x0450   (0x0008)  
	FBBQPopUpSpec                                      AcquirePopUpSpec;                                           // 0x0458   (0x00E0)  
	FBBQPopUpSpec                                      LockedPopUpSpec;                                            // 0x0538   (0x00E0)  
	FBBQPopUpSpec                                      UnavailableLowLevelPopUpSpec;                               // 0x0618   (0x00E0)  
	FBBQPopUpSpec                                      UnavailablePopUpSpec;                                       // 0x06F8   (0x00E0)  
	FBBQPopUpSpec                                      ResetTreePopUpSpec;                                         // 0x07D8   (0x00E0)  
	FBBQPopUpSpec                                      ResettingTreePopUpSpec;                                     // 0x08B8   (0x00E0)  
	FBBQPopUpSpec                                      ResetTreeFailedPopUpSpec;                                   // 0x0998   (0x00E0)  
	TWeakObjectPtr<class UAkAudioEvent*>               OnAcceptSound;                                              // 0x0A78   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0A80   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnAbilityTreeResetSound;                                    // 0x0AA0   (0x0008)  
	unsigned char                                      UnknownData02_6[0x20];                                      // 0x0AA8   (0x0020)  MISSED
	FText                                              NoModifierText;                                             // 0x0AC8   (0x0018)  
	unsigned char                                      UnknownData03_7[0x78];                                      // 0x0AE0   (0x0078)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_AbilityTree.OnPopUpClosed
	void OnPopUpClosed() // [0x1f93590] Final|Native|Protected 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_SelectableWidget
/// Size: 0x03E8 (1000 bytes) (0x000260 - 0x0003E8) align 8 MaxSize: 0x03E8
class UBBQUI_SelectableWidget : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x90];                                      // 0x0260   (0x0090)  MISSED
	SDK_UNDEFINED(16,561) /* FMulticastInlineDelegate */ __um(OnConfirmedBPEvent);                                 // 0x02F0   (0x0010)  
	class UWidgetAnimation*                            SelectAnim;                                                 // 0x0300   (0x0008)  
	class UWidgetAnimation*                            MouseHoverAnim;                                             // 0x0308   (0x0008)  
	bool                                               bSelectOnMouseHover;                                        // 0x0310   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0311   (0x0007)  MISSED
	FText                                              LabelText;                                                  // 0x0318   (0x0018)  
	FText                                              Description;                                                // 0x0330   (0x0018)  
	bool                                               bOverrideTextSettings;                                      // 0x0348   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0349   (0x0003)  MISSED
	float                                              LineHeightPercentage;                                       // 0x034C   (0x0004)  
	int32_t                                            FontSize;                                                   // 0x0350   (0x0004)  
	float                                              TextPositionY;                                              // 0x0354   (0x0004)  
	ETextTransformPolicy                               LabelTextTransformPolicy;                                   // 0x0358   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0359   (0x0007)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               MouseHoverSound;                                            // 0x0360   (0x0008)  
	unsigned char                                      UnknownData04_6[0x20];                                      // 0x0368   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               SelectionSound;                                             // 0x0388   (0x0008)  
	unsigned char                                      UnknownData05_6[0x20];                                      // 0x0390   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnMouseUpSound;                                             // 0x03B0   (0x0008)  
	unsigned char                                      UnknownData06_6[0x20];                                      // 0x03B8   (0x0020)  MISSED
	class UTextBlock*                                  LabelTextBlock;                                             // 0x03D8   (0x0008)  
	unsigned char                                      UnknownData07_6[0x1];                                       // 0x03E0   (0x0001)  MISSED
	bool                                               bSelected;                                                  // 0x03E1   (0x0001)  
	bool                                               bIsSelectable;                                              // 0x03E2   (0x0001)  
	bool                                               bIsWaiting;                                                 // 0x03E3   (0x0001)  
	unsigned char                                      UnknownData08_7[0x4];                                       // 0x03E4   (0x0004)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_SetupVisuals
	void BP_SetupVisuals() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_SetIsWaiting
	void BP_SetIsWaiting(bool bInIsWaiting) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(bInIsWaiting);
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_OnUnhovered
	void BP_OnUnhovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_OnSelected
	void BP_OnSelected() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_OnHovered
	void BP_OnHovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_OnDeselected
	void BP_OnDeselected() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BP_OnConfirmed
	void BP_OnConfirmed() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_SelectableWidget.BBQUI_BPSelectableWidgetEvent__DelegateSignature
	void BBQUI_BPSelectableWidgetEvent__DelegateSignature(UBBQUI_SelectableWidget* Widget) // [0x2438a30] MulticastDelegate|Public|Delegate 
	{
		typedef void (*FuncPtr)(UBBQUI_SelectableWidget*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Widget);
	}
};

/// Class /Script/BBQUI.BBQUI_MultiStateSelectableWidget
/// Size: 0x05B8 (1464 bytes) (0x0003E8 - 0x0005B8) align 8 MaxSize: 0x05B8
class UBBQUI_MultiStateSelectableWidget : public UBBQUI_SelectableWidget
{ 
public:
	SDK_UNDEFINED(16,562) /* FMulticastInlineDelegate */ __um(OnStateEnabled);                                     // 0x03E8   (0x0010)  
	SDK_UNDEFINED(16,563) /* FMulticastInlineDelegate */ __um(OnStateDisabled);                                    // 0x03F8   (0x0010)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x0408   (0x0018)  MISSED
	TArray<FName>                                      PromptsToDisplay;                                           // 0x0420   (0x0010)  
	class UWidget*                                     EmptyStateRootWidget;                                       // 0x0430   (0x0008)  
	class UWidget*                                     IdleStateRootWidget;                                        // 0x0438   (0x0008)  
	class UWidget*                                     ChosenStateRootWidget;                                      // 0x0440   (0x0008)  
	class UWidget*                                     HoveredStateRootWidget;                                     // 0x0448   (0x0008)  
	class UWidget*                                     NewStateRootWidget;                                         // 0x0450   (0x0008)  
	class UWidget*                                     LockedStateRootWidget;                                      // 0x0458   (0x0008)  
	class UWidget*                                     AvailableStateRootWidget;                                   // 0x0460   (0x0008)  
	class UWidget*                                     PurchasedStateRootWidget;                                   // 0x0468   (0x0008)  
	class UWidget*                                     EquippedStateRootWidget;                                    // 0x0470   (0x0008)  
	class UWidgetAnimation*                            EmptyStateAnimOnEnable;                                     // 0x0478   (0x0008)  
	class UWidgetAnimation*                            EmptyStateAnimOnDisable;                                    // 0x0480   (0x0008)  
	class UWidgetAnimation*                            IdleStateAnimOnEnable;                                      // 0x0488   (0x0008)  
	class UWidgetAnimation*                            IdleStateAnimOnDisable;                                     // 0x0490   (0x0008)  
	class UWidgetAnimation*                            ChosenStateAnimOnEnable;                                    // 0x0498   (0x0008)  
	class UWidgetAnimation*                            ChosenStateAnimOnDisable;                                   // 0x04A0   (0x0008)  
	class UWidgetAnimation*                            HoveredStateAnimOnEnable;                                   // 0x04A8   (0x0008)  
	class UWidgetAnimation*                            HoveredStateAnimOnDisable;                                  // 0x04B0   (0x0008)  
	class UWidgetAnimation*                            NewStateAnimOnEnable;                                       // 0x04B8   (0x0008)  
	class UWidgetAnimation*                            NewStateAnimOnDisable;                                      // 0x04C0   (0x0008)  
	class UWidgetAnimation*                            LockedStateAnimOnEnable;                                    // 0x04C8   (0x0008)  
	class UWidgetAnimation*                            LockedStateAnimOnDisable;                                   // 0x04D0   (0x0008)  
	class UWidgetAnimation*                            AvailableStateAnimOnEnable;                                 // 0x04D8   (0x0008)  
	class UWidgetAnimation*                            AvailableStateAnimOnDisable;                                // 0x04E0   (0x0008)  
	class UWidgetAnimation*                            PurchasedStateAnimOnEnable;                                 // 0x04E8   (0x0008)  
	class UWidgetAnimation*                            PurchasedStateAnimOnDisable;                                // 0x04F0   (0x0008)  
	class UWidgetAnimation*                            EquippedStateAnimOnEnable;                                  // 0x04F8   (0x0008)  
	class UWidgetAnimation*                            EquippedStateAnimOnDisable;                                 // 0x0500   (0x0008)  
	bool                                               bSelectNestedOnSelfSelect;                                  // 0x0508   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0509   (0x0007)  MISSED
	class UBBQUI_ListPanel*                            NestedSelectableWidgetsList;                                // 0x0510   (0x0008)  
	TMap<EBBQUI_SelectableState, FBBQUI_StateChangeAnimationInfo> StateAnimationInfoMap;                           // 0x0518   (0x0050)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0568   (0x0002)  MISSED
	ESlateVisibility                                   EmptyStateEnabledVisibility;                                // 0x056A   (0x0001)  
	ESlateVisibility                                   EmptyStateDisabledVisibility;                               // 0x056B   (0x0001)  
	ESlateVisibility                                   IdleStateEnabledVisibility;                                 // 0x056C   (0x0001)  
	ESlateVisibility                                   IdleStateDisabledVisibility;                                // 0x056D   (0x0001)  
	ESlateVisibility                                   ChosenStateEnabledVisibility;                               // 0x056E   (0x0001)  
	ESlateVisibility                                   ChosenStateDisabledVisibility;                              // 0x056F   (0x0001)  
	ESlateVisibility                                   HoveredStateEnabledVisibility;                              // 0x0570   (0x0001)  
	ESlateVisibility                                   HoveredStateDisabledVisibility;                             // 0x0571   (0x0001)  
	ESlateVisibility                                   NewStateEnabledVisibility;                                  // 0x0572   (0x0001)  
	ESlateVisibility                                   NewStateDisabledVisibility;                                 // 0x0573   (0x0001)  
	ESlateVisibility                                   LockedStateEnabledVisibility;                               // 0x0574   (0x0001)  
	ESlateVisibility                                   LockedStateDisabledVisibility;                              // 0x0575   (0x0001)  
	ESlateVisibility                                   AvailableStateEnabledVisibility;                            // 0x0576   (0x0001)  
	ESlateVisibility                                   AvailableStateDisabledVisibility;                           // 0x0577   (0x0001)  
	ESlateVisibility                                   PurchasedStateEnabledVisibility;                            // 0x0578   (0x0001)  
	ESlateVisibility                                   PurchasedStateDisabledVisibility;                           // 0x0579   (0x0001)  
	ESlateVisibility                                   EquippedStateEnabledVisibility;                             // 0x057A   (0x0001)  
	ESlateVisibility                                   EquippedStateDisabledVisibility;                            // 0x057B   (0x0001)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x057C   (0x0004)  MISSED
	class UBBQUI_SelectableWidget*                     NavUpTarget;                                                // 0x0580   (0x0008)  
	class UBBQUI_SelectableWidget*                     NavDownTarget;                                              // 0x0588   (0x0008)  
	class UBBQUI_SelectableWidget*                     NavLeftTarget;                                              // 0x0590   (0x0008)  
	class UBBQUI_SelectableWidget*                     NavRightTarget;                                             // 0x0598   (0x0008)  
	unsigned char                                      UnknownData04_7[0x18];                                      // 0x05A0   (0x0018)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.SetShouldPlayAnimations
	void SetShouldPlayAnimations(bool bValue) // [0x1fbebe0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(bValue);
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.SetMultipleActiveStates
	// void SetMultipleActiveStates(TArray<EBBQUI_SelectableState> StatesToSet);                                                // [0x1fbe910] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.SelectPreviousNestedWidget
	void SelectPreviousNestedWidget() // [0x1fbe7e0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.SelectNextNestedWidget
	void SelectNextNestedWidget() // [0x1fbe740] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.RemoveMultipleActiveStates
	// void RemoveMultipleActiveStates(TArray<EBBQUI_SelectableState> StatesToRemove);                                          // [0x1fbe630] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.RemoveActiveState
	void RemoveActiveState(EBBQUI_SelectableState StateToRemove, bool bPlayStateAnim, bool bIsNonVisual) // [0x1fbe510] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EBBQUI_SelectableState, bool, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(StateToRemove, bPlayStateAnim, bIsNonVisual);
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.IsStateCurrentlyActive
	bool IsStateCurrentlyActive(EBBQUI_SelectableState StateToCheck) // [0x1fbe3a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)(EBBQUI_SelectableState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(StateToCheck);
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.IsSelectedNestedWidgetAtStartOfList
	bool IsSelectedNestedWidgetAtStartOfList() // [0x1fbe370] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.IsSelectedNestedWidgetAtEndOfList
	bool IsSelectedNestedWidgetAtEndOfList() // [0x1fbe340] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.IsNestedSelectableWidgetSelected
	bool IsNestedSelectableWidgetSelected() // [0x1fbe2e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.IsAnyStateActive
	bool IsAnyStateActive() // [0x1fbe250] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.GetSelectedNestedWidget
	UBBQUI_SelectableWidget* GetSelectedNestedWidget() // [0x1fbe160] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_SelectableWidget* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.DisableAllCurrentlyActiveStates
	void DisableAllCurrentlyActiveStates() // [0x1fbe0b0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.DeselectAllSelectedNestedWidgets
	void DeselectAllSelectedNestedWidgets() // [0x1fbe090] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.BP_OnButtonStateEnabled
	void BP_OnButtonStateEnabled(EBBQUI_SelectableState StateEnabled) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQUI_SelectableState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(StateEnabled);
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.BP_OnButtonStateDisabled
	void BP_OnButtonStateDisabled(EBBQUI_SelectableState StateDisabled) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQUI_SelectableState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(StateDisabled);
	}
	// Function /Script/BBQUI.BBQUI_MultiStateSelectableWidget.AddActiveState
	void AddActiveState(EBBQUI_SelectableState StateToAdd, bool bPlayStateAnim, bool bIsNonVisual) // [0x1fbdb70] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EBBQUI_SelectableState, bool, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func(StateToAdd, bPlayStateAnim, bIsNonVisual);
	}
};

/// Class /Script/BBQUI.BBQUI_AbilityTreeButton
/// Size: 0x0788 (1928 bytes) (0x0005B8 - 0x000788) align 8 MaxSize: 0x0788
class UBBQUI_AbilityTreeButton : public UBBQUI_MultiStateSelectableWidget
{ 
public:
	FText                                              PlaceholderModifierDescription;                             // 0x05B8   (0x0018)  
	FName                                              PlaceholderModifierDescriptionType;                         // 0x05D0   (0x0008)  
	class UBBQUI_Image*                                InfoBGImage;                                                // 0x05D8   (0x0008)  
	class UBBQUI_TextBlock*                            InfoTextBlock;                                              // 0x05E0   (0x0008)  
	class UBBQUI_Image*                                BaseImage;                                                  // 0x05E8   (0x0008)  
	class UBBQUI_Image*                                InnerBGImage;                                               // 0x05F0   (0x0008)  
	class UBBQUI_Image*                                IconImage;                                                  // 0x05F8   (0x0008)  
	class UBBQUI_Image*                                ChosenIconImage;                                            // 0x0600   (0x0008)  
	class UBBQUI_Image*                                ChosenIconBGImage;                                          // 0x0608   (0x0008)  
	class UBBQUI_Image*                                LockedIconBGImage;                                          // 0x0610   (0x0008)  
	class UBBQUI_Image*                                LockedIconImage;                                            // 0x0618   (0x0008)  
	class UWidget*                                     PurchaseAnimAssets;                                         // 0x0620   (0x0008)  
	FBBQUI_TextureAndColourPalette                     BaseImageTextureAndColourPalette;                           // 0x0628   (0x0038)  
	FBBQUI_TextureAndColourPalette                     IconImageTextureAndColourPalette;                           // 0x0660   (0x0038)  
	FDataTableRowHandle                                ChosenIconHoveredColourPalette;                             // 0x0698   (0x0010)  
	FDataTableRowHandle                                ChosenIconRegularColourPalette;                             // 0x06A8   (0x0010)  
	FDataTableRowHandle                                ChosenIconBGHoveredColourPalette;                           // 0x06B8   (0x0010)  
	FDataTableRowHandle                                ChosenIconBGRegularColourPalette;                           // 0x06C8   (0x0010)  
	FDataTableRowHandle                                LockedIconHoveredColourPalette;                             // 0x06D8   (0x0010)  
	FDataTableRowHandle                                LockedIconRegularColourPalette;                             // 0x06E8   (0x0010)  
	FDataTableRowHandle                                LockedIconBGHoveredColourPalette;                           // 0x06F8   (0x0010)  
	FDataTableRowHandle                                LockedIconBGRegularColourPalette;                           // 0x0708   (0x0010)  
	TArray<class UBBQUI_AbilityTreeConnector*>         AdjacentConnectors;                                         // 0x0718   (0x0010)  
	TArray<class UBBQUI_AbilityTreeButton*>            ConnectedButtons;                                           // 0x0728   (0x0010)  
	class UBBQUI_AbilityTreeLevelIndicator*            AssociatedLevelIndicator;                                   // 0x0738   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    NavButtonUp;                                                // 0x0740   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    NavButtonDown;                                              // 0x0748   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    NavButtonLeft;                                              // 0x0750   (0x0008)  
	class UBBQUI_AbilityTreeButton*                    NavButtonRight;                                             // 0x0758   (0x0008)  
	int32_t                                            LevelInTree;                                                // 0x0760   (0x0004)  
	int32_t                                            PositionInLevel;                                            // 0x0764   (0x0004)  
	float                                              OpacityWhenUnavailableLocked;                               // 0x0768   (0x0004)  
	bool                                               bShouldShowInfoInHoverState;                                // 0x076C   (0x0001)  
	bool                                               bIsBaseNode;                                                // 0x076D   (0x0001)  
	unsigned char                                      UnknownData00_7[0x1A];                                      // 0x076E   (0x001A)  MISSED
};

/// Class /Script/BBQUI.BBQUI_AbilityTreeConnector
/// Size: 0x0360 (864 bytes) (0x000260 - 0x000360) align 8 MaxSize: 0x0360
class UBBQUI_AbilityTreeConnector : public UUserWidget
{ 
public:
	class UBBQUI_Image*                                BackgroundImage;                                            // 0x0260   (0x0008)  
	class UBBQUI_Image*                                MainImage;                                                  // 0x0268   (0x0008)  
	class UBBQUI_Image*                                ConnectorImage;                                             // 0x0270   (0x0008)  
	class UWidgetAnimation*                            Connector_UnlockAnim;                                       // 0x0278   (0x0008)  
	class UWidgetAnimation*                            Connector_PurchaseAnim;                                     // 0x0280   (0x0008)  
	class UWidgetAnimation*                            Connector_CrossedOverAnim;                                  // 0x0288   (0x0008)  
	TWeakObjectPtr<class UTexture2D*>                  BackgroundTexture;                                          // 0x0290   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0298   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  MainTexture;                                                // 0x02B8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x02C0   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  ConnectorTexture;                                           // 0x02E0   (0x0008)  
	unsigned char                                      UnknownData02_6[0x20];                                      // 0x02E8   (0x0020)  MISSED
	FDataTableRowHandle                                BackgroundColour;                                           // 0x0308   (0x0010)  
	FDataTableRowHandle                                MainColour;                                                 // 0x0318   (0x0010)  
	FDataTableRowHandle                                ConnectorColour;                                            // 0x0328   (0x0010)  
	float                                              OpacityWhenUnavailable;                                     // 0x0338   (0x0004)  
	bool                                               bMirrorImage;                                               // 0x033C   (0x0001)  
	bool                                               bIsVerticalConnector;                                       // 0x033D   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x033E   (0x0002)  MISSED
	int32_t                                            StartingLevel;                                              // 0x0340   (0x0004)  
	int32_t                                            EndingLevel;                                                // 0x0344   (0x0004)  
	FVector2D                                          VerticalConnectorSize;                                      // 0x0348   (0x0008)  
	FVector2D                                          CornerToCornerConnectorSize;                                // 0x0350   (0x0008)  
	unsigned char                                      UnknownData04_7[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Script/BBQUI.BBQUI_ItemInfoPanel
/// Size: 0x0590 (1424 bytes) (0x000260 - 0x000590) align 8 MaxSize: 0x0590
class UBBQUI_ItemInfoPanel : public UUserWidget
{ 
public:
	class UPanelWidget*                                NoItemRoot;                                                 // 0x0260   (0x0008)  
	class UPanelWidget*                                NoItemCategoryRoot;                                         // 0x0268   (0x0008)  
	class UBBQUI_Image*                                NoItemCategoryBG;                                           // 0x0270   (0x0008)  
	class UBBQUI_TextBlock*                            NoItemCategoryTitleText;                                    // 0x0278   (0x0008)  
	class UBBQUI_TextBlock*                            NoItemText;                                                 // 0x0280   (0x0008)  
	class UPanelWidget*                                BaseItemRoot;                                               // 0x0288   (0x0008)  
	class UPanelWidget*                                PresentInAllItemsRoot;                                      // 0x0290   (0x0008)  
	class UBBQUI_LoadoutItemButton*                    ItemIcon;                                                   // 0x0298   (0x0008)  
	class UBBQUI_Image*                                BaseTopColourImage;                                         // 0x02A0   (0x0008)  
	class UBBQUI_Image*                                TitleBG;                                                    // 0x02A8   (0x0008)  
	class UBBQUI_TextBlock*                            TitleText;                                                  // 0x02B0   (0x0008)  
	class UPanelWidget*                                LevelCostRoot;                                              // 0x02B8   (0x0008)  
	class UBBQUI_Image*                                LevelBG;                                                    // 0x02C0   (0x0008)  
	class UPanelWidget*                                LevelDetailsRoot;                                           // 0x02C8   (0x0008)  
	class UBBQUI_TextBlock*                            LevelNumberText;                                            // 0x02D0   (0x0008)  
	class UPanelWidget*                                LevelProgDetailsRoot;                                       // 0x02D8   (0x0008)  
	class UBBQUI_TextBlock*                            PerkXPText;                                                 // 0x02E0   (0x0008)  
	class UProgressBar*                                PerkLevelProgBar;                                           // 0x02E8   (0x0008)  
	class UPanelWidget*                                CostDetailsRoot;                                            // 0x02F0   (0x0008)  
	class UBBQUI_TextBlock*                            CostText;                                                   // 0x02F8   (0x0008)  
	class UPanelWidget*                                CategoryRoot;                                               // 0x0300   (0x0008)  
	class UBBQUI_Image*                                CategoryBG;                                                 // 0x0308   (0x0008)  
	class UBBQUI_TextBlock*                            CategoryTitleText;                                          // 0x0310   (0x0008)  
	class UPanelWidget*                                GeneralItemContent;                                         // 0x0318   (0x0008)  
	class UBBQUI_TextBlock*                            GeneralText;                                                // 0x0320   (0x0008)  
	class UScrollBox*                                  GeneralScrollBox;                                           // 0x0328   (0x0008)  
	class UScrollBox*                                  GeneralScrollBoxWithCost;                                   // 0x0330   (0x0008)  
	class UPanelWidget*                                GeneralItemContentWithCost;                                 // 0x0338   (0x0008)  
	class UBBQUI_TextBlock*                            GeneralTextWithCost;                                        // 0x0340   (0x0008)  
	class UPanelWidget*                                MottoPerkItemContent;                                       // 0x0348   (0x0008)  
	class UBBQUI_TextBlock*                            MottoPerkText;                                              // 0x0350   (0x0008)  
	class UScrollBox*                                  MottoPerkScrollBox;                                         // 0x0358   (0x0008)  
	class UBBQUI_TextBlock*                            MottoCategoryTitleText;                                     // 0x0360   (0x0008)  
	class UPanelWidget*                                ExecutionItemContent;                                       // 0x0368   (0x0008)  
	class UBBQUI_TextBlock*                            ExecutionText;                                              // 0x0370   (0x0008)  
	class UScrollBox*                                  ExecutionScrollBox;                                         // 0x0378   (0x0008)  
	class UPanelWidget*                                LevelableItemContent;                                       // 0x0380   (0x0008)  
	class UScrollBox*                                  LevelableItemScrollBox;                                     // 0x0388   (0x0008)  
	class UBBQUI_TextBlock*                            LevelableItemTextBlock;                                     // 0x0390   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             Level1Display;                                              // 0x0398   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             Level2Display;                                              // 0x03A0   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             Level3Display;                                              // 0x03A8   (0x0008)  
	class UScrollBox*                                  LevelableItemCategoryScrollBox;                             // 0x03B0   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             CategoryLevel1Display;                                      // 0x03B8   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             CategoryLevel2Display;                                      // 0x03C0   (0x0008)  
	class UBBQUI_ItemInfoPanelLevelWidget*             CategoryLevel3Display;                                      // 0x03C8   (0x0008)  
	class UPanelWidget*                                UnavailableRootWidget;                                      // 0x03D0   (0x0008)  
	class UPanelWidget*                                AvailableRootWidget;                                        // 0x03D8   (0x0008)  
	class UPanelWidget*                                PurchasedRootWidget;                                        // 0x03E0   (0x0008)  
	class UPanelWidget*                                AbilityTreePromptRoot;                                      // 0x03E8   (0x0008)  
	class UPanelWidget*                                PurchasedPromptRoot;                                        // 0x03F0   (0x0008)  
	class UPanelWidget*                                PurchasedPromptTickIconRoot;                                // 0x03F8   (0x0008)  
	class UBBQUI_MenuInputIcon*                        PurchasedPromptInputIcon;                                   // 0x0400   (0x0008)  
	class UBBQUI_TextBlock*                            PurchasedPromptText;                                        // 0x0408   (0x0008)  
	class UPanelWidget*                                LockedRootWidget;                                           // 0x0410   (0x0008)  
	class UPanelWidget*                                EquippedRootWidget;                                         // 0x0418   (0x0008)  
	class UBBQUI_CharacterAugmentData*                 CompleteCharacterAugmentData;                               // 0x0420   (0x0008)  
	TWeakObjectPtr<class UAkAudioEvent*>               ScrollingAudio;                                             // 0x0428   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0430   (0x0020)  MISSED
	FString                                            DefaultRichTextArg;                                         // 0x0450   (0x0010)  
	FString                                            CurrentLevelRichTextArg;                                    // 0x0460   (0x0010)  
	FString                                            BoldValueRichTextArg;                                       // 0x0470   (0x0010)  
	FText                                              XPTextWithNamedArgs;                                        // 0x0480   (0x0018)  
	FText                                              XPTitle;                                                    // 0x0498   (0x0018)  
	FString                                            FormatArgumentXPTitle;                                      // 0x04B0   (0x0010)  
	FString                                            FormatArgumentXPCurrent;                                    // 0x04C0   (0x0010)  
	FString                                            FormatArgumentXPMax;                                        // 0x04D0   (0x0010)  
	FText                                              AbilityNotModifiedForLevelText;                             // 0x04E0   (0x0018)  
	TArray<class UPanelWidget*>                        DisplayStateWidgets;                                        // 0x04F8   (0x0010)  
	class UBBQUI_Image*                                ExecutionPreview;                                           // 0x0508   (0x0008)  
	FDataTableRowHandle                                BaseTopColourImageOriginal;                                 // 0x0510   (0x0010)  
	FDataTableRowHandle                                TitleBGOriginal;                                            // 0x0520   (0x0010)  
	FDataTableRowHandle                                LevelBGOriginal;                                            // 0x0530   (0x0010)  
	FDataTableRowHandle                                BaseTopColourImageLockedUnavailable;                        // 0x0540   (0x0010)  
	FDataTableRowHandle                                TitleBGLockedUnavailable;                                   // 0x0550   (0x0010)  
	FDataTableRowHandle                                LevelBGLockedUnavailable;                                   // 0x0560   (0x0010)  
	FDataTableRowHandle                                CategoryBGLockedUnavailable;                                // 0x0570   (0x0010)  
	unsigned char                                      UnknownData01_7[0x10];                                      // 0x0580   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnMottoPerkScroll
	void OnMottoPerkScroll(float ScrollOffset) // [0x1fae1b0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnLevelableScroll
	void OnLevelableScroll(float ScrollOffset) // [0x1fae060] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnLevelableCategoryScroll
	void OnLevelableCategoryScroll(float ScrollOffset) // [0x1fadfe0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnGeneralScroll
	void OnGeneralScroll(float ScrollOffset) // [0x1fadf60] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnGeneralCostScroll
	void OnGeneralCostScroll(float ScrollOffset) // [0x1fadee0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_ItemInfoPanel.OnExecutionScroll
	void OnExecutionScroll(float ScrollOffset) // [0x1fade60] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(ScrollOffset);
	}
};

/// Class /Script/BBQUI.BBQUI_AbilityTreeItemInfoPanel
/// Size: 0x05B8 (1464 bytes) (0x000590 - 0x0005B8) align 8 MaxSize: 0x05B8
class UBBQUI_AbilityTreeItemInfoPanel : public UBBQUI_ItemInfoPanel
{ 
public:
	FText                                              NoModifierText;                                             // 0x0590   (0x0018)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x05A8   (0x0010)  MISSED
};

/// Class /Script/BBQUI.BBQUI_AbilityTreeLevelIndicator
/// Size: 0x02C8 (712 bytes) (0x000260 - 0x0002C8) align 8 MaxSize: 0x02C8
class UBBQUI_AbilityTreeLevelIndicator : public UUserWidget
{ 
public:
	class UBBQUI_Image*                                TopLineImage;                                               // 0x0260   (0x0008)  
	class UBBQUI_TextBlock*                            TitleTextBlock;                                             // 0x0268   (0x0008)  
	class UBBQUI_TextBlock*                            NumberTextBlock;                                            // 0x0270   (0x0008)  
	int32_t                                            LevelNumber;                                                // 0x0278   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x027C   (0x0004)  MISSED
	FText                                              LevelTitleText;                                             // 0x0280   (0x0018)  
	bool                                               bShowLevelNumber;                                           // 0x0298   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0299   (0x0003)  MISSED
	float                                              OpacityWhenUnavailable;                                     // 0x029C   (0x0004)  
	FDataTableRowHandle                                RegularColour;                                              // 0x02A0   (0x0010)  
	FDataTableRowHandle                                HighlightColour;                                            // 0x02B0   (0x0010)  
	unsigned char                                      UnknownData02_7[0x8];                                       // 0x02C0   (0x0008)  MISSED
};

/// Class /Script/BBQUI.BBQUI_AbilityTreeMenu
/// Size: 0x03D8 (984 bytes) (0x0003C8 - 0x0003D8) align 8 MaxSize: 0x03D8
class UBBQUI_AbilityTreeMenu : public UBBQUI_MenuBase
{ 
public:
	class UBBQUI_AbilityTree*                          AbilityTreeWidget;                                          // 0x03C8   (0x0008)  
	FName                                              UnlockTreeFullScreenNameIdentifier;                         // 0x03D0   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_AbilityTreeMenu.OnPlayerMetaDataChanged
	void OnPlayerMetaDataChanged(ABBQPlayerState* PlayerState) // [0x1f93500] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(ABBQPlayerState*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(PlayerState);
	}
};

/// Class /Script/BBQUI.BBQUI_TopBarMenuWidget
/// Size: 0x03F0 (1008 bytes) (0x0003B0 - 0x0003F0) align 8 MaxSize: 0x03F0
class UBBQUI_TopBarMenuWidget : public UBBQUI_UserWidget
{ 
public:
	FBBQUI_TopBarMenuTabData                           TabSetupData;                                               // 0x03B0   (0x0020)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x03D0   (0x0018)  MISSED
	bool                                               bUseThumbStickForNavEvents;                                 // 0x03E8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x03E9   (0x0003)  MISSED
	float                                              TimeLimitBetweenFiringHeldNavigationInputs;                 // 0x03EC   (0x0004)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_TopBarMenuWidget.OnPopUpClosed
	void OnPopUpClosed() // [0x1fcf920] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuWidget.BP_RefreshColors
	void BP_RefreshColors(FDataTableRowHandle& NewColor, FDataTableRowHandle& NewAdditionalColor) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FDataTableRowHandle&, FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(NewColor, NewAdditionalColor);
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuWidget.BP_OnSwitchedTo
	void BP_OnSwitchedTo() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_TopBarMenuWidget.BP_OnSwitchedFrom
	void BP_OnSwitchedFrom() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_OptionsMenuWidget
/// Size: 0x0478 (1144 bytes) (0x0003F0 - 0x000478) align 8 MaxSize: 0x0478
class UBBQUI_OptionsMenuWidget : public UBBQUI_TopBarMenuWidget
{ 
public:
	class UBBQUI_ListPanel*                            OptionsContainer;                                           // 0x03F0   (0x0008)  
	class UScrollBox*                                  OptionsScrollBox;                                           // 0x03F8   (0x0008)  
	FDataTableRowHandle                                ScrollBoxVerticalBGImageColour;                             // 0x0400   (0x0010)  
	FDataTableRowHandle                                ScrollBoxNormalThumbImageColour;                            // 0x0410   (0x0010)  
	FDataTableRowHandle                                ScrollHoveredThumbImageColour;                              // 0x0420   (0x0010)  
	FDataTableRowHandle                                ScrollBoxDraggedThumbImageColour;                           // 0x0430   (0x0010)  
	TWeakObjectPtr<class UAkAudioEvent*>               ScrollingAudio;                                             // 0x0440   (0x0008)  
	unsigned char                                      UnknownData00_7[0x30];                                      // 0x0448   (0x0030)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.SettingsReset
	void SettingsReset() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.SettingsDiscarded
	void SettingsDiscarded() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.SettingsApplied
	void SettingsApplied() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.ResetSettings
	void ResetSettings() // [0x1fc2820] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.OnUserScrolled
	void OnUserScrolled(float ScrollOffset) // [0x1fc25f0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(ScrollOffset);
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.HasAnySettingChanged
	bool HasAnySettingChanged() // [0x1fc1fb0] Native|Public|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.DiscardSettings
	void DiscardSettings() // [0x1fc1e20] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_OptionsMenuWidget.ApplySettings
	void ApplySettings() // [0x1fc1de0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_AudioOptions
/// Size: 0x04E0 (1248 bytes) (0x000478 - 0x0004E0) align 8 MaxSize: 0x04E0
class UBBQUI_AudioOptions : public UBBQUI_OptionsMenuWidget
{ 
public:
	class UBBQUI_OptionSlider*                         MasterVolumeSlider;                                         // 0x0478   (0x0008)  
	class UBBQUI_OptionSlider*                         MusicVolumeSlider;                                          // 0x0480   (0x0008)  
	class UBBQUI_OptionSlider*                         EffectsVolumeSlider;                                        // 0x0488   (0x0008)  
	class UBBQUI_OptionSlider*                         VoiceVolumeSlider;                                          // 0x0490   (0x0008)  
	class UBBQUI_OptionSelection*                      AudioOutputSelection;                                       // 0x0498   (0x0008)  
	class UBBQUI_OptionSelection*                      VoiceChatSelection;                                         // 0x04A0   (0x0008)  
	class UBBQUI_OptionSelection*                      MicrophoneSelectionPC;                                      // 0x04A8   (0x0008)  
	class UBBQUI_OptionSelection*                      MicrophoneSelectionConsole;                                 // 0x04B0   (0x0008)  
	class UBBQUI_OptionSlider*                         VoiceChatVolumeSlider;                                      // 0x04B8   (0x0008)  
	class UAkAudioEvent*                               ParameterDecreasedSound;                                    // 0x04C0   (0x0008)  
	class UAkAudioEvent*                               ParameterIncreasedSound;                                    // 0x04C8   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x04D0   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnVoiceVolumeChanged
	void OnVoiceVolumeChanged(float PrevVolume, float NewVolume) // [0x1f93680] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(PrevVolume, NewVolume);
	}
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnVoiceChatVolumeChanged
	void OnVoiceChatVolumeChanged(float PrevVolume, float NewVolume) // [0x1f935b0] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(PrevVolume, NewVolume);
	}
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnMusicVolumeChanged
	void OnMusicVolumeChanged(float PrevVolume, float NewVolume) // [0x1f93430] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(PrevVolume, NewVolume);
	}
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnMasterVolumeChanged
	void OnMasterVolumeChanged(float PrevVolume, float NewVolume) // [0x1f93290] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(PrevVolume, NewVolume);
	}
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnEffectsVolumeChanged
	void OnEffectsVolumeChanged(float PrevVolume, float NewVolume) // [0x1f930f0] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(PrevVolume, NewVolume);
	}
	// Function /Script/BBQUI.BBQUI_AudioOptions.OnAudioOutputChanged
	// void OnAudioOutputChanged(int32_t OptionIndex, TEnumAsByte<ESelectInfo> SelectionType);                                  // [0x1f93020] Final|Native|Private 
};

/// Class /Script/BBQUI.BBQUI_BootFlowMenu
/// Size: 0x03D0 (976 bytes) (0x0003C8 - 0x0003D0) align 8 MaxSize: 0x03D0
class UBBQUI_BootFlowMenu : public UBBQUI_MenuBase
{ 
public:
	class UBBQUI_MenuInputPrompt*                      NextBtn;                                                    // 0x03C8   (0x0008)  
};

/// Class /Script/BBQUI.BBQUI_AutoSaveWarning
/// Size: 0x03E0 (992 bytes) (0x0003D0 - 0x0003E0) align 8 MaxSize: 0x03E0
class UBBQUI_AutoSaveWarning : public UBBQUI_BootFlowMenu
{ 
public:
	FName                                              AutoSaveStartTimeParamName;                                 // 0x03D0   (0x0008)  
	class UAkAudioEvent*                               AutoSaveWarningAudio;                                       // 0x03D8   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_AutoSaveWarning.GetAutoSaveWarningMaterial
	UMaterialInstanceDynamic* GetAutoSaveWarningMaterial() // [0x2438a30] Event|Public|BlueprintEvent|Const 
	{
		typedef class UMaterialInstanceDynamic* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
};

/// Class /Script/BBQUI.BBQUI_GammaBrightnessSettings
/// Size: 0x0410 (1040 bytes) (0x0003C8 - 0x000410) align 8 MaxSize: 0x0410
class UBBQUI_GammaBrightnessSettings : public UBBQUI_MenuBase
{ 
public:
	class UBBQUI_MenuInputPrompt*                      ConfirmBtn;                                                 // 0x03C8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      BackBtn;                                                    // 0x03D0   (0x0008)  
	class UBBQUI_OptionSlider*                         BrightnessSlider;                                           // 0x03D8   (0x0008)  
	class UTextBlock*                                  BrightnessValueText;                                        // 0x03E0   (0x0008)  
	FDataTableRowHandle                                DefaultMenuColor;                                           // 0x03E8   (0x0010)  
	FDataTableRowHandle                                MenuAdditionalColor;                                        // 0x03F8   (0x0010)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0408   (0x0008)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_GammaBrightnessSettings.SetNewGammaValue
	void SetNewGammaValue(float SliderValue) // [0x1fa5a20] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(SliderValue);
	}
	// Function /Script/BBQUI.BBQUI_GammaBrightnessSettings.RestoreLastGammaValue
	void RestoreLastGammaValue() // [0x1fa57f0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_GammaBrightnessSettings.OnBrightnessSliderValueChanged
	void OnBrightnessSliderValueChanged(float PrevValue, float NewValue) // [0x1fa50c0] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(float, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(PrevValue, NewValue);
	}
	// Function /Script/BBQUI.BBQUI_GammaBrightnessSettings.HasGammaChanged
	bool HasGammaChanged() // [0x1fa4d70] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_GammaBrightnessSettings.AcceptCurrentGammaValue
	void AcceptCurrentGammaValue() // [0x1fa48d0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_BootFlowBrightnessMenu
/// Size: 0x0418 (1048 bytes) (0x000410 - 0x000418) align 8 MaxSize: 0x0418
class UBBQUI_BootFlowBrightnessMenu : public UBBQUI_GammaBrightnessSettings
{ 
public:
	FName                                              BackScreenName;                                             // 0x0410   (0x0008)  
};

/// Class /Script/BBQUI.BBQUI_BootFlowHUD
/// Size: 0x03C0 (960 bytes) (0x000338 - 0x0003C0) align 8 MaxSize: 0x03C0
class ABBQUI_BootFlowHUD : public ABBQUI_HUD
{ 
public:
	FString                                            ForceFirstTimeBootArgument;                                 // 0x0338   (0x0010)  
	FString                                            ForceSkipBootArgument;                                      // 0x0348   (0x0010)  
	bool                                               IsFirstTimeFlowCompleted;                                   // 0x0358   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0359   (0x0007)  MISSED
	TWeakObjectPtr<class UWorld*>                      LevelToLoad;                                                // 0x0360   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0368   (0x0020)  MISSED
	float                                              LoadingScreenDelay;                                         // 0x0388   (0x0004)  
	float                                              LoadingScreenFadeInTime;                                    // 0x038C   (0x0004)  
	float                                              LoadingScreenFadeOutTime;                                   // 0x0390   (0x0004)  
	float                                              LevelFadeInTime;                                            // 0x0394   (0x0004)  
	unsigned char                                      UnknownData02_7[0x28];                                      // 0x0398   (0x0028)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.StartAsyncLoading
	void StartAsyncLoading() // [0x1f98c70] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.ShouldForceSkipBoot
	bool ShouldForceSkipBoot() // [0x1f98b20] Final|Native|Protected|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.ShouldForceFirstTimeBoot
	bool ShouldForceFirstTimeBoot() // [0x1f98af0] Final|Native|Protected|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.SaveFirstTimeCompleted
	void SaveFirstTimeCompleted() // [0x1f98190] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.IsLoggedIn
	bool IsLoggedIn() // [0x1f97d10] Final|Native|Protected|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.IntroFlowCompleted
	void IntroFlowCompleted() // [0x1f97cf0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_BootFlowHUD.BP_OnAsyncLoadingFinished
	void BP_OnAsyncLoadingFinished() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_BottomPromptBar
/// Size: 0x03D8 (984 bytes) (0x0003B0 - 0x0003D8) align 8 MaxSize: 0x03D8
class UBBQUI_BottomPromptBar : public UBBQUI_UserWidget
{ 
public:
	TArray<FName>                                      PromptsToDisplay;                                           // 0x03B0   (0x0010)  
	class UDataTable*                                  InputPromptDataTable;                                       // 0x03C0   (0x0008)  
	class UClass*                                      InputPromptClass;                                           // 0x03C8   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x03D0   (0x0008)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_BottomPromptBar.ShowPrompt
	void ShowPrompt(FName PromptName) // [0x1f98be0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(PromptName);
	}
	// Function /Script/BBQUI.BBQUI_BottomPromptBar.HidePrompt
	void HidePrompt(FName PromptName) // [0x1f97c60] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(PromptName);
	}
	// Function /Script/BBQUI.BBQUI_BottomPromptBar.GetInputPromptContainer
	UHorizontalBox* GetInputPromptContainer() // [0x1f97ba0] Final|Native|Public|BlueprintCallable 
	{
		typedef class UHorizontalBox* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
};

/// Class /Script/BBQUI.BBQUI_Button
/// Size: 0x05A0 (1440 bytes) (0x0003B0 - 0x0005A0) align 8 MaxSize: 0x05A0
class UBBQUI_Button : public UBBQUI_UserWidget
{ 
public:
	TArray<FName>                                      PromptsToDisplay;                                           // 0x03B0   (0x0010)  
	SDK_UNDEFINED(16,564) /* FMulticastInlineDelegate */ __um(OnBBQButtonClicked);                                 // 0x03C0   (0x0010)  
	SDK_UNDEFINED(16,565) /* FMulticastInlineDelegate */ __um(OnBBQButtonHovered);                                 // 0x03D0   (0x0010)  
	SDK_UNDEFINED(16,566) /* FMulticastInlineDelegate */ __um(OnBBQButtonUnhovered);                               // 0x03E0   (0x0010)  
	SDK_UNDEFINED(16,567) /* FMulticastInlineDelegate */ __um(OnBBQButtonPressed);                                 // 0x03F0   (0x0010)  
	SDK_UNDEFINED(16,568) /* FMulticastInlineDelegate */ __um(OnBBQButtonReleased);                                // 0x0400   (0x0010)  
	SDK_UNDEFINED(16,569) /* FMulticastInlineDelegate */ __um(OnBBQButtonStateEnabled);                            // 0x0410   (0x0010)  
	SDK_UNDEFINED(16,570) /* FMulticastInlineDelegate */ __um(OnBBQButtonStateDisabled);                           // 0x0420   (0x0010)  
	FName                                              ButtonWidgetName;                                           // 0x0430   (0x0008)  
	TArray<FName>                                      TextBlockWidgetNames;                                       // 0x0438   (0x0010)  
	TArray<FName>                                      ImageWidgetNames;                                           // 0x0448   (0x0010)  
	FName                                              EmptyStateRootWidgetName;                                   // 0x0458   (0x0008)  
	FName                                              IdleStateRootWidgetName;                                    // 0x0460   (0x0008)  
	FName                                              SelectedStateRootWidgetName;                                // 0x0468   (0x0008)  
	FName                                              HoveredStateRootWidgetName;                                 // 0x0470   (0x0008)  
	FName                                              NewStateRootWidgetName;                                     // 0x0478   (0x0008)  
	FName                                              LockedStateRootWidgetName;                                  // 0x0480   (0x0008)  
	FName                                              AvailableStateRootWidgetName;                               // 0x0488   (0x0008)  
	FName                                              PurchasedStateRootWidgetName;                               // 0x0490   (0x0008)  
	ESlateVisibility                                   EmptyStateEnabledVisibility;                                // 0x0498   (0x0001)  
	ESlateVisibility                                   EmptyStateDisabledVisibility;                               // 0x0499   (0x0001)  
	ESlateVisibility                                   IdleStateEnabledVisibility;                                 // 0x049A   (0x0001)  
	ESlateVisibility                                   IdleStateDisabledVisibility;                                // 0x049B   (0x0001)  
	ESlateVisibility                                   SelectedStateEnabledVisibility;                             // 0x049C   (0x0001)  
	ESlateVisibility                                   SelectedStateDisabledVisibility;                            // 0x049D   (0x0001)  
	ESlateVisibility                                   HoveredStateEnabledVisibility;                              // 0x049E   (0x0001)  
	ESlateVisibility                                   HoveredStateDisabledVisibility;                             // 0x049F   (0x0001)  
	ESlateVisibility                                   NewStateEnabledVisibility;                                  // 0x04A0   (0x0001)  
	ESlateVisibility                                   NewStateDisabledVisibility;                                 // 0x04A1   (0x0001)  
	ESlateVisibility                                   LockedStateEnabledVisibility;                               // 0x04A2   (0x0001)  
	ESlateVisibility                                   LockedStateDisabledVisibility;                              // 0x04A3   (0x0001)  
	ESlateVisibility                                   AvailableStateEnabledVisibility;                            // 0x04A4   (0x0001)  
	ESlateVisibility                                   AvailableStateDisabledVisibility;                           // 0x04A5   (0x0001)  
	ESlateVisibility                                   PurchasedStateEnabledVisibility;                            // 0x04A6   (0x0001)  
	ESlateVisibility                                   PurchasedStateDisabledVisibility;                           // 0x04A7   (0x0001)  
	unsigned char                                      UnknownData00_7[0xF8];                                      // 0x04A8   (0x00F8)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_Button.ShowImageWidget
	void ShowImageWidget(FName ImageName) // [0x1f98b50] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(ImageName);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetTextForTexblock
	void SetTextForTexblock(FName TextBlockName, FText TextToSet) // [0x1f989c0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, FText);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(TextBlockName, TextToSet);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetOpacity
	void SetOpacity(float Opacity) // [0x1f98940] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Opacity);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetMultipleActiveStates
	// void SetMultipleActiveStates(TArray<EBBQUI_ButtonState> StatesToSet);                                                    // [0x1f98850] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_Button.SetImageTextureAndColourPalette
	void SetImageTextureAndColourPalette(FName ImageName, UTexture2D* TextureToSet, FDataTableRowHandle& ColourPalette) // [0x1f98730] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, UTexture2D*, FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(ImageName, TextureToSet, ColourPalette);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetImageTexture
	void SetImageTexture(FName ImageName, UTexture2D* TextureToSet) // [0x1f98660] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, UTexture2D*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(ImageName, TextureToSet);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetImageSoftTextureAndColourPalette
	// void SetImageSoftTextureAndColourPalette(FName ImageName, TWeakObjectPtr<UTexture2D*> TextureToSet, FDataTableRowHandle& ColourPalette); // [0x1f984c0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_Button.SetImageOpacity
	void SetImageOpacity(FName ImageName, float Opacity) // [0x1f983f0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(ImageName, Opacity);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetImageColourPalette
	void SetImageColourPalette(FName ImageName, FDataTableRowHandle& ColourPalette) // [0x1f98310] Final|Native|Public|HasOutParms|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, FDataTableRowHandle&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(ImageName, ColourPalette);
	}
	// Function /Script/BBQUI.BBQUI_Button.SetImageBrush
	void SetImageBrush(FName ImageName, FSlateBrush Brush) // [0x1f981b0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName, FSlateBrush);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(ImageName, Brush);
	}
	// Function /Script/BBQUI.BBQUI_Button.RemoveMultipleActiveStates
	// void RemoveMultipleActiveStates(TArray<EBBQUI_ButtonState> StatesToRemove);                                              // [0x1f980a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/BBQUI.BBQUI_Button.RemoveActiveState
	void RemoveActiveState(EBBQUI_ButtonState StateToRemove) // [0x1f98020] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EBBQUI_ButtonState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(StateToRemove);
	}
	// Function /Script/BBQUI.BBQUI_Button.OnButtonUnhovered
	void OnButtonUnhovered() // [0x1f97e10] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.OnButtonReleased
	void OnButtonReleased() // [0xd68f40] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.OnButtonPressed
	void OnButtonPressed() // [0x1f97df0] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.OnButtonHovered
	void OnButtonHovered() // [0x1e71350] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.OnButtonClicked
	void OnButtonClicked() // [0x1f97dd0] Native|Protected     
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.IsStateCurrentlyActive
	bool IsStateCurrentlyActive(EBBQUI_ButtonState StateToCheck) // [0x1f97d40] Final|Native|Public|BlueprintCallable 
	{
		typedef bool (*FuncPtr)(EBBQUI_ButtonState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		return func(StateToCheck);
	}
	// Function /Script/BBQUI.BBQUI_Button.HideImageWidget
	void HideImageWidget(FName ImageName) // [0x1f97bd0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func(ImageName);
	}
	// Function /Script/BBQUI.BBQUI_Button.GetImageWidget
	UBBQUI_Image* GetImageWidget(FName ImageName) // [0x1f97b00] Final|Native|Public|BlueprintCallable 
	{
		typedef class UBBQUI_Image* (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		return func(ImageName);
	}
	// Function /Script/BBQUI.BBQUI_Button.GetButtonWidget
	UButton* GetButtonWidget() // [0x1f97ae0] Final|Native|Public|BlueprintCallable 
	{
		typedef class UButton* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableSelectedState
	void EnableSelectedState() // [0x1f97ac0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnablePurchasedState
	void EnablePurchasedState() // [0x1f97aa0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableNewState
	void EnableNewState() // [0x1f97a80] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableLockedState
	void EnableLockedState() // [0x1f97a60] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableIdleState
	void EnableIdleState() // [0x1f97a40] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableHoveredState
	void EnableHoveredState() // [0x1f97a20] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableEmptyState
	void EnableEmptyState() // [0x1f97a00] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.EnableAvailableState
	void EnableAvailableState() // [0x1f979e0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableSelectedState
	void DisableSelectedState() // [0x1f979c0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[29]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisablePurchasedState
	void DisablePurchasedState() // [0x1f979a0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableNewState
	void DisableNewState() // [0x1f97980] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableLockedState
	void DisableLockedState() // [0x1f97960] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableIdleState
	void DisableIdleState() // [0x1f97940] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableHoveredState
	void DisableHoveredState() // [0x1f97920] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableEmptyState
	void DisableEmptyState() // [0x1f97900] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableAvailableState
	void DisableAvailableState() // [0x1f978e0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[36]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.DisableAllCurrentlyActiveStates
	void DisableAllCurrentlyActiveStates() // [0x1f978c0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[37]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonUnhovered
	void BP_OnButtonUnhovered() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[38]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonStateEnabled
	void BP_OnButtonStateEnabled(EBBQUI_ButtonState StateEnabled) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQUI_ButtonState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[39]);
		func(StateEnabled);
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonStateDisabled
	void BP_OnButtonStateDisabled(EBBQUI_ButtonState StateDisabled) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQUI_ButtonState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[40]);
		func(StateDisabled);
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonReleased
	void BP_OnButtonReleased() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[41]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonPressed
	void BP_OnButtonPressed() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[42]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonHovered
	void BP_OnButtonHovered() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[43]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.BP_OnButtonClicked
	void BP_OnButtonClicked() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[44]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_Button.AddActiveState
	void AddActiveState(EBBQUI_ButtonState StateToAdd) // [0x1f97840] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(EBBQUI_ButtonState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[45]);
		func(StateToAdd);
	}
};

/// Class /Script/BBQUI.BBQUI_CasualGame
/// Size: 0x03B0 (944 bytes) (0x0003B0 - 0x0003B0) align 8 MaxSize: 0x03B0
class UBBQUI_CasualGame : public UBBQUI_UserWidget
{ 
public:
};

/// Class /Script/BBQUI.BBQUI_Chainsaw
/// Size: 0x02D0 (720 bytes) (0x000260 - 0x0002D0) align 8 MaxSize: 0x02D0
class UBBQUI_Chainsaw : public UUserWidget
{ 
public:
	class UWidget*                                     ButtonTapCanvas;                                            // 0x0260   (0x0008)  
	class UWidgetAnimation*                            TapAnimation;                                               // 0x0268   (0x0008)  
	FGameplayTag                                       ShowRevvPromptThresholdTag;                                 // 0x0270   (0x0008)  
	FGameplayTagContainer                              VisiblityRequiredTags;                                      // 0x0278   (0x0020)  
	FGameplayTagContainer                              VisiblityIgnoreTags;                                        // 0x0298   (0x0020)  
	class UBBQChainsawComponent*                       CachedChainsawComponent;                                    // 0x02B8   (0x0008)  
	unsigned char                                      UnknownData00_7[0x10];                                      // 0x02C0   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_Chainsaw.OnPossessionAcknowledged
	void OnPossessionAcknowledged(APawn* InPawn) // [0x1f97f00] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(InPawn);
	}
	// Function /Script/BBQUI.BBQUI_Chainsaw.OnChainsawThresholdReached
	void OnChainsawThresholdReached(FGameplayTag ThresholdTag, bool bExceeded) // [0x1f97e30] Final|Native|Protected 
	{
		typedef void (*FuncPtr)(FGameplayTag, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(ThresholdTag, bExceeded);
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterAttribute
/// Size: 0x0628 (1576 bytes) (0x0005B8 - 0x000628) align 8 MaxSize: 0x0628
class UBBQUI_CharacterAttribute : public UBBQUI_MultiStateSelectableWidget
{ 
public:
	class UBBQUI_Image*                                AttributeIcon;                                              // 0x05B8   (0x0008)  
	class UTextBlock*                                  AttributeNameText;                                          // 0x05C0   (0x0008)  
	class UTextBlock*                                  AttributeValueText;                                         // 0x05C8   (0x0008)  
	class UBBQUI_Image*                                AttributeProgressBase;                                      // 0x05D0   (0x0008)  
	class UBBQUI_Image*                                AttributeProgressAdditional;                                // 0x05D8   (0x0008)  
	class UBBQUI_Image*                                BaseValueMark;                                              // 0x05E0   (0x0008)  
	class UDataTable*                                  ColourPaletteData;                                          // 0x05E8   (0x0008)  
	unsigned char                                      UnknownData00_6[0x30];                                      // 0x05F0   (0x0030)  MISSED
	class UBBQBasePlayerAttributeAsset*                AttributeAsset;                                             // 0x0620   (0x0008)  
};

/// Class /Script/BBQUI.BBQUI_CharacterAugmentData
/// Size: 0x0180 (384 bytes) (0x000030 - 0x000180) align 8 MaxSize: 0x0180
class UBBQUI_CharacterAugmentData : public UDataAsset
{ 
public:
	TMap<FName, FBBQUI_CharacterAugmentUniqueCosmeticData> CharacterAugmentUniqueCosmeticDataMap;                  // 0x0030   (0x0050)  
	TMap<EBBQUI_CharacterAugmentMainCategory, FBBQUI_CharacterAugmentSharedCosmeticData> CharacterAugmentSharedCosmeticDataMap; // 0x0080   (0x0050)  
	TMap<EBBQUI_CharacterAugmentAttributeCategory, FBBQUI_CharacterAugmentAttributeData> CharacterAugmentAttributeDataMap; // 0x00D0   (0x0050)  
	TMap<FName, FBBQUI_TextureAndColourPalette>        CharacterAugmentModifierIcons;                              // 0x0120   (0x0050)  
	TArray<FBBQUI_TextureAndColourPalette>             CharacterAugmentModifierSharedLayers;                       // 0x0170   (0x0010)  
};

/// Class /Script/BBQUI.BBQUI_ListPanel
/// Size: 0x02E8 (744 bytes) (0x000260 - 0x0002E8) align 8 MaxSize: 0x02E8
class UBBQUI_ListPanel : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x30];                                      // 0x0260   (0x0030)  MISSED
	bool                                               bShouldSelectFirstIndexOnConstruction;                      // 0x0290   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0291   (0x0007)  MISSED
	class UNamedSlot*                                  ListPanelSlot;                                              // 0x0298   (0x0008)  
	class UPanelWidget*                                ListPanel;                                                  // 0x02A0   (0x0008)  
	TArray<class UBBQUI_SelectableWidget*>             SelectableWidgets;                                          // 0x02A8   (0x0010)  
	TWeakObjectPtr<class UAkAudioEvent*>               WidgetSelectionSound;                                       // 0x02B8   (0x0008)  
	unsigned char                                      UnknownData02_7[0x28];                                      // 0x02C0   (0x0028)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_ListPanel.SelectPrevious
	void SelectPrevious() // [0x1e76c80] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_ListPanel.SelectNext
	void SelectNext() // [0x1dff7e0] Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_ListPanel2D
/// Size: 0x02F0 (752 bytes) (0x0002E8 - 0x0002F0) align 8 MaxSize: 0x02F0
class UBBQUI_ListPanel2D : public UBBQUI_ListPanel
{ 
public:
	int32_t                                            RowLength;                                                  // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x02EC   (0x0004)  MISSED
};

/// Class /Script/BBQUI.BBQUI_CharacterCardsContainer
/// Size: 0x02F0 (752 bytes) (0x0002F0 - 0x0002F0) align 8 MaxSize: 0x02F0
class UBBQUI_CharacterCardsContainer : public UBBQUI_ListPanel2D
{ 
public:
};

/// Class /Script/BBQUI.BBQUI_LobbyTab
/// Size: 0x0420 (1056 bytes) (0x0003F0 - 0x000420) align 8 MaxSize: 0x0420
class UBBQUI_LobbyTab : public UBBQUI_TopBarMenuWidget
{ 
public:
	class UBBQUI_MenuInputPrompt*                      BackBtn;                                                    // 0x03F0   (0x0008)  
	class UWidget*                                     DemoWidget;                                                 // 0x03F8   (0x0008)  
	TArray<FName>                                      AssociatedTutorials;                                        // 0x0400   (0x0010)  
	FName                                              TutorialScreenName;                                         // 0x0410   (0x0008)  
	class UBBQLobbyWidget*                             LobbyWidget;                                                // 0x0418   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_LobbyTab.SetTabParentStack
	void SetTabParentStack(ABBQScreenStack* Parent) // [0x1fb6c20] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(ABBQScreenStack*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Parent);
	}
	// Function /Script/BBQUI.BBQUI_LobbyTab.OnLobbyPointOfNoReturnReached
	void OnLobbyPointOfNoReturnReached() // [0x1fb6620] Native|Public        
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_LobbyTab.IsServerLobby
	bool IsServerLobby() // [0x1fb61b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_LobbyTab.BP_OnPlayerStateReady
	void BP_OnPlayerStateReady() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_LobbyTab.BP_OnLobbyPlayerDataChange
	// void BP_OnLobbyPlayerDataChange(TArray<FLobbyPlayerData>& PlayerData);                                                   // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
};

/// Class /Script/BBQUI.BBQUI_CharacterCosmetics
/// Size: 0x0590 (1424 bytes) (0x000420 - 0x000590) align 8 MaxSize: 0x0590
class UBBQUI_CharacterCosmetics : public UBBQUI_LobbyTab
{ 
public:
	unsigned char                                      UnknownData00_8[0x20];                                      // 0x0420   (0x0020)  MISSED
	class UBBQUI_MenuInputPrompt*                      SelectBtn;                                                  // 0x0440   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      SwapBtn;                                                    // 0x0448   (0x0008)  
	class UWidget*                                     BottomLine;                                                 // 0x0450   (0x0008)  
	class UBBQUI_TopBarMenu*                           SubTopBar;                                                  // 0x0458   (0x0008)  
	class UWidget*                                     CosmeticPanel;                                              // 0x0460   (0x0008)  
	class UWidget*                                     CosmeticsTabs;                                              // 0x0468   (0x0008)  
	class UBBQUI_CosmeticsOutfitsTab*                  OutfitsTab;                                                 // 0x0470   (0x0008)  
	class UBBQUI_CosmeticsOutfitsTab*                  WeaponsTab;                                                 // 0x0478   (0x0008)  
	FText                                              PurchasePromptText;                                         // 0x0480   (0x0018)  
	FText                                              EquipPromptText;                                            // 0x0498   (0x0018)  
	FBBQPopUpSpec                                      InaccessibleWeaponsTabPopUp;                                // 0x04B0   (0x00E0)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterCosmetics.OnSubTopBarTabChanged
	void OnSubTopBarTabChanged(int32_t NewTabIndex) // [0x1f97f90] Final|Native|Private 
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewTabIndex);
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterInformation
/// Size: 0x0318 (792 bytes) (0x000260 - 0x000318) align 8 MaxSize: 0x0318
class UBBQUI_CharacterInformation : public UUserWidget
{ 
public:
	class UTextBlock*                                  CharacterNameText;                                          // 0x0260   (0x0008)  
	class UTextBlock*                                  LevelValueText;                                             // 0x0268   (0x0008)  
	class UTextBlock*                                  DescriptionText;                                            // 0x0270   (0x0008)  
	class UTextBlock*                                  UpperAttributeLimitText;                                    // 0x0278   (0x0008)  
	class UTextBlock*                                  LowerAttributeLimitText;                                    // 0x0280   (0x0008)  
	class UBBQUI_TextBlock*                            XPTextBlock;                                                // 0x0288   (0x0008)  
	class UProgressBar*                                ExperienceProgressBar;                                      // 0x0290   (0x0008)  
	class UScrollBox*                                  DescriptionScrollBox;                                       // 0x0298   (0x0008)  
	TArray<class UBBQUI_CharacterAttribute*>           AttributeWidgets;                                           // 0x02A0   (0x0010)  
	class UWidget*                                     ContentPanel;                                               // 0x02B0   (0x0008)  
	class UWidget*                                     PurchasablePanel;                                           // 0x02B8   (0x0008)  
	class UWidget*                                     LockedPanel;                                                // 0x02C0   (0x0008)  
	class UWidget*                                     LevelPanel;                                                 // 0x02C8   (0x0008)  
	class UWidget*                                     ExperiencePanel;                                            // 0x02D0   (0x0008)  
	FText                                              DPLevelTextFormat;                                          // 0x02D8   (0x0018)  
	TWeakObjectPtr<class UAkAudioEvent*>               ScrollingAudio;                                             // 0x02F0   (0x0008)  
	unsigned char                                      UnknownData00_7[0x20];                                      // 0x02F8   (0x0020)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterInformation.OnUserScrolled
	void OnUserScrolled(float ScrollOffset) // [0x1f9d380] Final|Native|Private 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(ScrollOffset);
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterOutfitCard
/// Size: 0x04B8 (1208 bytes) (0x0003E8 - 0x0004B8) align 8 MaxSize: 0x04B8
class UBBQUI_CharacterOutfitCard : public UBBQUI_SelectableWidget
{ 
public:
	class UBBQUI_Image*                                OutfitImage;                                                // 0x03E8   (0x0008)  
	class UPanelWidget*                                LockedPanel;                                                // 0x03F0   (0x0008)  
	class UBBQUI_TextBlock*                            UnlockRequirement;                                          // 0x03F8   (0x0008)  
	class UPanelWidget*                                NewPanel;                                                   // 0x0400   (0x0008)  
	class UPanelWidget*                                PurchasablePanel;                                           // 0x0408   (0x0008)  
	class UBBQUI_Image*                                PurchasableIcon;                                            // 0x0410   (0x0008)  
	class UWidget*                                     LockedPrompt;                                               // 0x0418   (0x0008)  
	class UWidget*                                     Thumb;                                                      // 0x0420   (0x0008)  
	class UWidgetAnimation*                            EquipAnim;                                                  // 0x0428   (0x0008)  
	class UWidget*                                     PromptBox;                                                  // 0x0430   (0x0008)  
	class UBBQUI_TextBlock*                            PromptText;                                                 // 0x0438   (0x0008)  
	FText                                              PurchasePromptText;                                         // 0x0440   (0x0018)  
	FText                                              EquipPromptText;                                            // 0x0458   (0x0018)  
	class UBBQCharacterOutfit*                         MyOutfit;                                                   // 0x0470   (0x0008)  
	class UBBQChainsawSkin*                            MyWeapon;                                                   // 0x0478   (0x0008)  
	class UBBQUI_CosmeticsOutfitsTab*                  ParentTab;                                                  // 0x0480   (0x0008)  
	TWeakObjectPtr<class UAkAudioEvent*>               CardEquippedSound;                                          // 0x0488   (0x0008)  
	unsigned char                                      UnknownData00_7[0x28];                                      // 0x0490   (0x0028)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterOutfitCard.OnCardSelected
	void OnCardSelected() // [0x1f9cf70] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterOutfitCard.BP_OnUnEquipped
	void BP_OnUnEquipped() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterOutfitCard.BP_OnEquipped
	void BP_OnEquipped() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_PopUpWidget
/// Size: 0x0560 (1376 bytes) (0x0003C8 - 0x000560) align 8 MaxSize: 0x0560
class UBBQUI_PopUpWidget : public UBBQUI_MenuBase
{ 
public:
	TWeakObjectPtr<class UAkAudioEvent*>               OnAcceptSound;                                              // 0x03C8   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x03D0   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnCancelSound;                                              // 0x03F0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x03F8   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnShowPopupSound;                                           // 0x0418   (0x0008)  
	unsigned char                                      UnknownData02_6[0x20];                                      // 0x0420   (0x0020)  MISSED
	FBBQPopUpSpec                                      PopUpSpec;                                                  // 0x0440   (0x00E0)  
	class UBBQUI_MenuInputPrompt*                      Option1Prompt;                                              // 0x0520   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      Option2Prompt;                                              // 0x0528   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      Option3Prompt;                                              // 0x0530   (0x0008)  
	class UBBQUI_TextBlock*                            TitleText;                                                  // 0x0538   (0x0008)  
	class UBBQUI_TextBlock*                            MessageText;                                                // 0x0540   (0x0008)  
	unsigned char                                      UnknownData03_7[0x18];                                      // 0x0548   (0x0018)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_PopUpWidget.OnShowPopUp
	void OnShowPopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_PopUpWidget.OnPopUpInitialized
	void OnPopUpInitialized() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_PopUpWidget.OnHidePopUp
	void OnHidePopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_PopUpWidget.ClosePopUp
	void ClosePopUp(FName Result) // [0x1fc6f10] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(FName);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Result);
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterRequestPopUp
/// Size: 0x0820 (2080 bytes) (0x000560 - 0x000820) align 8 MaxSize: 0x0820
class UBBQUI_CharacterRequestPopUp : public UBBQUI_PopUpWidget
{ 
public:
	float                                              TimeoutSeconds;                                             // 0x0560   (0x0004)  
	float                                              AcceptingSeconds;                                           // 0x0564   (0x0004)  
	float                                              TimeToCloseResult;                                          // 0x0568   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x056C   (0x0004)  MISSED
	FDataTableRowHandle                                WhiteColour;                                                // 0x0570   (0x0010)  
	FDataTableRowHandle                                BlackColour;                                                // 0x0580   (0x0010)  
	FDataTableRowHandle                                RedColour;                                                  // 0x0590   (0x0010)  
	FDataTableRowHandle                                HighlightColour;                                            // 0x05A0   (0x0010)  
	SDK_UNDEFINED(80,571) /* TMap<EBBQUI_CharacterRequestPopUpState, TWeakObjectPtr<UTexture2D*>> */ __um(StatusIcons); // 0x05B0   (0x0050)  
	TMap<EBBQUI_CharacterRequestPopUpState, FText>     StatusTexts;                                                // 0x0600   (0x0050)  
	FText                                              RequesterSendMessage;                                       // 0x0650   (0x0018)  
	FText                                              RequesteeReceiveMessage;                                    // 0x0668   (0x0018)  
	FText                                              RequesterTitle;                                             // 0x0680   (0x0018)  
	FText                                              RequesteeTitle;                                             // 0x0698   (0x0018)  
	FText                                              Decline;                                                    // 0x06B0   (0x0018)  
	FText                                              Cancel;                                                     // 0x06C8   (0x0018)  
	FText                                              AcceptSwap;                                                 // 0x06E0   (0x0018)  
	FText                                              SendRequest;                                                // 0x06F8   (0x0018)  
	FText                                              TimeoutFormat;                                              // 0x0710   (0x0018)  
	class UBBQUI_PlayerAvatar*                         LocalPlayerAvatar;                                          // 0x0728   (0x0008)  
	class UBBQUI_TextBlock*                            LocalPlayerNameText;                                        // 0x0730   (0x0008)  
	class UBBQUI_Image*                                LocalCharacterImage;                                        // 0x0738   (0x0008)  
	class UBBQUI_Image*                                LocalCharacterNameBG;                                       // 0x0740   (0x0008)  
	class UBBQUI_TextBlock*                            LocalCharacterNameText;                                     // 0x0748   (0x0008)  
	class UBBQUI_PlatformIcon*                         LocalPlatformIcon;                                          // 0x0750   (0x0008)  
	class UBBQUI_PlayerAvatar*                         OtherPlayerAvatar;                                          // 0x0758   (0x0008)  
	class UBBQUI_TextBlock*                            OtherPlayerNameText;                                        // 0x0760   (0x0008)  
	class UBBQUI_Image*                                OtherCharacterImage;                                        // 0x0768   (0x0008)  
	class UBBQUI_Image*                                OtherCharacterNameBG;                                       // 0x0770   (0x0008)  
	class UBBQUI_TextBlock*                            OtherCharacterNameText;                                     // 0x0778   (0x0008)  
	class UBBQUI_PlatformIcon*                         OtherPlatformIcon;                                          // 0x0780   (0x0008)  
	class UBBQUI_Image*                                TopStatusBG;                                                // 0x0788   (0x0008)  
	class UBBQUI_Image*                                TopStatusIcon;                                              // 0x0790   (0x0008)  
	class UBBQUI_Image*                                SwapArrowsIcon;                                             // 0x0798   (0x0008)  
	class UBBQUI_Image*                                SwapArrowsCrossIcon;                                        // 0x07A0   (0x0008)  
	class UBBQUI_TextBlock*                            RequestStatusText;                                          // 0x07A8   (0x0008)  
	class UBBQUI_TextBlock*                            RequestTimeoutText;                                         // 0x07B0   (0x0008)  
	class UWidget*                                     AcceptingThrobber;                                          // 0x07B8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      CentreConfirmPrompt;                                        // 0x07C0   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      CentreCancelPrompt;                                         // 0x07C8   (0x0008)  
	unsigned char                                      UnknownData01_7[0x50];                                      // 0x07D0   (0x0050)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterRequestPopUp.UpdateTimeoutTime
	void UpdateTimeoutTime() // [0x1f9d460] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterRequestPopUp.RequestAccepted
	void RequestAccepted() // [0x1f9d420] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterSelection
/// Size: 0x06A0 (1696 bytes) (0x000420 - 0x0006A0) align 8 MaxSize: 0x06A0
class UBBQUI_CharacterSelection : public UBBQUI_LobbyTab
{ 
public:
	unsigned char                                      UnknownData00_8[0x20];                                      // 0x0420   (0x0020)  MISSED
	class UBBQUI_MenuPromptBar*                        BottomPromptBar;                                            // 0x0440   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      SelectBtn;                                                  // 0x0448   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      RequestBtn;                                                 // 0x0450   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      PurchaseBtn;                                                // 0x0458   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      ScrollBtn;                                                  // 0x0460   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      SwapBtn;                                                    // 0x0468   (0x0008)  
	class UWidget*                                     Victims;                                                    // 0x0470   (0x0008)  
	class UWidget*                                     VictimsBox;                                                 // 0x0478   (0x0008)  
	class UWidget*                                     Family;                                                     // 0x0480   (0x0008)  
	class UWidget*                                     FamilyBox;                                                  // 0x0488   (0x0008)  
	class UBBQUI_CharacterSelectionCard*               HoveredCard;                                                // 0x0490   (0x0008)  
	FBBQPopUpSpec                                      ContentStorePopUpSpec;                                      // 0x0498   (0x00E0)  
	FBBQPopUpSpec                                      ContentStoreExpandedPopUpSpec;                              // 0x0578   (0x00E0)  
	class UBBQUI_CharacterCardsContainer*              VictimsCardsContainer;                                      // 0x0658   (0x0008)  
	class UBBQUI_CharacterCardsContainer*              FamilyCardsContainer;                                       // 0x0660   (0x0008)  
	class UScrollBox*                                  VictimScrollBox;                                            // 0x0668   (0x0008)  
	class UBBQUI_CharacterInformation*                 CharacterInfo;                                              // 0x0670   (0x0008)  
	class UBBQUI_CharacterCardsContainer*              SelectedCardsContainer;                                     // 0x0678   (0x0008)  
	unsigned char                                      UnknownData01_7[0x20];                                      // 0x0680   (0x0020)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterSelection.RefreshPrompts
	void RefreshPrompts() // [0x1f9d400] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.OnPlayerStateChanged
	void OnPlayerStateChanged(ABBQPlayerState* PlayerState) // [0x1f9d2f0] Final|Native|Private 
	{
		typedef void (*FuncPtr)(ABBQPlayerState*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(PlayerState);
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.OnCharacterAssigned
	void OnCharacterAssigned(FString CharacterName) // [0x1f9cf90] Final|Native|Private 
	{
		typedef void (*FuncPtr)(FString);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(CharacterName);
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.GetSelectedCard
	UBBQUI_CharacterSelectionCard* GetSelectedCard() // [0x1f9cf10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_CharacterSelectionCard* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.GetEquippedCard
	UBBQUI_CharacterSelectionCard* GetEquippedCard() // [0x1f9cee0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class UBBQUI_CharacterSelectionCard* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.BP_OnInput_RightThumbstickY
	void BP_OnInput_RightThumbstickY(float& Axis) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Axis);
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.BP_OnInput_PrimaryMisc
	void BP_OnInput_PrimaryMisc() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.BP_OnCharacterCardSelected
	void BP_OnCharacterCardSelected(UBBQUI_CharacterSelectionCard* NewSelectedCard) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UBBQUI_CharacterSelectionCard*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(NewSelectedCard);
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.BP_OnCharacterCardHoverChanged
	void BP_OnCharacterCardHoverChanged(UBBQUI_CharacterSelectionCard* NewHoveredCard) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UBBQUI_CharacterSelectionCard*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(NewHoveredCard);
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelection.BP_OnCharacterCardEquipped
	void BP_OnCharacterCardEquipped(FPlayerSetup& CharacterData) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FPlayerSetup&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(CharacterData);
	}
};

/// Class /Script/BBQUI.BBQUI_CharacterSelectionCard
/// Size: 0x09E0 (2528 bytes) (0x0003E8 - 0x0009E0) align 8 MaxSize: 0x09E0
class UBBQUI_CharacterSelectionCard : public UBBQUI_SelectableWidget
{ 
public:
	class UImage*                                      CharacterImage;                                             // 0x03E8   (0x0008)  
	class UTextBlock*                                  LevelText;                                                  // 0x03F0   (0x0008)  
	class UPanelWidget*                                NewPanel;                                                   // 0x03F8   (0x0008)  
	class UPanelWidget*                                PurchasablePanel;                                           // 0x0400   (0x0008)  
	class UBBQUI_Image*                                LockImage;                                                  // 0x0408   (0x0008)  
	class UWidget*                                     ReadyIconPanel;                                             // 0x0410   (0x0008)  
	class UBBQUI_PlayerAvatar*                         PlayerAvatar;                                               // 0x0418   (0x0008)  
	class UWidgetAnimation*                            EquipAnim;                                                  // 0x0420   (0x0008)  
	class UWidgetAnimation*                            AnotherPlayerEquipAnim;                                     // 0x0428   (0x0008)  
	FBBQCharacterCardData                              CurrentCharacterData;                                       // 0x0430   (0x05A0)  
	class ABBQPlayerState*                             OwningPlayerState;                                          // 0x09D0   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x09D8   (0x0008)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CharacterSelectionCard.IsVictimCharacter
	bool IsVictimCharacter() // [0x1f9cf40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelectionCard.CanBeEquipped
	bool CanBeEquipped() // [0x1f9ce10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelectionCard.BP_OnUnEquipped
	void BP_OnUnEquipped() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CharacterSelectionCard.BP_OnEquipped
	void BP_OnEquipped() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_VictimStatusBar
/// Size: 0x0320 (800 bytes) (0x000260 - 0x000320) align 8 MaxSize: 0x0320
class UBBQUI_VictimStatusBar : public UUserWidget
{ 
public:
	class UProgressBar*                                StatusProgressBar;                                          // 0x0260   (0x0008)  
	FDataTableRowHandle                                FillColor;                                                  // 0x0268   (0x0010)  
	FDataTableRowHandle                                DebuffColor;                                                // 0x0278   (0x0010)  
	FGameplayAttribute                                 StatusAttribute;                                            // 0x0288   (0x0038)  
	FGameplayAttribute                                 MaxStatusValueAttribute;                                    // 0x02C0   (0x0038)  
	FGameplayTagContainer                              DebuffTags;                                                 // 0x02F8   (0x0020)  
	class ABBQBaseCharacter*                           LastBindedCharacter;                                        // 0x0318   (0x0008)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_VictimStatusBar.OnPawnPossesed
	void OnPawnPossesed(APawn* Pawn) // [0x1fdf630] Final|Native|Private 
	{
		typedef void (*FuncPtr)(APawn*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Pawn);
	}
	// Function /Script/BBQUI.BBQUI_VictimStatusBar.InitializeWidget
	void InitializeWidget() // [0x1fdecd0] Final|Native|Protected|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_VictimStatusBar.GetCharacter
	ABBQBaseCharacter* GetCharacter() // [0x1fa4c50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef class ABBQBaseCharacter* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
	// Function /Script/BBQUI.BBQUI_VictimStatusBar.BP_ShowDebuff
	void BP_ShowDebuff(bool bShow) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(bShow);
	}
	// Function /Script/BBQUI.BBQUI_VictimStatusBar.BP_OnStatusAttributeChanged
	void BP_OnStatusAttributeChanged() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_ChunkedStaminaBar
/// Size: 0x0370 (880 bytes) (0x000320 - 0x000370) align 8 MaxSize: 0x0370
class UBBQUI_ChunkedStaminaBar : public UBBQUI_VictimStatusBar
{ 
public:
	class UHorizontalBox*                              BarsContainer;                                              // 0x0320   (0x0008)  
	class UBBQUI_Image*                                Glow;                                                       // 0x0328   (0x0008)  
	class UBBQUI_Image*                                Marker;                                                     // 0x0330   (0x0008)  
	float                                              PreviewMarkerPosition;                                      // 0x0338   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x033C   (0x0004)  MISSED
	class UClass*                                      ProgressBarChunkClass;                                      // 0x0340   (0x0008)  
	float                                              BarLeftPadding;                                             // 0x0348   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x034C   (0x0004)  MISSED
	FDataTableRowHandle                                ConsumptionColor;                                           // 0x0350   (0x0010)  
	unsigned char                                      UnknownData02_7[0x10];                                      // 0x0360   (0x0010)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_ChunkedStaminaBar.BP_OnMaxValueReached
	void BP_OnMaxValueReached() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_CodeInviteButton
/// Size: 0x02B8 (696 bytes) (0x000260 - 0x0002B8) align 8 MaxSize: 0x02B8
class UBBQUI_CodeInviteButton : public UUserWidget
{ 
public:
	class UButton*                                     CodeInviteButton;                                           // 0x0260   (0x0008)  
	class UBBQUI_TextBlock*                            InviteCodeText;                                             // 0x0268   (0x0008)  
	class UWidget*                                     ClipboardIcon;                                              // 0x0270   (0x0008)  
	class UBBQUI_Image*                                ClipboardImage;                                             // 0x0278   (0x0008)  
	class UBBQUI_Image*                                CodeInviteBrushImage;                                       // 0x0280   (0x0008)  
	FDataTableRowHandle                                HighlightRowHandle;                                         // 0x0288   (0x0010)  
	FDataTableRowHandle                                HighlightClickedRowHandle;                                  // 0x0298   (0x0010)  
	FDataTableRowHandle                                WhiteRowHandle;                                             // 0x02A8   (0x0010)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_CodeInviteButton.OnCodeInviteUnhovered
	void OnCodeInviteUnhovered() // [0x1f9d0e0] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CodeInviteButton.OnCodeInviteReleased
	void OnCodeInviteReleased() // [0x1f9d0a0] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CodeInviteButton.OnCodeInvitePressed
	void OnCodeInvitePressed() // [0x1f9d0c0] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CodeInviteButton.OnCodeInviteHovered
	void OnCodeInviteHovered() // [0x1f9d0a0] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CodeInviteButton.OnCodeInviteClicked
	void OnCodeInviteClicked() // [0x1f9d080] Final|Native|Private 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_CodeInviteInputBox
/// Size: 0x02E8 (744 bytes) (0x000260 - 0x0002E8) align 8 MaxSize: 0x02E8
class UBBQUI_CodeInviteInputBox : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x10];                                      // 0x0260   (0x0010)  MISSED
	class UEditableTextBox*                            CodeInviteInputText;                                        // 0x0270   (0x0008)  
	class UWidget*                                     CodeInviteInputBox;                                         // 0x0278   (0x0008)  
	class UWidget*                                     InvalidCodeBox;                                             // 0x0280   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      EditInviteCodePrompt;                                       // 0x0288   (0x0008)  
	FDataTableRowHandle                                BlackRowHandle;                                             // 0x0290   (0x0010)  
	FDataTableRowHandle                                RedRowHandle;                                               // 0x02A0   (0x0010)  
	TWeakObjectPtr<class UAkAudioEvent*>               OnTextChangedAudio;                                         // 0x02B0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x02B8   (0x0020)  MISSED
	int32_t                                            CharacterCountLimit;                                        // 0x02D8   (0x0004)  
	unsigned char                                      UnknownData02_7[0xC];                                       // 0x02DC   (0x000C)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CodeInviteInputBox.OnInviteTextCommited
	// void OnInviteTextCommited(FText& Text, TEnumAsByte<ETextCommit> CommitMethod);                                           // [0x1f9d1d0] Final|Native|Private|HasOutParms 
	// Function /Script/BBQUI.BBQUI_CodeInviteInputBox.OnInviteTextChanged
	void OnInviteTextChanged(FText& Text) // [0x1f9d100] Final|Native|Private|HasOutParms 
	{
		typedef void (*FuncPtr)(FText&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Text);
	}
};

/// Class /Script/BBQUI.BBQUI_CommunityNews
/// Size: 0x0440 (1088 bytes) (0x0003C8 - 0x000440) align 8 MaxSize: 0x0440
class UBBQUI_CommunityNews : public UBBQUI_MenuBase
{ 
public:
	class UScrollBox*                                  NewsScrollBox;                                              // 0x03C8   (0x0008)  
	class UBBQUI_MenuInputPrompt*                      OkBtn;                                                      // 0x03D0   (0x0008)  
	float                                              InputScrollMultiplier;                                      // 0x03D8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x03DC   (0x0004)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnShowAudio;                                                // 0x03E0   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x03E8   (0x0020)  MISSED
	TWeakObjectPtr<class UAkAudioEvent*>               OnHideAudio;                                                // 0x0408   (0x0008)  
	unsigned char                                      UnknownData02_7[0x30];                                      // 0x0410   (0x0030)  MISSED


	/// Functions
	// Function /Script/BBQUI.BBQUI_CommunityNews.OnNewsDownloadError
	void OnNewsDownloadError() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Script/BBQUI.BBQUI_CommunityNews.OnNewsDownloadComplete
	void OnNewsDownloadComplete(FString& NewsText) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FString&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(NewsText);
	}
	// Function /Script/BBQUI.BBQUI_CommunityNews.DownloadNews
	void DownloadNews(bool bSkipIfExists) // [0x1f9ce50] Final|Native|Private|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(bSkipIfExists);
	}
	// Function /Script/BBQUI.BBQUI_CommunityNews.BP_OnConfirmed
	void BP_OnConfirmed() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_ContentStoreIcon
/// Size: 0x02D8 (728 bytes) (0x000260 - 0x0002D8) align 8 MaxSize: 0x02D8
class UBBQUI_ContentStoreIcon : public UUserWidget
{ 
public:
	TWeakObjectPtr<class UTexture2D*>                  XboxStoreIcon;                                              // 0x0260   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0268   (0x0020)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  SteamStoreIcon;                                             // 0x0288   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0290   (0x0020)  MISSED
	class UBBQUI_Image*                                IconImage;                                                  // 0x02B0   (0x0008)  
	class UBBQUI_TextBlock*                            OpenStoreText;                                              // 0x02B8   (0x0008)  
	FVector2D                                          SmallerSize;                                                // 0x02C0   (0x0008)  
	FVector2D                                          BiggerSize;                                                 // 0x02C8   (0x0008)  
	bool                                               bIsSmallerSize;                                             // 0x02D0   (0x0001)  
	bool                                               bHideForPlayStation;                                        // 0x02D1   (0x0001)  
	unsigned char                                      UnknownData02_7[0x6];                                       // 0x02D2   (0x0006)  MISSED
};

/// Class /Script/BBQUI.BBQUI_ControlsDataAsset
/// Size: 0x0060 (96 bytes) (0x000030 - 0x000060) align 8 MaxSize: 0x0060
class UBBQUI_ControlsDataAsset : public UDataAsset
{ 
public:
	TArray<FControlsPresetData>                        ControlsPresetsVictims;                                     // 0x0030   (0x0010)  
	TArray<FControlsPresetData>                        ControlsPresetsFamily;                                      // 0x0040   (0x0010)  
	TArray<FControlsPresetData>                        ControlsPresetsLeatherFace;                                 // 0x0050   (0x0010)  


	/// Functions
	// Function /Script/BBQUI.BBQUI_ControlsDataAsset.SetupControlsPresetsData
	void SetupControlsPresetsData() // [0x1f9d440] Final|Native|Public  
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
};

/// Class /Script/BBQUI.BBQUI_ControlsDisplayWidget
/// Size: 0x0418 (1048 bytes) (0x0003F0 - 0x000418) align 8 MaxSize: 0x0418
class UBBQUI_ControlsDisplayWidget : public UBBQUI_TopBarMenuWidget
{ 
public:
