
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "InputCore.h"
#include "Slate.h"

#pragma pack(push, 0x1)

class UEnhancedInputActionDelegateBinding;
class UEnhancedInputActionValueBinding;
class UEnhancedInputComponent;
class UEnhancedInputEngineSubsystem;
class UEnhancedInputLibrary;
class UEnhancedInputLocalPlayerSubsystem;
class UEnhancedInputSubsystemInterface;
class UEnhancedPlayerInput;
class UInputAction;
class UInputDebugKeyDelegateBinding;
class UInputMappingContext;
class UInputModifier;
class UInputModifierCollection;
class UInputModifierDeadZone;
class UInputModifierFOVScaling;
class UInputModifierNegate;
class UInputModifierResponseCurveExponential;
class UInputModifierResponseCurveUser;
class UInputModifierScalar;
class UInputModifierSmooth;
class UInputModifierSwizzleAxis;
class UInputModifierToWorldSpace;
class UInputTrigger;
class UInputTriggerChordAction;
class UInputTriggerChordBlocker;
class UInputTriggerDown;
class UInputTriggerHold;
class UInputTriggerHoldAndRelease;
class UInputTriggerPressed;
class UInputTriggerPulse;
class UInputTriggerReleased;
class UInputTriggerTap;
class UInputTriggerTimedBase;

/// Enum /Script/EnhancedInput.EInputActionValueType
/// Size: 0x01 (1 bytes)
enum class EInputActionValueType : uint8_t
{
	EInputActionValueType__Boolean                                                   = 0,
	EInputActionValueType__Axis1D                                                    = 1,
	EInputActionValueType__Axis2D                                                    = 2,
	EInputActionValueType__Axis3D                                                    = 3
};

/// Enum /Script/EnhancedInput.EMappingQueryIssue
/// Size: 0x01 (1 bytes)
enum class EMappingQueryIssue : uint8_t
{
	EMappingQueryIssue__NoIssue                                                      = 0,
	EMappingQueryIssue__ReservedByAction                                             = 1,
	EMappingQueryIssue__HidesExistingMapping                                         = 2,
	EMappingQueryIssue__HiddenByExistingMapping                                      = 4,
	EMappingQueryIssue__CollisionWithMappingInSameContext                            = 8,
	EMappingQueryIssue__ForcesTypePromotion                                          = 16,
	EMappingQueryIssue__ForcesTypeDemotion                                           = 32
};

/// Enum /Script/EnhancedInput.EMappingQueryResult
/// Size: 0x01 (1 bytes)
enum class EMappingQueryResult : uint8_t
{
	EMappingQueryResult__Error_EnhancedInputNotEnabled                               = 0,
	EMappingQueryResult__Error_InputContextNotInActiveContexts                       = 1,
	EMappingQueryResult__Error_InvalidAction                                         = 2,
	EMappingQueryResult__NotMappable                                                 = 3,
	EMappingQueryResult__MappingAvailable                                            = 4
};

/// Enum /Script/EnhancedInput.EInputAxisSwizzle
/// Size: 0x01 (1 bytes)
enum class EInputAxisSwizzle : uint8_t
{
	EInputAxisSwizzle__YXZ                                                           = 0,
	EInputAxisSwizzle__ZYX                                                           = 1,
	EInputAxisSwizzle__XZY                                                           = 2,
	EInputAxisSwizzle__YZX                                                           = 3,
	EInputAxisSwizzle__ZXY                                                           = 4
};

/// Enum /Script/EnhancedInput.EFOVScalingType
/// Size: 0x01 (1 bytes)
enum class EFOVScalingType : uint8_t
{
	EFOVScalingType__Standard                                                        = 0,
	EFOVScalingType__UE4_BackCompat                                                  = 1
};

/// Enum /Script/EnhancedInput.EDeadZoneType
/// Size: 0x01 (1 bytes)
enum class EDeadZoneType : uint8_t
{
	EDeadZoneType__Axial                                                             = 0,
	EDeadZoneType__Radial                                                            = 1
};

/// Enum /Script/EnhancedInput.EModifierExecutionPhase
/// Size: 0x01 (1 bytes)
enum class EModifierExecutionPhase : uint8_t
{
	EModifierExecutionPhase__PerInput                                                = 0,
	EModifierExecutionPhase__FinalValue                                              = 1,
	EModifierExecutionPhase__NumPhases                                               = 2
};

/// Enum /Script/EnhancedInput.ETriggerType
/// Size: 0x01 (1 bytes)
enum class ETriggerType : uint8_t
{
	ETriggerType__Explicit                                                           = 0,
	ETriggerType__Implicit                                                           = 1,
	ETriggerType__Blocker                                                            = 2
};

/// Enum /Script/EnhancedInput.ETriggerEvent
/// Size: 0x01 (1 bytes)
enum class ETriggerEvent : uint8_t
{
	ETriggerEvent__None                                                              = 0,
	ETriggerEvent__Started                                                           = 1,
	ETriggerEvent__Ongoing                                                           = 2,
	ETriggerEvent__Canceled                                                          = 3,
	ETriggerEvent__Triggered                                                         = 4,
	ETriggerEvent__Completed                                                         = 5
};

/// Enum /Script/EnhancedInput.ETriggerState
/// Size: 0x01 (1 bytes)
enum class ETriggerState : uint8_t
{
	ETriggerState__None                                                              = 0,
	ETriggerState__Ongoing                                                           = 1,
	ETriggerState__Triggered                                                         = 2
};

/// Struct /Script/EnhancedInput.BlueprintEnhancedInputActionBinding
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FBlueprintEnhancedInputActionBinding
{ 
	class UInputAction*                                InputAction;                                                // 0x0000   (0x0008)  
	ETriggerEvent                                      TriggerEvent;                                               // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	FName                                              FunctionNameToBind;                                         // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/EnhancedInput.EnhancedActionKeyMapping
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FEnhancedActionKeyMapping
{ 
	class UInputAction*                                Action;                                                     // 0x0000   (0x0008)  
	FKey                                               Key;                                                        // 0x0008   (0x0018)  
	TArray<class UInputTrigger*>                       Triggers;                                                   // 0x0020   (0x0010)  
	TArray<class UInputModifier*>                      Modifiers;                                                  // 0x0030   (0x0010)  
};

/// Struct /Script/EnhancedInput.InputActionInstance
/// Size: 0x0070 (112 bytes) (0x000000 - 0x000070) align 8 MaxSize: 0x0070
struct FInputActionInstance
{ 
	class UInputAction*                                SourceAction;                                               // 0x0000   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0008   (0x0008)  MISSED
	TArray<class UInputTrigger*>                       Triggers;                                                   // 0x0010   (0x0010)  
	TArray<class UInputModifier*>                      Modifiers;                                                  // 0x0020   (0x0010)  
	TArray<class UInputModifier*>                      PerInputModifiers;                                          // 0x0030   (0x0010)  
	TArray<class UInputModifier*>                      FinalValueModifiers;                                        // 0x0040   (0x0010)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0050   (0x0010)  MISSED
	float                                              ElapsedProcessedTime;                                       // 0x0060   (0x0004)  
	float                                              ElapsedTriggeredTime;                                       // 0x0064   (0x0004)  
	ETriggerEvent                                      TriggerEvent;                                               // 0x0068   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Struct /Script/EnhancedInput.BlueprintInputDebugKeyDelegateBinding
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 MaxSize: 0x0030
struct FBlueprintInputDebugKeyDelegateBinding
{ 
	FInputChord                                        InputChord;                                                 // 0x0000   (0x0020)  
	TEnumAsByte<EInputEvent>                           InputKeyEvent;                                              // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0021   (0x0003)  MISSED
	FName                                              FunctionNameToBind;                                         // 0x0024   (0x0008)  
	bool                                               bExecuteWhenPaused;                                         // 0x002C   (0x0001)  
	unsigned char                                      UnknownData01_7[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Struct /Script/EnhancedInput.InputActionValue
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FInputActionValue
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/EnhancedInput.MappingQueryIssue
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FMappingQueryIssue
{ 
	EMappingQueryIssue                                 Issue;                                                      // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	class UInputMappingContext*                        BlockingContext;                                            // 0x0008   (0x0008)  
	class UInputAction*                                BlockingAction;                                             // 0x0010   (0x0008)  
};

/// Class /Script/EnhancedInput.EnhancedInputActionDelegateBinding
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UEnhancedInputActionDelegateBinding : public UInputDelegateBinding
{ 
public:
	TArray<FBlueprintEnhancedInputActionBinding>       InputActionDelegateBindings;                                // 0x0028   (0x0010)  
};

/// Class /Script/EnhancedInput.EnhancedInputActionValueBinding
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UEnhancedInputActionValueBinding : public UInputDelegateBinding
{ 
public:
	TArray<FBlueprintEnhancedInputActionBinding>       InputActionValueBindings;                                   // 0x0028   (0x0010)  
};

/// Class /Script/EnhancedInput.EnhancedInputComponent
/// Size: 0x0168 (360 bytes) (0x000138 - 0x000168) align 8 MaxSize: 0x0168
class UEnhancedInputComponent : public UInputComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x30];                                      // 0x0138   (0x0030)  MISSED


	/// Functions
	// Function /Script/EnhancedInput.EnhancedInputComponent.GetBoundActionValue
	FInputActionValue GetBoundActionValue(UInputAction* Action) // [0x113bb70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef FInputActionValue (*FuncPtr)(UInputAction*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Action);
	}
};

/// Class /Script/EnhancedInput.EnhancedInputLibrary
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UEnhancedInputLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/EnhancedInput.EnhancedInputLibrary.RequestRebuildControlMappingsUsingContext
	void RequestRebuildControlMappingsUsingContext(UInputMappingContext* Context, bool bForceImmediately) // [0x113cb70] Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UInputMappingContext*, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Context, bForceImmediately);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.MakeInputActionValue
	FInputActionValue MakeInputActionValue(float X, float Y, float Z, FInputActionValue& MatchValueType) // [0x113bfe0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	{
		typedef FInputActionValue (*FuncPtr)(float, float, float, FInputActionValue&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(X, Y, Z, MatchValueType);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.GetBoundActionValue
	FInputActionValue GetBoundActionValue(AActor* Actor, UInputAction* Action) // [0x113bc10] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef FInputActionValue (*FuncPtr)(AActor*, UInputAction*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func(Actor, Action);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToBool
	bool Conv_InputActionValueToBool(FInputActionValue InValue) // [0x113bad0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef bool (*FuncPtr)(FInputActionValue);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(InValue);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis3D
	FVector Conv_InputActionValueToAxis3D(FInputActionValue ActionValue) // [0x113ba20] Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	{
		typedef FVector (*FuncPtr)(FInputActionValue);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		return func(ActionValue);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis2D
	FVector2D Conv_InputActionValueToAxis2D(FInputActionValue InValue) // [0x113b970] Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	{
		typedef FVector2D (*FuncPtr)(FInputActionValue);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(InValue);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis1D
	float Conv_InputActionValueToAxis1D(FInputActionValue InValue) // [0x113b8d0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	{
		typedef float (*FuncPtr)(FInputActionValue);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(InValue);
	}
	// Function /Script/EnhancedInput.EnhancedInputLibrary.BreakInputActionValue
	void BreakInputActionValue(FInputActionValue InActionValue, float& X, float& Y, float& Z) // [0x113b710] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	{
		typedef void (*FuncPtr)(FInputActionValue, float&, float&, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(InActionValue, X, Y, Z);
	}
};

/// Class /Script/EnhancedInput.EnhancedInputSubsystemInterface
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UEnhancedInputSubsystemInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.RequestRebuildControlMappings
	void RequestRebuildControlMappings(bool bForceImmediately) // [0x113cae0] BlueprintCosmetic|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(bForceImmediately);
	}
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.RemoveMappingContext
	void RemoveMappingContext(UInputMappingContext* MappingContext) // [0x113ca50] BlueprintCosmetic|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UInputMappingContext*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(MappingContext);
	}
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInContextSet
	// EMappingQueryResult QueryMapKeyInContextSet(TArray<UInputMappingContext*>& PrioritizedActiveContexts, UInputMappingContext* InputContext, UInputAction* Action, FKey Key, TArray<FMappingQueryIssue>& OutIssues, EMappingQueryIssue BlockingIssues); // [0x113c7e0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInActiveContextSet
	// EMappingQueryResult QueryMapKeyInActiveContextSet(UInputMappingContext* InputContext, UInputAction* Action, FKey Key, TArray<FMappingQueryIssue>& OutIssues, EMappingQueryIssue BlockingIssues); // [0x113c5d0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.QueryKeysMappedToAction
	// TArray<FKey> QueryKeysMappedToAction(UInputAction* Action);                                                              // [0x113c460] BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.HasMappingContext
	bool HasMappingContext(UInputMappingContext* MappingContext) // [0x113be80] BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)(UInputMappingContext*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		return func(MappingContext);
	}
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.ClearAllMappings
	void ClearAllMappings() // [0x113b8b0] BlueprintCosmetic|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Script/EnhancedInput.EnhancedInputSubsystemInterface.AddMappingContext
	void AddMappingContext(UInputMappingContext* MappingContext, int32_t Priority) // [0x113b640] BlueprintCosmetic|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UInputMappingContext*, int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(MappingContext, Priority);
	}
};

/// Class /Script/EnhancedInput.EnhancedInputLocalPlayerSubsystem
/// Size: 0x00E0 (224 bytes) (0x000030 - 0x0000E0) align 8 MaxSize: 0x00E0
class UEnhancedInputLocalPlayerSubsystem : public ULocalPlayerSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0xB0];                                      // 0x0030   (0x00B0)  MISSED
};

/// Class /Script/EnhancedInput.EnhancedInputEngineSubsystem
/// Size: 0x00E8 (232 bytes) (0x000030 - 0x0000E8) align 8 MaxSize: 0x00E8
class UEnhancedInputEngineSubsystem : public UEngineSubsystem
{ 
public:
	unsigned char                                      UnknownData00_8[0xB0];                                      // 0x0030   (0x00B0)  MISSED
	class UEnhancedPlayerInput*                        PlayerInput;                                                // 0x00E0   (0x0008)  
};

/// Class /Script/EnhancedInput.EnhancedPlayerInput
/// Size: 0x0598 (1432 bytes) (0x0003A8 - 0x000598) align 8 MaxSize: 0x0598
class UEnhancedPlayerInput : public UPlayerInput
{ 
public:
	TMap<class UInputMappingContext*, int32_t>         AppliedInputContexts;                                       // 0x03A8   (0x0050)  
	TArray<FEnhancedActionKeyMapping>                  EnhancedActionMappings;                                     // 0x03F8   (0x0010)  
	unsigned char                                      UnknownData00_6[0x50];                                      // 0x0408   (0x0050)  MISSED
	TMap<class UInputAction*, FInputActionInstance>    ActionInstanceData;                                         // 0x0458   (0x0050)  
	unsigned char                                      UnknownData01_7[0xF0];                                      // 0x04A8   (0x00F0)  MISSED
};

/// Class /Script/EnhancedInput.InputAction
/// Size: 0x0058 (88 bytes) (0x000030 - 0x000058) align 8 MaxSize: 0x0058
class UInputAction : public UDataAsset
{ 
public:
	bool                                               bConsumeInput;                                              // 0x0030   (0x0001)  
	bool                                               bTriggerWhenPaused;                                         // 0x0031   (0x0001)  
	bool                                               bReserveAllMappings;                                        // 0x0032   (0x0001)  
	EInputActionValueType                              ValueType;                                                  // 0x0033   (0x0001)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	TArray<class UInputTrigger*>                       Triggers;                                                   // 0x0038   (0x0010)  
	TArray<class UInputModifier*>                      Modifiers;                                                  // 0x0048   (0x0010)  
};

/// Class /Script/EnhancedInput.InputDebugKeyDelegateBinding
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UInputDebugKeyDelegateBinding : public UInputDelegateBinding
{ 
public:
	TArray<FBlueprintInputDebugKeyDelegateBinding>     InputDebugKeyDelegateBindings;                              // 0x0028   (0x0010)  
};

/// Class /Script/EnhancedInput.InputMappingContext
/// Size: 0x0058 (88 bytes) (0x000030 - 0x000058) align 8 MaxSize: 0x0058
class UInputMappingContext : public UDataAsset
{ 
public:
	TArray<FEnhancedActionKeyMapping>                  Mappings;                                                   // 0x0030   (0x0010)  
	FText                                              ContextDescription;                                         // 0x0040   (0x0018)  


	/// Functions
	// Function /Script/EnhancedInput.InputMappingContext.UnmapKey
	void UnmapKey(UInputAction* Action, FKey Key) // [0x113cce0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UInputAction*, FKey);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Action, Key);
	}
	// Function /Script/EnhancedInput.InputMappingContext.UnmapAll
	void UnmapAll() // [0x113ccc0] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Script/EnhancedInput.InputMappingContext.UnmapAction
	void UnmapAction(UInputAction* Action) // [0x113cc30] Final|Native|Public|BlueprintCallable 
	{
		typedef void (*FuncPtr)(UInputAction*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Action);
	}
	// Function /Script/EnhancedInput.InputMappingContext.MapKey
	FEnhancedActionKeyMapping MapKey(UInputAction* Action, FKey ToKey) // [0x113c180] Final|Native|Public|BlueprintCallable 
	{
		typedef FEnhancedActionKeyMapping (*FuncPtr)(UInputAction*, FKey);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		return func(Action, ToKey);
	}
};

/// Class /Script/EnhancedInput.InputModifier
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UInputModifier : public UObject
{ 
public:


	/// Functions
	// Function /Script/EnhancedInput.InputModifier.ModifyRaw
	FInputActionValue ModifyRaw(UEnhancedPlayerInput* PlayerInput, FInputActionValue CurrentValue, float DeltaTime) // [0x113c2f0] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef FInputActionValue (*FuncPtr)(UEnhancedPlayerInput*, FInputActionValue, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(PlayerInput, CurrentValue, DeltaTime);
	}
	// Function /Script/EnhancedInput.InputModifier.GetVisualizationColor
	FLinearColor GetVisualizationColor(FInputActionValue SampleValue, FInputActionValue FinalValue) // [0x113bd50] Native|Event|Public|HasDefaults|BlueprintEvent|Const 
	{
		typedef FLinearColor (*FuncPtr)(FInputActionValue, FInputActionValue);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(SampleValue, FinalValue);
	}
	// Function /Script/EnhancedInput.InputModifier.GetExecutionPhase
	EModifierExecutionPhase GetExecutionPhase() // [0x113bcf0] Native|Event|Public|BlueprintEvent|Const 
	{
		typedef EModifierExecutionPhase (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
};

/// Class /Script/EnhancedInput.InputModifierDeadZone
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UInputModifierDeadZone : public UInputModifier
{ 
public:
	float                                              LowerThreshold;                                             // 0x0028   (0x0004)  
	float                                              UpperThreshold;                                             // 0x002C   (0x0004)  
	EDeadZoneType                                      Type;                                                       // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierScalar
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UInputModifierScalar : public UInputModifier
{ 
public:
	FVector                                            Scalar;                                                     // 0x0028   (0x000C)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierNegate
/// Size: 0x0030 (48 bytes) (0x000028 - 0x000030) align 8 MaxSize: 0x0030
class UInputModifierNegate : public UInputModifier
{ 
public:
	bool                                               bX;                                                         // 0x0028   (0x0001)  
	bool                                               bY;                                                         // 0x0029   (0x0001)  
	bool                                               bZ;                                                         // 0x002A   (0x0001)  
	unsigned char                                      UnknownData00_7[0x5];                                       // 0x002B   (0x0005)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierSmooth
/// Size: 0x0048 (72 bytes) (0x000028 - 0x000048) align 8 MaxSize: 0x0048
class UInputModifierSmooth : public UInputModifier
{ 
public:
	unsigned char                                      UnknownData00_1[0x20];                                      // 0x0028   (0x0020)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierResponseCurveExponential
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000038) align 8 MaxSize: 0x0038
class UInputModifierResponseCurveExponential : public UInputModifier
{ 
public:
	FVector                                            CurveExponent;                                              // 0x0028   (0x000C)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierResponseCurveUser
/// Size: 0x0040 (64 bytes) (0x000028 - 0x000040) align 8 MaxSize: 0x0040
class UInputModifierResponseCurveUser : public UInputModifier
{ 
public:
	class UCurveFloat*                                 ResponseX;                                                  // 0x0028   (0x0008)  
	class UCurveFloat*                                 ResponseY;                                                  // 0x0030   (0x0008)  
	class UCurveFloat*                                 ResponseZ;                                                  // 0x0038   (0x0008)  
};

/// Class /Script/EnhancedInput.InputModifierFOVScaling
/// Size: 0x0030 (48 bytes) (0x000028 - 0x000030) align 8 MaxSize: 0x0030
class UInputModifierFOVScaling : public UInputModifier
{ 
public:
	float                                              FOVScale;                                                   // 0x0028   (0x0004)  
	EFOVScalingType                                    FOVScalingType;                                             // 0x002C   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierToWorldSpace
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UInputModifierToWorldSpace : public UInputModifier
{ 
public:
};

/// Class /Script/EnhancedInput.InputModifierSwizzleAxis
/// Size: 0x0030 (48 bytes) (0x000028 - 0x000030) align 8 MaxSize: 0x0030
class UInputModifierSwizzleAxis : public UInputModifier
{ 
public:
	EInputAxisSwizzle                                  Order;                                                      // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/EnhancedInput.InputModifierCollection
/// Size: 0x0040 (64 bytes) (0x000028 - 0x000040) align 8 MaxSize: 0x0040
class UInputModifierCollection : public UInputModifier
{ 
public:
	TArray<class UInputModifier*>                      Modifiers;                                                  // 0x0028   (0x0010)  
	bool                                               bPermitValueTypeModification;                               // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/EnhancedInput.InputTrigger
/// Size: 0x0040 (64 bytes) (0x000028 - 0x000040) align 8 MaxSize: 0x0040
class UInputTrigger : public UObject
{ 
public:
	float                                              ActuationThreshold;                                         // 0x0028   (0x0004)  
	FInputActionValue                                  LastValue;                                                  // 0x002C   (0x0010)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x003C   (0x0004)  MISSED


	/// Functions
	// Function /Script/EnhancedInput.InputTrigger.UpdateState
	ETriggerState UpdateState(UEnhancedPlayerInput* PlayerInput, FInputActionValue ModifiedValue, float DeltaTime) // [0x113ce10] Native|Event|Public|BlueprintCallable|BlueprintEvent 
	{
		typedef ETriggerState (*FuncPtr)(UEnhancedPlayerInput*, FInputActionValue, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(PlayerInput, ModifiedValue, DeltaTime);
	}
	// Function /Script/EnhancedInput.InputTrigger.IsActuated
	bool IsActuated(FInputActionValue& ForValue) // [0x113bf20] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	{
		typedef bool (*FuncPtr)(FInputActionValue&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(ForValue);
	}
	// Function /Script/EnhancedInput.InputTrigger.GetTriggerType
	ETriggerType GetTriggerType() // [0x113bd20] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef ETriggerType (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		return func();
	}
};

/// Class /Script/EnhancedInput.InputTriggerTimedBase
/// Size: 0x0048 (72 bytes) (0x000040 - 0x000048) align 8 MaxSize: 0x0048
class UInputTriggerTimedBase : public UInputTrigger
{ 
public:
	float                                              HeldDuration;                                               // 0x0040   (0x0004)  
	bool                                               bAffectedByTimeDilation;                                    // 0x0044   (0x0001)  
	unsigned char                                      UnknownData00_7[0x3];                                       // 0x0045   (0x0003)  MISSED
};

/// Class /Script/EnhancedInput.InputTriggerDown
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UInputTriggerDown : public UInputTrigger
{ 
public:
};

/// Class /Script/EnhancedInput.InputTriggerPressed
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UInputTriggerPressed : public UInputTrigger
{ 
public:
};

/// Class /Script/EnhancedInput.InputTriggerReleased
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UInputTriggerReleased : public UInputTrigger
{ 
public:
};

/// Class /Script/EnhancedInput.InputTriggerHold
/// Size: 0x0058 (88 bytes) (0x000048 - 0x000058) align 8 MaxSize: 0x0058
class UInputTriggerHold : public UInputTriggerTimedBase
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x0048   (0x0004)  MISSED
	float                                              HoldTimeThreshold;                                          // 0x004C   (0x0004)  
	bool                                               bIsOneShot;                                                 // 0x0050   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0051   (0x0007)  MISSED
};

/// Class /Script/EnhancedInput.InputTriggerHoldAndRelease
/// Size: 0x0050 (80 bytes) (0x000048 - 0x000050) align 8 MaxSize: 0x0050
class UInputTriggerHoldAndRelease : public UInputTriggerTimedBase
{ 
public:
	float                                              HoldTimeThreshold;                                          // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Class /Script/EnhancedInput.InputTriggerTap
/// Size: 0x0050 (80 bytes) (0x000048 - 0x000050) align 8 MaxSize: 0x0050
class UInputTriggerTap : public UInputTriggerTimedBase
{ 
public:
	float                                              TapReleaseTimeThreshold;                                    // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Class /Script/EnhancedInput.InputTriggerPulse
/// Size: 0x0058 (88 bytes) (0x000048 - 0x000058) align 8 MaxSize: 0x0058
class UInputTriggerPulse : public UInputTriggerTimedBase
{ 
public:
	unsigned char                                      UnknownData00_8[0x4];                                       // 0x0048   (0x0004)  MISSED
	bool                                               bTriggerOnStart;                                            // 0x004C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x004D   (0x0003)  MISSED
	float                                              Interval;                                                   // 0x0050   (0x0004)  
	int32_t                                            TriggerLimit;                                               // 0x0054   (0x0004)  
};

/// Class /Script/EnhancedInput.InputTriggerChordAction
/// Size: 0x0048 (72 bytes) (0x000040 - 0x000048) align 8 MaxSize: 0x0048
class UInputTriggerChordAction : public UInputTrigger
{ 
public:
	class UInputAction*                                ChordAction;                                                // 0x0040   (0x0008)  
};

/// Class /Script/EnhancedInput.InputTriggerChordBlocker
/// Size: 0x0048 (72 bytes) (0x000048 - 0x000048) align 8 MaxSize: 0x0048
class UInputTriggerChordBlocker : public UInputTriggerChordAction
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(FBlueprintEnhancedInputActionBinding) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UEnhancedInputActionDelegateBinding) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UEnhancedInputActionValueBinding) == 0x0038); // 56 bytes (0x000028 - 0x000038)
static_assert(sizeof(UEnhancedInputComponent) == 0x0168); // 360 bytes (0x000138 - 0x000168)
static_assert(sizeof(UEnhancedInputLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UEnhancedInputSubsystemInterface) == 0x0028); // 40 bytes (0x000028 - 0x000028)
