
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "AkAudio.h"
#include "AnimGraphRuntime.h"
#include "BBQBackendServices.h"
#include "BBQCore.h"
#include "BBQGameSession.h"
#include "BBQInterface.h"
#include "BBQMetaGame.h"
#include "BBQUI.h"
#include "CinematicCamera.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "EnhancedInput.h"
#include "GameplayAbilities.h"
#include "GameplayCameras.h"
#include "GameplayTags.h"
#include "GameplayVariables.h"
#include "Gauntlet.h"
#include "InputCore.h"
#include "LevelSequence.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "Niagara.h"
#include "OnlineSubsystemBBQ.h"
#include "SlateCore.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"

#pragma pack(push, 0x1)

class ABP_BBQBootFlowGameMode_C;
class ABP_BBQBootFlowGameState_C;
class ABP_BBQGameSessionGameState_C;
class ABP_BBQGrandpaFeedingCamera_C;
class ABP_BBQGrandpa_C;
class ABP_BBQHUD_C;
class ABP_BBQMetaGameCharacter_C;
class ABP_BBQMetaGameController_C;
class ABP_BBQMetaGameGameMode_C;
class ABP_BBQMetaGameGameState_C;
class ABP_BBQMetaGamePlayerState_C;

class UWBP_PageSelectionPip_C;
class UWBP_PartyMenu_C;
class UWBP_PartyOptionsButton_C;
class UWBP_PartyPlayerSlot_C;
class UWBP_PauseMenu_C;
class UWBP_Pause_Menu_Button_C;
class UWBP_PingMarker_C;
class UWBP_PlaceholderBloodVial_C;
class UWBP_PlatformIcon_C;
class UWBP_PlayGame_C;
class UWBP_PlayerAvatar_C;
class UWBP_PlayerListHolder_C;
class UWBP_PlayerListMenu_C;
class UWBP_PlayerListOptionsBtn_C;
class UWBP_PopUpLockedScreen_C;
class UWBP_PopUpTimer_C;
class UWBP_PopUp_CharacterSwap_C;
class UWBP_PopUp_ContentStoreLarge_C;
class UWBP_PopUp_ContentStore_C;
class UWBP_PopUp_Generic_C;
class UWBP_PopUp_LobbyInvite_C;
class UWBP_PopUp_Lobby_NoLF_C;
class UWBP_PopUp_Lobby_NoVictim_C;
class UWBP_PopUp_MenuMedium_C;
class UWBP_PopUp_MenuSmallSinglePrompt_C;
class UWBP_PopUp_MenuSmall_C;
class UWBP_PopUp_MenuSmall_Processing_C;
class UWBP_PopUp_PartyOptions_C;
class UWBP_Pop_Up_BG_Overlay_C;
class UWBP_Popup_AbilityTreeAcquire_C;
class UWBP_Popup_AbilityTreeCannotAcquire_C;
class UWBP_Popup_AbilityTreeInProgress_C;
class UWBP_Popup_AbilityTreeReset_C;
class UWBP_Popup_Confirm_SaveLoadout_C;
class UWBP_Popup_Confirm_SetDefaultLoadout_C;
class UWBP_Popup_UnlockTreeError_C;
class UWBP_Popup_UnlockTreeInProgress_C;
class UWBP_Popup_UnlockTreePurchase_C;
class UWBP_Popup_UnlockTreeReset_C;
class UWBP_PrivacyStatement_C;
class UWBP_ProgressChunk_C;
class UWBP_ProgressionBar_C;
class UWBP_ProgressionProgressTab_C;
class UWBP_ProgressionStat_C;
class UWBP_ProgressionStatsTab_C;
class UWBP_Progression_C;
class UWBP_QuitScreen_C;
class UWBP_ReportMenuBtn_C;
class UWBP_ReportMenu_C;
class UWBP_ResultsScreen_Base_C;
class UWBP_ResultsScreen_C;
class UWBP_RoomNameWidgetV2_C;
class UWBP_ScreenBlur_C;
class UWBP_SecondaryAbilityIcon_C;
class UWBP_SelectorArrow_C;
class UWBP_SliderOption_C;
class UWBP_StartScreen_C;
class UWBP_SubTabButton_C;
class UWBP_SubTopBar_C;
class UWBP_SubtitleWidget_C;
class UWBP_TabButton_C;
class UWBP_TeammateLobbyPlayerCard_C;
class UWBP_TeammateLobbyPlayerCard_Foxtrot_C;
class UWBP_TopBarMenu_C;
class UWBP_TopBarTabsSeparator_C;
class UWBP_TopLevelImageButton_C;
class UWBP_TopLevelImageButton_ContentPass_C;
class UWBP_TopLevelMenuButton_C;
class UWBP_TopLevelMenu_C;
class UWBP_TutorialList_TutorialWidget_C;
class UWBP_TutorialSelectionBtn_C;
class UWBP_TutorialSelection_C;
class UWBP_Tutorial_Ingame_Widget_C;
class UWBP_Tutorial_List_C;
class UWBP_Tutorial_List_Item_C;
class UWBP_Tutorial_Widget_C;
class UWBP_TutorialsTab_C;
class UWBP_UI_AutoSave_Icon_C;
class UWBP_UI_FailGameplayMessage_C;
class UWBP_UnlockTreeNode_C;
class UWBP_UnlockTree_C;
class UWBP_UnlockTree_FullScreen_BaseMenu_C;
class UWBP_UnlockTree_FullScreen_C;
class UWBP_UnlockTree_InfoPanel_C;
class UWBP_UnlockableCard_C;
class UWBP_UnlockableFullScreen_C;
class UWBP_UnlockablesTab_C;
class UWBP_VictimAbilityPerkBar_C;
class UWBP_VideoCinematic_C;
class UWBP_VideoOptions_C;

/// Enum /Game/BBQGame/Gameplay/Player/EReplicationState.EReplicationState
/// Size: 0x01 (1 bytes)
enum class EReplicationState : uint8_t
{
	EReplicationState__NewEnumerator0                                                = 0,
	EReplicationState__NewEnumerator1                                                = 1,
	EReplicationState__NewEnumerator2                                                = 2
};

/// Enum /Game/BBQGame/Gameplay/GameModes/EGamePhases.EGamePhases
/// Size: 0x01 (1 bytes)
enum class EGamePhases : uint8_t
{
	EGamePhases__NewEnumerator4                                                      = 0,
	EGamePhases__NewEnumerator0                                                      = 1,
	EGamePhases__NewEnumerator2                                                      = 2,
	EGamePhases__NewEnumerator3                                                      = 3,
	EGamePhases__NewEnumerator5                                                      = 4,
	EGamePhases__NewEnumerator6                                                      = 5
};

/// Enum /Game/BBQGame/Gameplay/GameModes/EGrandpaAlertedMethods.EGrandpaAlertedMethods
/// Size: 0x01 (1 bytes)
enum class EGrandpaAlertedMethods : uint8_t
{
	EGrandpaAlertedMethods__NewEnumerator0                                           = 0,
	EGrandpaAlertedMethods__NewEnumerator1                                           = 1,
	EGrandpaAlertedMethods__NewEnumerator2                                           = 2
};

/// Enum /Game/BBQGame/Gameplay/Misc/ECharacters.ECharacters
/// Size: 0x01 (1 bytes)
enum class ECharacters : uint8_t
{
	ECharacters__NewEnumerator0                                                      = 0,
	ECharacters__NewEnumerator1                                                      = 1,
	ECharacters__NewEnumerator2                                                      = 2,
	ECharacters__NewEnumerator3                                                      = 3,
	ECharacters__NewEnumerator4                                                      = 4,
	ECharacters__NewEnumerator5                                                      = 5,
	ECharacters__NewEnumerator6                                                      = 6,
	ECharacters__NewEnumerator7                                                      = 7,
	ECharacters__NewEnumerator8                                                      = 8,
	ECharacters__NewEnumerator9                                                      = 9,
	ECharacters__NewEnumerator10                                                     = 10,
	ECharacters__NewEnumerator11                                                     = 11,
	ECharacters__NewEnumerator12                                                     = 12,
	ECharacters__NewEnumerator13                                                     = 13,
	ECharacters__NewEnumerator14                                                     = 14
};

/// Enum /Game/BBQGame/Gameplay/Misc/EInteractionHeights.EInteractionHeights
/// Size: 0x01 (1 bytes)
enum class EInteractionHeights : uint8_t
{
	EInteractionHeights__NewEnumerator0                                              = 0,
	EInteractionHeights__NewEnumerator1                                              = 1,
	EInteractionHeights__NewEnumerator2                                              = 2,
	EInteractionHeights__NewEnumerator3                                              = 3
};

/// Enum /Game/BBQGame/Gameplay/Misc/ETrapInteractions.ETrapInteractions
/// Size: 0x01 (1 bytes)
enum class ETrapInteractions : uint8_t
{
	ETrapInteractions__NewEnumerator1                                                = 0,
	ETrapInteractions__NewEnumerator2                                                = 1,
	ETrapInteractions__NewEnumerator3                                                = 2
};

/// Enum /Game/BBQGame/Gameplay/Misc/Grandpa/EBBQ_BloodType.EBBQ_BloodType
/// Size: 0x01 (1 bytes)
enum class EBBQ_BloodType : uint8_t
{
	EBBQ_BloodType__NewEnumerator2                                                   = 0,
	EBBQ_BloodType__NewEnumerator0                                                   = 1,
	EBBQ_BloodType__NewEnumerator1                                                   = 2
};

/// Enum /Game/BBQGame/Gameplay/Misc/ETeamExitAchievement.ETeamExitAchievement
/// Size: 0x01 (1 bytes)
enum class ETeamExitAchievement : uint8_t
{
	ETeamExitAchievement__NewEnumerator0                                             = 0,
	ETeamExitAchievement__NewEnumerator1                                             = 1,
	ETeamExitAchievement__NewEnumerator2                                             = 2
};

/// Enum /Game/BBQGame/Gameplay/Player/E_BBQPlayerNoiseSources.E_BBQPlayerNoiseSources
/// Size: 0x01 (1 bytes)
enum class E_BBQPlayerNoiseSources : uint8_t
{
	E_BBQPlayerNoiseSources__NewEnumerator3                                          = 0,
	E_BBQPlayerNoiseSources__NewEnumerator0                                          = 1,
	E_BBQPlayerNoiseSources__NewEnumerator1                                          = 2,
	E_BBQPlayerNoiseSources__NewEnumerator2                                          = 3,
	E_BBQPlayerNoiseSources__NewEnumerator4                                          = 4,
	E_BBQPlayerNoiseSources__NewEnumerator5                                          = 5,
	E_BBQPlayerNoiseSources__NewEnumerator6                                          = 6,
	E_BBQPlayerNoiseSources__NewEnumerator7                                          = 7,
	E_BBQPlayerNoiseSources__NewEnumerator8                                          = 8,
	E_BBQPlayerNoiseSources__NewEnumerator9                                          = 9,
	E_BBQPlayerNoiseSources__NewEnumerator10                                         = 10,
	E_BBQPlayerNoiseSources__NewEnumerator11                                         = 11
};

/// Enum /Game/BBQGame/Gameplay/Player/Camera/DataTables/ECameraState.ECameraState
/// Size: 0x01 (1 bytes)
enum class ECameraState : uint8_t
{
	ECameraState__NewEnumerator15                                                    = 0,
	ECameraState__NewEnumerator16                                                    = 1,
	ECameraState__NewEnumerator48                                                    = 2,
	ECameraState__NewEnumerator49                                                    = 3,
	ECameraState__NewEnumerator50                                                    = 4,
	ECameraState__NewEnumerator51                                                    = 5,
	ECameraState__NewEnumerator52                                                    = 6,
	ECameraState__NewEnumerator53                                                    = 7,
	ECameraState__NewEnumerator54                                                    = 8,
	ECameraState__NewEnumerator55                                                    = 9,
	ECameraState__NewEnumerator56                                                    = 10,
	ECameraState__NewEnumerator57                                                    = 11,
	ECameraState__NewEnumerator58                                                    = 12,
	ECameraState__NewEnumerator59                                                    = 13,
	ECameraState__NewEnumerator60                                                    = 14,
	ECameraState__NewEnumerator61                                                    = 15,
	ECameraState__NewEnumerator62                                                    = 16,
	ECameraState__NewEnumerator63                                                    = 17,
	ECameraState__NewEnumerator64                                                    = 18,
	ECameraState__NewEnumerator65                                                    = 19,
	ECameraState__NewEnumerator67                                                    = 20,
	ECameraState__NewEnumerator68                                                    = 21
};

/// Enum /Game/BBQGame/Gameplay/Misc/Generator/EWaterValvePressureStates.EWaterValvePressureStates
/// Size: 0x01 (1 bytes)
enum class EWaterValvePressureStates : uint8_t
{
	EWaterValvePressureStates__NewEnumerator1                                        = 0,
	EWaterValvePressureStates__NewEnumerator0                                        = 1,
	EWaterValvePressureStates__NewEnumerator7                                        = 2
};

/// Enum /Game/BBQGame/UI/HUD/BBQChat/EChatMode.EChatMode
/// Size: 0x01 (1 bytes)
enum class EChatMode : uint8_t
{
	EChatMode__NewEnumerator0                                                        = 0,
	EChatMode__NewEnumerator1                                                        = 1,
	EChatMode__NewEnumerator2                                                        = 2,
	EChatMode__NewEnumerator3                                                        = 3,
	EChatMode__NewEnumerator4                                                        = 4
};

/// Enum /Game/BBQGame/Gameplay/Dispensers/EDressingState.EDressingState
/// Size: 0x01 (1 bytes)
enum class EDressingState : uint8_t
{
	EDressingState__NewEnumerator0                                                   = 0,
	EDressingState__NewEnumerator1                                                   = 1,
	EDressingState__NewEnumerator2                                                   = 2
};

/// Enum /Game/BBQGame/Gameplay/Misc/Generator/EWaterValveGateStates.EWaterValveGateStates
/// Size: 0x01 (1 bytes)
enum class EWaterValveGateStates : uint8_t
{
	EWaterValveGateStates__NewEnumerator1                                            = 0,
	EWaterValveGateStates__NewEnumerator0                                            = 1
};

/// Struct /Game/BBQGame/UI/HUD/BBQChat/SBBQChatMessage.SBBQChatMessage
/// Size: 0x0022 (34 bytes) (0x000000 - 0x000022) align 8 MaxSize: 0x0022
struct FSBBQChatMessage
{ 
	FString                                            SenderName_3_277F43314375BE292EEF8F9CB3B62A6A;              // 0x0000   (0x0010)  
	FString                                            Message_5_59049C5946A006C1708606970783396E;                 // 0x0010   (0x0010)  
	TEnumAsByte<EChatMode>                             MessageTeam_11_46E1355440E18047E7AAE1A50D822C8E;            // 0x0020   (0x0001)  
	EUserPlatform                                      SenderPlatform_14_8E9EC9DD45D0819E2CB2208E77100AEA;         // 0x0021   (0x0001)  
};

/// Struct /Game/BBQGame/UI/HUD/DEBUG/DT_MottoPerks_Struct.DT_MottoPerks_Struct
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FDT_MottoPerks_Struct
{ 
	class UTexture*                                    UIElement_7_663E4DAA47F2732DA45F368D671E702B;               // 0x0000   (0x0008)  
};

/// Struct /Game/BBQGame/UI/Menus/PostMatch/S_UI_CharacterThumbnail.S_UI_CharacterThumbnail
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FS_UI_CharacterThumbnail
{ 
	FString                                            Name_3_645476A0494B656B9C65D1BB401A68D2;                    // 0x0000   (0x0010)  
	class UTexture2D*                                  Texture_6_5C73582245CB25C9D95A20805EFCADF9;                 // 0x0010   (0x0008)  
};

/// Class /Game/BBQAddOn_Alpha/Data/VariableSets/BP_VarSet_DLC1_ALPHA.BP_VarSet_DLC1_ALPHA_C
/// Size: 0x0130 (304 bytes) (0x000038 - 0x000130) align 8 MaxSize: 0x0130
class UBP_VarSet_DLC1_ALPHA_C : public UGameplayVariableSet
{ 
public:
	float                                              Combat_ALPHA_Attack_Damage;                                 // 0x0038   (0x0004)  
	float                                              Combat_ALPHA_Attack_Tired_Damage;                           // 0x003C   (0x0004)  
	float                                              Combat_ALPHA_Attack_StaminaCost;                            // 0x0040   (0x0004)  
	float                                              ALPHAAbility_RechargeRate;                                  // 0x0044   (0x0004)  
	float                                              ALPHAAbility_AttackRange;                                   // 0x0048   (0x0004)  
	float                                              ALPHAAbility_DepletionRate;                                 // 0x004C   (0x0004)  
	float                                              ALPHAAbility_AttackCost;                                    // 0x0050   (0x0004)  
	bool                                               ALPHAAbility_AttackVictimOnly;                              // 0x0054   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0055   (0x0003)  MISSED
	float                                              ALPHAAbility_MainAbilityCooldown;                           // 0x0058   (0x0004)  
	float                                              ALPHAAbility_Part2AttackEndLag;                             // 0x005C   (0x0004)  
	float                                              ALPHAAbility_AttackAngle;                                   // 0x0060   (0x0004)  
	float                                              ALPHA_Ripstall_GeneratorSweetZoneSize;                      // 0x0064   (0x0004)  
	float                                              RipstallMash_TimeOut;                                       // 0x0068   (0x0004)  
	float                                              RipstallMash_MinPoints;                                     // 0x006C   (0x0004)  
	float                                              RipstallMash_MaxPoints;                                     // 0x0070   (0x0004)  
	float                                              RipstallMash_StartPoints;                                   // 0x0074   (0x0004)  
	float                                              RipstallMash_DecayRate;                                     // 0x0078   (0x0004)  
	float                                              RipstallMash_DecayValue;                                    // 0x007C   (0x0004)  
	float                                              RipstallMash_HoldUpdateTickRate;                            // 0x0080   (0x0004)  
	float                                              RipstallMash_ProgressHoldPointsPerTick;                     // 0x0084   (0x0004)  
	float                                              RipstallMash_ProgressPointsOnTap;                           // 0x0088   (0x0004)  
	float                                              RipstallMash_NoiseHoldValuePerTick;                         // 0x008C   (0x0004)  
	float                                              RipstallMash_NoiseValueOnTap;                               // 0x0090   (0x0004)  
	float                                              RipstallMash_NoiseMaxValue;                                 // 0x0094   (0x0004)  
	float                                              RipstallMash_NoiseDecayTickRate;                            // 0x0098   (0x0004)  
	float                                              RipstallMash_NoiseDecayPerTick;                             // 0x009C   (0x0004)  
	float                                              ALPHAAbility_AttackDamage;                                  // 0x00A0   (0x0004)  
	float                                              ALPHAAbility_RipStalledDelay_Fuse;                          // 0x00A4   (0x0004)  
	float                                              Minigame_ObstacleDestroyDuration;                           // 0x00A8   (0x0004)  
	float                                              Alpha_ConcussiveHit_Duration;                               // 0x00AC   (0x0004)  
	float                                              Ripstall_CooldownDuration;                                  // 0x00B0   (0x0004)  
	float                                              Ripstall_DisableObject_Duration;                            // 0x00B4   (0x0004)  
	float                                              Ripstall_DamageDuration;                                    // 0x00B8   (0x0004)  
	float                                              Ripstall_DamageIncrease;                                    // 0x00BC   (0x0004)  
	float                                              Wired_HighlightLength;                                      // 0x00C0   (0x0004)  
	float                                              ALPHA_Ripstall_SweetZoneHitAddPoints;                       // 0x00C4   (0x0004)  
	float                                              ALPHA_Ripstall_MarkerSpeedModifier;                         // 0x00C8   (0x0004)  
	float                                              ALPHA_Ripstall_SweetZoneHitMissAddPoints;                   // 0x00CC   (0x0004)  
	float                                              ALPHA_Ripstall_MinPoints;                                   // 0x00D0   (0x0004)  
	float                                              ALPHA_Ripstall_MaxPoints;                                   // 0x00D4   (0x0004)  
	float                                              ALPHA_Ripstall_StartPoints;                                 // 0x00D8   (0x0004)  
	float                                              ALPHA_Ripstall_DecayRate;                                   // 0x00DC   (0x0004)  
	float                                              ALPHA_Ripstall_DecayValue;                                  // 0x00E0   (0x0004)  
	float                                              ALPHA_Ripstall_EndDelay;                                    // 0x00E4   (0x0004)  
	float                                              ALPHAAbility_RipStalledDelay_Generator;                     // 0x00E8   (0x0004)  
	float                                              ALPHAAbility_RipStalledDelay_Valve;                         // 0x00EC   (0x0004)  
	float                                              ALPHAAbility_RipStalledDelay_CarBattery;                    // 0x00F0   (0x0004)  
	float                                              ALPHAAbility_Attack_EndLagTime;                             // 0x00F4   (0x0004)  
	float                                              ALPHAAbility_Attack_EndLagMissVictimTime;                   // 0x00F8   (0x0004)  
	int32_t                                            ALPHAAbility_Ripstall_FreeTrapCharges;                      // 0x00FC   (0x0004)  
	float                                              ALPHAAbility_ElectroTrap_HoldTime;                          // 0x0100   (0x0004)  
	float                                              ALPHAAbility_ElectroTrap_EnableCooldown_VictimTriggered;    // 0x0104   (0x0004)  
	float                                              ALPHAAbility_ElectroTrap_EnableCooldown_TrapDisabled;       // 0x0108   (0x0004)  
	float                                              ALPHAAbility_Barge_StaminaUsePercentageAmount;              // 0x010C   (0x0004)  
	float                                              ALPHA_DoorBarge_CustomMinigame_MaxPoints;                   // 0x0110   (0x0004)  
	float                                              ALPHAAbility_BloodCollected_Barge;                          // 0x0114   (0x0004)  
	bool                                               ALPHAAbility_Barge_AimAssist;                               // 0x0118   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0119   (0x0003)  MISSED
	float                                              ALPHAAbility_Barge_AimAssist_AngleMargin;                   // 0x011C   (0x0004)  
	float                                              ALPHAAbility_Barge_AimAssist_DistanceMargin;                // 0x0120   (0x0004)  
	float                                              ALPHAAbility_Barge_AimAssist_MaxRotationAngleDelta;         // 0x0124   (0x0004)  
	float                                              ALPHAAbility_Barge_AimAssist_RotationInterpSpeed;           // 0x0128   (0x0004)  
	float                                              ALPHAAbility_StunImmunity_Duration;                         // 0x012C   (0x0004)  
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ALPHA.BPI_DLC1_ALPHA_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UBPI_DLC1_ALPHA_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ALPHA.BPI_DLC1_ALPHA_C.Ripstall_WithDelay
	void Ripstall_WithDelay(float TimeUntilRipstall) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(TimeUntilRipstall);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ALPHA.BPI_DLC1_ALPHA_C.ShortFusePerk_HighlightVictim
	void ShortFusePerk_HighlightVictim(AActor* VictimToHighlight) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(VictimToHighlight);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ALPHA.BPI_DLC1_ALPHA_C.Ripstall_DisableObject
	void Ripstall_DisableObject(float DisableDuration) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(DisableDuration);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ElectroTrap.BPI_DLC1_ElectroTrap_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UBPI_DLC1_ElectroTrap_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ElectroTrap.BPI_DLC1_ElectroTrap_C.BPI_GetElectroTrapLocators
	// void BPI_GetElectroTrapLocators(TArray<USceneComponent*>& Locators);                                                     // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ElectroTrap.BPI_DLC1_ElectroTrap_C.BPI_GetElectroTrapComponent
	void BPI_GetElectroTrapComponent(UBBQElectroTrapComponent*& Component) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UBBQElectroTrapComponent*&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Component);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPI_DLC1_ElectroTrap.BPI_DLC1_ElectroTrap_C.BPI_OnElectroTrapSetupEnded
	void BPI_OnElectroTrapSetupEnded() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/Combat/BP_BBQCalculation_AlphaConcussionDuration.BP_BBQCalculation_AlphaConcussionDuration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQCalculation_AlphaConcussionDuration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/Combat/BP_BBQCalculation_AlphaConcussionDuration.BP_BBQCalculation_AlphaConcussionDuration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_HeartAttack.BP_BBQ_Calculation_HeartAttack_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_HeartAttack_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_HeartAttack.BP_BBQ_Calculation_HeartAttack_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_HeartAttack_Duration.BP_BBQ_Calculation_HeartAttack_Duration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_HeartAttack_Duration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_HeartAttack_Duration.BP_BBQ_Calculation_HeartAttack_Duration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_SlowHands.BP_BBQ_Calculation_SlowHands_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_SlowHands_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_SlowHands.BP_BBQ_Calculation_SlowHands_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_PerkUI_SlowHands.GAE_PerkUI_SlowHands_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_PerkUI_SlowHands_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_PerkUI_HeartAttack.GAE_PerkUI_HeartAttack_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_PerkUI_HeartAttack_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_Perk_HeartAttack.GAE_Perk_HeartAttack_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_Perk_HeartAttack_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_BBQPerk_SlowHands_LV3.GAE_BBQPerk_SlowHands_LV3_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_BBQPerk_SlowHands_LV3_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_BBQPerk_SlowHands_LV2.GAE_BBQPerk_SlowHands_LV2_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_BBQPerk_SlowHands_LV2_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_BBQPerk_SlowHands_LV1.GAE_BBQPerk_SlowHands_LV1_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_BBQPerk_SlowHands_LV1_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UBPFL_DLC1_ALPHA_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C.Dinners Ready Perk
	void DinnersReadyPerk(ABBQBaseCharacter* Instigator, ABBQBaseCharacter* BargedPlayer, UObject* __WorldContext) // [0x2438a30] Static|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQBaseCharacter*, ABBQBaseCharacter*, UObject*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Instigator, BargedPlayer, __WorldContext);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C.ShortFusePerk
	void ShortFusePerk(ABBQBaseCharacter* Instigator, ABBQBaseCharacter* BargedPlayer, UObject* __WorldContext) // [0x2438a30] Static|Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQBaseCharacter*, ABBQBaseCharacter*, UObject*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Instigator, BargedPlayer, __WorldContext);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C.SlowHandsPerk
	void SlowHandsPerk(ABBQBaseCharacter* Instigator, ABBQBaseCharacter* BargedPlayer, UObject* __WorldContext) // [0x2438a30] Static|Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQBaseCharacter*, ABBQBaseCharacter*, UObject*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Instigator, BargedPlayer, __WorldContext);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C.HeartAttackPerk
	void HeartAttackPerk(ABBQGameSessionCharacter* Instigator, ABBQGameSessionCharacter* BargedPlayer, UObject* __WorldContext) // [0x2438a30] Static|Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*, ABBQGameSessionCharacter*, UObject*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Instigator, BargedPlayer, __WorldContext);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Misc/BPFL_DLC1_ALPHA.BPFL_DLC1_ALPHA_C.BPFL_DLC1_OnElectrocuted
	void BPFL_DLC1_OnElectrocuted(ABBQGameSessionCharacterAnimated* BargedPlayer, UClass* BargeHitEffect, UClass* BargeHitDurationEffect, UClass* BargeEndEffect, ABBQGameSessionCharacterAnimated* Instigator, UObject* __WorldContext) // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, UClass*, UClass*, UClass*, ABBQGameSessionCharacterAnimated*, UObject*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(BargedPlayer, BargeHitEffect, BargeHitDurationEffect, BargeEndEffect, Instigator, __WorldContext);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/Combat/GAE_Alpha_ConcussiveHit.GAE_Alpha_ConcussiveHit_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_Alpha_ConcussiveHit_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Combat/GAA_MeleeReaction_BluntForceTraumaHit.GAA_MeleeReaction_BluntForceTraumaHit_C
/// Size: 0x04F8 (1272 bytes) (0x0004F8 - 0x0004F8) align 8 MaxSize: 0x04F8
class UGAA_MeleeReaction_BluntForceTraumaHit_C : public UBBQAbilityMeleeReaction
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/PerkUI/CustomDurations/BP_BBQ_Calculation_RipStalled_Duration.BP_BBQ_Calculation_RipStalled_Duration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_RipStalled_Duration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/PerkUI/CustomDurations/BP_BBQ_Calculation_RipStalled_Duration.BP_BBQ_Calculation_RipStalled_Duration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/PerkUI/GAE_BBQPerk_RipStalled.GAE_BBQPerk_RipStalled_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_BBQPerk_RipStalled_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C
/// Size: 0x0270 (624 bytes) (0x000228 - 0x000270) align 8 MaxSize: 0x0270
class ABP_ElectroTrap_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0228   (0x0008)  
	class UBBQTriggerAreaComponent*                    ApothecaryEye_BBQTriggerArea;                               // 0x0230   (0x0008)  
	class UNiagaraComponent*                           VFX;                                                        // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        ElectroTrapMesh;                                            // 0x0240   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0248   (0x0008)  
	bool                                               IsFreeTrap;                                                 // 0x0250   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0251   (0x0007)  MISSED
	class UNiagaraSystem*                              NotUsingFreeTrapVFX;                                        // 0x0258   (0x0008)  
	class UNiagaraSystem*                              UsingFreeTrapVFX;                                           // 0x0260   (0x0008)  
	FName                                              Apothecary_Eye_Highlight;                                   // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.BPI_SetObjectVisibility
	void BPI_SetObjectVisibility(bool Show) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(Show);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.SetIsFreeTrap
	void SetIsFreeTrap(bool IsFreeTrap) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(IsFreeTrap);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.ActivateVFX
	void ActivateVFX(bool Activate) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Activate);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.BndEvt__BP_ElectroTrap_ApothecaryEye_BBQTriggerArea_K2Node_ComponentBoundEvent_1_OnTriggerStart__DelegateSignature
	void BndEvt__BP_ElectroTrap_ApothecaryEye_BBQTriggerArea_K2Node_ComponentBoundEvent_1_OnTriggerStart__DelegateSignature(ABBQGameSessionCharacter* Player) // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(Player);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.BndEvt__BP_ElectroTrap_ApothecaryEye_BBQTriggerArea_K2Node_ComponentBoundEvent_2_OnTriggerEnd__DelegateSignature
	void BndEvt__BP_ElectroTrap_ApothecaryEye_BBQTriggerArea_K2Node_ComponentBoundEvent_2_OnTriggerEnd__DelegateSignature(ABBQGameSessionCharacter* Player) // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(Player);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrap.BP_ElectroTrap_C.ExecuteUbergraph_BP_ElectroTrap
	void ExecuteUbergraph_BP_ElectroTrap(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C
/// Size: 0x0110 (272 bytes) (0x0000C0 - 0x000110) align 8 MaxSize: 0x0110
class UBP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C : public UBBQMinigameGameplayComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00C0   (0x0008)  
	EBBQAnimSlot_AddOn1                                AnimSlot_Idle;                                              // 0x00C8   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_MontageRipstall;                                   // 0x00C9   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_ReactInto_Actor;                                   // 0x00CA   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React1_FB;                                         // 0x00CB   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React1_UB;                                         // 0x00CC   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_React1_Actor;                                      // 0x00CD   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React2_FB;                                         // 0x00CE   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React2_UB;                                         // 0x00CF   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React2_Actor;                                      // 0x00D0   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React3_FB;                                         // 0x00D1   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React3_UB;                                         // 0x00D2   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_React3_Actor;                                      // 0x00D3   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_Fail_FB;                                           // 0x00D4   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_Fail_UB;                                           // 0x00D5   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_Fail_Actor;                                        // 0x00D6   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_Success_FB;                                        // 0x00D7   (0x0001)  
	EBBQAnimSlot                                       AnimSlot_Success_UB;                                        // 0x00D8   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_Success_Actor;                                     // 0x00D9   (0x0001)  
	EBBQAnimSlot_AddOn1                                AnimSlot_Cancel_Actor;                                      // 0x00DA   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x00DB   (0x0005)  MISSED
	class UAkAudioEvent*                               AKEvent_SweetSpotHit;                                       // 0x00E0   (0x0008)  
	class UAkAudioEvent*                               AKEvent_SweetSpotMissed;                                    // 0x00E8   (0x0008)  
	class UAnimMontage*                                CurrentRevMontage;                                          // 0x00F0   (0x0008)  
	class USkeletalMeshComponent*                      SyncedActorSKMesh;                                          // 0x00F8   (0x0008)  
	int32_t                                            CurrentRevIndex;                                            // 0x0100   (0x0004)  
	FRandomStream                                      RandomStream;                                               // 0x0104   (0x0008)  
	int32_t                                            ReactionAnimations;                                         // 0x010C   (0x0004)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.EventOnMinigameStarted
	void EventOnMinigameStarted() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.EventOnMinigameEnded
	void EventOnMinigameEnded(EEndMinigameReason Reason) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EEndMinigameReason);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Reason);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.EventOnMontageBlendingOut
	void EventOnMontageBlendingOut(UAnimMontage* Montage) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UAnimMontage*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(Montage);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.SweetSpotMissed
	void SweetSpotMissed() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.StopActiveMontage
	void StopActiveMontage() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.SweetSpotHit
	void SweetSpotHit() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.EventOnMinigamePostUpdate
	void EventOnMinigamePostUpdate() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase.BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C.ExecuteUbergraph_BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase
	void ExecuteUbergraph_BP_MinigameGC_CircularSweetSpot_DLC1RipstallBase(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve.BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve_C
/// Size: 0x0118 (280 bytes) (0x000110 - 0x000118) align 8 MaxSize: 0x0118
class UBP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve_C : public UBP_MinigameGC_CircularSweetSpot_DLC1RipstallBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0110   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve.BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve_C.SweetSpotHit
	void SweetSpotHit() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/GameplayComponents/BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve.BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve_C.ExecuteUbergraph_BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve
	void ExecuteUbergraph_BP_MinigameGC_CircularSweetSpot_DLC1Ripstall_Valve(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_Cooldown.BP_BBQCalculation_Ripstall_Cooldown_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQCalculation_Ripstall_Cooldown_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_Cooldown.BP_BBQCalculation_Ripstall_Cooldown_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_DamageIncrease.BP_BBQCalculation_Ripstall_DamageIncrease_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQCalculation_Ripstall_DamageIncrease_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_DamageIncrease.BP_BBQCalculation_Ripstall_DamageIncrease_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_Damage_Duration.BP_BBQCalculation_Ripstall_Damage_Duration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQCalculation_Ripstall_Damage_Duration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQCalculation_Ripstall_Damage_Duration.BP_BBQCalculation_Ripstall_Damage_Duration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_Ripstall_DamageIncrease.GAE_Ripstall_DamageIncrease_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_Ripstall_DamageIncrease_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_Ripstall_Cooldown.GAE_Ripstall_Cooldown_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_Ripstall_Cooldown_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C
/// Size: 0x0621 (1569 bytes) (0x000588 - 0x000621) align 8 MaxSize: 0x0621
class ABP_MinigameV2_CircularSweetSpot_Base_C : public ABBQSweetSpotMinigame
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0588   (0x0008)  
	class UBBQUI_Screen*                               BBQUI_Screen_CircularSweetSpot;                             // 0x0590   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0598   (0x0008)  
	float                                              LerpProgressBar_Alpha_7DEDF1744562E91846CBD38C60B58D0B;     // 0x05A0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    LerpProgressBar__Direction_7DEDF1744562E91846CBD38C60B58D0B; // 0x05A4   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x05A5   (0x0003)  MISSED
	class UTimelineComponent*                          LerpProgressBar;                                            // 0x05A8   (0x0008)  
	class UWBP_MinigameV2_CircularSweetSpot_Base_C*    MinigameWidget;                                             // 0x05B0   (0x0008)  
	float                                              SweetZoneHitMarkerDelay;                                    // 0x05B8   (0x0004)  
	float                                              SweetZoneMissedMarkerDelay;                                 // 0x05BC   (0x0004)  
	bool                                               UseMontageForDelay;                                         // 0x05C0   (0x0001)  
	bool                                               RandomiseZoneMiddle;                                        // 0x05C1   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x05C2   (0x0006)  MISSED
	class UCurveFloat*                                 MarkerAntiClockSpeedCurve;                                  // 0x05C8   (0x0008)  
	class UCurveFloat*                                 MarkerClockwiseSpeedCurve;                                  // 0x05D0   (0x0008)  
	bool                                               HideMarker;                                                 // 0x05D8   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x05D9   (0x0003)  MISSED
	float                                              SweetZoneMiddle;                                            // 0x05DC   (0x0004)  
	float                                              MinSweetZoneMiddleChange;                                   // 0x05E0   (0x0004)  
	float                                              MontageDelayTimeForMarker;                                  // 0x05E4   (0x0004)  
	float                                              CurrentMarkerProgress;                                      // 0x05E8   (0x0004)  
	float                                              SpectatorCurrentPosition;                                   // 0x05EC   (0x0004)  
	float                                              SpectatorTargetPosition;                                    // 0x05F0   (0x0004)  
	bool                                               ShouldCancelOnStunned;                                      // 0x05F4   (0x0001)  
	bool                                               ShouldCancelOnBackstabbed;                                  // 0x05F5   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x05F6   (0x0002)  MISSED
	class UBP_MinigameGC_CircularSweetSpot_Base_C*     GCSweetSpot;                                                // 0x05F8   (0x0008)  
	bool                                               ShouldAutoTriggerFirstSuccess;                              // 0x0600   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0601   (0x0003)  MISSED
	float                                              MinigameEndUIDelay;                                         // 0x0604   (0x0004)  
	bool                                               PreviousIsMarkerInSweetSpot;                                // 0x0608   (0x0001)  
	bool                                               ShouldChangeMarkerInSweetSpotColor;                         // 0x0609   (0x0001)  
	unsigned char                                      UnknownData05_6[0x2];                                       // 0x060A   (0x0002)  MISSED
	float                                              MarkerSourcePosition;                                       // 0x060C   (0x0004)  
	float                                              MarkerDestinationPosition;                                  // 0x0610   (0x0004)  
	float                                              PreviousPoints;                                             // 0x0614   (0x0004)  
	bool                                               MarkerAscending;                                            // 0x0618   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x0619   (0x0003)  MISSED
	float                                              HUDDelay;                                                   // 0x061C   (0x0004)  
	bool                                               AlwaysLerpMarkerToMaxAfterSuccess;                          // 0x0620   (0x0001)  


	/// Functions
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.Auth_StopInteractingWithTarget
	void Auth_StopInteractingWithTarget() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.Auth_StartInteractingWithTarget
	void Auth_StartInteractingWithTarget() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.UpdateMinigameProgress
	void UpdateMinigameProgress() // [0x2438a30] Protected|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.ResetMinigame
	void ResetMinigame() // [0x2438a30] Protected|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.UpdateMarkerMovement
	void UpdateMarkerMovement(float DeltaTime, float& MarkerPosition) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float, float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(DeltaTime, MarkerPosition);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.IsMarkerInSweetSpot
	void IsMarkerInSweetSpot(bool& Result) // [0x2438a30] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Result);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.UpdateSweetSpotColor
	void UpdateSweetSpotColor() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.SetFailDelayVisuals
	void SetFailDelayVisuals(bool Show) // [0x2438a30] Protected|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Show);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.GetMarkerSpeed
	void GetMarkerSpeed(float& OutSpeed) // [0x2438a30] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(OutSpeed);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.GetMarkerVisualPosition
	float GetMarkerVisualPosition(float position) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef float (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		return func(position);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.InitSettings
	void InitSettings(AActor* VarModOwner) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(VarModOwner);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventGetInputDelayTime
	float EventGetInputDelayTime(EInputValidationResult InputValidationResult) // [0x2438a30] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(EInputValidationResult);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		return func(InputValidationResult);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.GetCurrentMarkerProgress
	float GetCurrentMarkerProgress() // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		return func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventPerformUpdate
	EInputValidationResult EventPerformUpdate(float DeltaTime, FBBQMinigameInputState& InputState) // [0x2438a30] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef EInputValidationResult (*FuncPtr)(float, FBBQMinigameInputState&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		return func(DeltaTime, InputState);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.LerpProgressBar__FinishedFunc
	void LerpProgressBar__FinishedFunc() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.LerpProgressBar__UpdateFunc
	void LerpProgressBar__UpdateFunc() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnMinigameStarted
	void EventOnMinigameStarted() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnMinigameEnded
	void EventOnMinigameEnded(EEndMinigameReason Reason) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EEndMinigameReason);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func(Reason);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.SpawnMinigameWidget
	void SpawnMinigameWidget() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.UpdateProgressBar
	void UpdateProgressBar(float PreviousPoints) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func(PreviousPoints);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func(DeltaSeconds);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventPerformSimulatedUpdate_SweetSpot
	void EventPerformSimulatedUpdate_SweetSpot(FBBQMinigameNetState_SweetSpot& LastSweetSpotState) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQMinigameNetState_SweetSpot&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func(LastSweetSpotState);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnPointsChanged
	void EventOnPointsChanged(float PrevioutsPoints) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func(PrevioutsPoints);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventPerformSimulatedUpdate
	void EventPerformSimulatedUpdate(FBBQMinigameState& LastState) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQMinigameState&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func(LastState);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnClientCorrection
	void EventOnClientCorrection(FBBQMinigameNetState& PreCorrectionNetState) // [0x2438a30] Event|Protected|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FBBQMinigameNetState&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func(PreCorrectionNetState);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventApplyModifiersToInitialSettings
	void EventApplyModifiersToInitialSettings() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventInitializeDefaultSettings
	void EventInitializeDefaultSettings() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[26]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.SweetSpotHit
	void SweetSpotHit() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[27]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.SweetSpotMissed
	void SweetSpotMissed() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[28]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x2438a30] Event|Protected|BlueprintEvent 
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnPostClientCorrection
	void EventOnPostClientCorrection() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[30]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.StopLerpProgressBar
	void StopLerpProgressBar() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[31]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.EventOnTimerEnded
	void EventOnTimerEnded(EMinigameTimerId TimerId) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EMinigameTimerId);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[32]);
		func(TimerId);
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.RemoveMinigameUI
	void RemoveMinigameUI() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[33]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.ShowHudAfterDelay
	void ShowHudAfterDelay() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[34]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Minigames/V2/BP_MinigameV2_CircularSweetSpot_Base.BP_MinigameV2_CircularSweetSpot_Base_C.ExecuteUbergraph_BP_MinigameV2_CircularSweetSpot_Base
	void ExecuteUbergraph_BP_MinigameV2_CircularSweetSpot_Base(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[35]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/MiniGames/BP_MinigameV2_CircularSweetSpot_Ripstall_Valve.BP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C
/// Size: 0x0630 (1584 bytes) (0x000621 - 0x000630) align 8 MaxSize: 0x0630
class ABP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C : public ABP_MinigameV2_CircularSweetSpot_Base_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0621   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0628   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/BP_MinigameV2_CircularSweetSpot_Ripstall_Valve.BP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C.InitSettings
	void InitSettings(AActor* VarModOwner) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(VarModOwner);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/BP_MinigameV2_CircularSweetSpot_Ripstall_Valve.BP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C.EventOnMinigameSucceeded
	void EventOnMinigameSucceeded() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/BP_MinigameV2_CircularSweetSpot_Ripstall_Valve.BP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C.SweetSpotMissed
	void SweetSpotMissed() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/MiniGames/BP_MinigameV2_CircularSweetSpot_Ripstall_Valve.BP_MinigameV2_CircularSweetSpot_Ripstall_Valve_C.ExecuteUbergraph_BP_MinigameV2_CircularSweetSpot_Ripstall_Valve
	void ExecuteUbergraph_BP_MinigameV2_CircularSweetSpot_Ripstall_Valve(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C
/// Size: 0x03F0 (1008 bytes) (0x0002E8 - 0x0003F0) align 16 MaxSize: 0x03F0
class ABP_CB_AnimatedHold_C : public ABBQCharacterBehaviour
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02F0   (0x0008)  
	class UAnimMontage*                                MontageToPlay;                                              // 0x02F8   (0x0008)  
	class UAkAudioEvent*                               StartSound;                                                 // 0x0300   (0x0008)  
	class UAkAudioEvent*                               EndSound;                                                   // 0x0308   (0x0008)  
	class UAkAudioEvent*                               CancelSound;                                                // 0x0310   (0x0008)  
	float                                              HoldTime;                                                   // 0x0318   (0x0004)  
	EInteractionMethod                                 MyInteractionMethod;                                        // 0x031C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x031D   (0x0003)  MISSED
	float                                              Timer;                                                      // 0x0320   (0x0004)  
	EBBQAnimSlot                                       AnimSlot;                                                   // 0x0324   (0x0001)  
	bool                                               UseAnimSlot;                                                // 0x0325   (0x0001)  
	bool                                               SlideIntoPlace;                                             // 0x0326   (0x0001)  
	unsigned char                                      UnknownData01_6[0x9];                                       // 0x0327   (0x0009)  MISSED
	FTransform                                         SlideToPlaceTransform;                                      // 0x0330   (0x0030)  
	class ABBQGameSessionCharacterAnimated*            As_BBQGame_Session_Character_Animated;                      // 0x0360   (0x0008)  
	bool                                               StopAnimOnMinigameComplete;                                 // 0x0368   (0x0001)  
	bool                                               IsCancelled;                                                // 0x0369   (0x0001)  
	bool                                               UseProjectedSlideInPlace;                                   // 0x036A   (0x0001)  
	unsigned char                                      UnknownData02_6[0x1];                                       // 0x036B   (0x0001)  MISSED
	float                                              AutoSlideInPlaceDistance;                                   // 0x036C   (0x0004)  
	bool                                               IsComplete;                                                 // 0x0370   (0x0001)  
	bool                                               IsBeingReplaced;                                            // 0x0371   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x0372   (0x0002)  MISSED
	FGameplayTag                                       SlideInPlaceMovementState;                                  // 0x0374   (0x0008)  
	float                                              AnimPlayRate;                                               // 0x037C   (0x0004)  
	FName                                              CancelAnimGroupName;                                        // 0x0380   (0x0008)  
	bool                                               UseBlueprintInUse;                                          // 0x0388   (0x0001)  
	bool                                               AnimateAfterHoldComplete;                                   // 0x0389   (0x0001)  
	unsigned char                                      UnknownData04_6[0x6];                                       // 0x038A   (0x0006)  MISSED
	FTimerHandle                                       PostHoldCompleted;                                          // 0x0390   (0x0008)  
	bool                                               bExternalCancel;                                            // 0x0398   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x0399   (0x0007)  MISSED
	FGameplayTagContainer                              AnimGrantedTags;                                            // 0x03A0   (0x0020)  
	bool                                               ForceExternalCancel;                                        // 0x03C0   (0x0001)  
	bool                                               ShowHUD;                                                    // 0x03C1   (0x0001)  
	unsigned char                                      UnknownData06_6[0x2];                                       // 0x03C2   (0x0002)  MISSED
	int32_t                                            OnStartPlayingID;                                           // 0x03C4   (0x0004)  
	bool                                               PlayStartSoundOnEnterBehaviour;                             // 0x03C8   (0x0001)  
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x03C9   (0x0007)  MISSED
	class UDataTable*                                  OnCompleteGameplayActivityEventDataTable;                   // 0x03D0   (0x0008)  
	FName                                              OnCompleteActivityEventRowName;                             // 0x03D8   (0x0008)  
	float                                              HoldTimeMultiplier;                                         // 0x03E0   (0x0004)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x03E4   (0x0004)  MISSED
	FTimerHandle                                       HoldTimeResetTimer;                                         // 0x03E8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.GetAnimatedHoldTime
	float GetAnimatedHoldTime() // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef float (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.ApplyPerkSlowHands
	void ApplyPerkSlowHands() // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.RemovePerkSlowHands
	void RemovePerkSlowHands() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.GetPlayingCharacter
	void GetPlayingCharacter(ABBQGameSessionCharacterAnimated*& PlayingCharacter) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(PlayingCharacter);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.GettHoldTimeMultiplier
	void GettHoldTimeMultiplier(float& HoldTimeMul) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(HoldTimeMul);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.IsStartSoundInfinite
	void IsStartSoundInfinite(bool& Bool) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(Bool);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.PerformSlideInPlace
	void PerformSlideInPlace() // [0x2438a30] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.Auth_StopInteractingWithTarget
	void Auth_StopInteractingWithTarget() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.Auth_StartInteractingWithTarget
	void Auth_StartInteractingWithTarget() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.TimeLeftAfterHoldIsComplete
	void TimeLeftAfterHoldIsComplete(float& TimeLeft) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(TimeLeft);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.GetProjectedTransform
	void GetProjectedTransform(float B, FTransform& SlideInPlace) // [0x2438a30] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float, FTransform&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(B, SlideInPlace);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.BP_OnEnterBehaviour
	void BP_OnEnterBehaviour(ABBQCharacterBehaviour* OldBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(OldBehaviour);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.BP_OnExitBehaviour
	void BP_OnExitBehaviour(ABBQCharacterBehaviour* NewBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(NewBehaviour);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.HoldEnded
	void HoldEnded(EInteractionMethod InteractionMethod) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EInteractionMethod);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(InteractionMethod);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(DeltaSeconds);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.Server_OnHoldCompleted
	void Server_OnHoldCompleted() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.Server_OnHoldCancelled
	void Server_OnHoldCancelled() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.StopAnimOnAll
	void StopAnimOnAll() // [0x2438a30] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.PlayExitSound
	void PlayExitSound(bool IsCancelled, ABBQGameSessionCharacter* Character) // [0x2438a30] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, ABBQGameSessionCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func(IsCancelled, Character);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.ForceResetMovementState
	void ForceResetMovementState() // [0x2438a30] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.OnAnimateCharacter
	// void OnAnimateCharacter(TEnumAsByte<EReplicationState> Replication);                                                     // [0x2438a30] BlueprintCallable|BlueprintEvent 
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.Server_OnPostHoldCompleted
	void Server_OnPostHoldCompleted() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[21]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.PlayStartSound
	void PlayStartSound() // [0x2438a30] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[22]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.OnStartSoundEnd
	void OnStartSoundEnd(EAkCallbackType CallbackType, UAkCallbackInfo* CallbackInfo) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EAkCallbackType, UAkCallbackInfo*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[23]);
		func(CallbackType, CallbackInfo);
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.LocalPlayStartSound
	void LocalPlayStartSound() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[24]);
		func();
	}
	// Function /Game/BBQGame/Gameplay/Behaviours/BP_CB_AnimatedHold.BP_CB_AnimatedHold_C.ExecuteUbergraph_BP_CB_AnimatedHold
	void ExecuteUbergraph_BP_CB_AnimatedHold(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[25]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_Battery_Base.BP_CB_Battery_Base_C
/// Size: 0x0419 (1049 bytes) (0x0003F0 - 0x000419) align 16 MaxSize: 0x0419
class ABP_CB_Battery_Base_C : public ABP_CB_AnimatedHold_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03F0   (0x0008)  
	class UBBQElectroTrapComponent*                    ElectroTrap;                                                // 0x03F8   (0x0008)  
	EBBQElectroTrapInteraction                         ElectroTrapInteraction;                                     // 0x0400   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0401   (0x0003)  MISSED
	FName                                              LocatorContext;                                             // 0x0404   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x040C   (0x0004)  MISSED
	class UBP_ElectroTrapComponent_C*                  BP_Electro_Trap_Component;                                  // 0x0410   (0x0008)  
	bool                                               UseInteractionSettings;                                     // 0x0418   (0x0001)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_Battery_Base.BP_CB_Battery_Base_C.BP_OnExitBehaviour
	void BP_OnExitBehaviour(ABBQCharacterBehaviour* NewBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_Battery_Base.BP_CB_Battery_Base_C.BP_OnEnterBehaviour
	void BP_OnEnterBehaviour(ABBQCharacterBehaviour* OldBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(OldBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_Battery_Base.BP_CB_Battery_Base_C.ExecuteUbergraph_BP_CB_Battery_Base
	void ExecuteUbergraph_BP_CB_Battery_Base(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_RemoveBattery.BP_CB_RemoveBattery_C
/// Size: 0x0428 (1064 bytes) (0x000419 - 0x000428) align 16 MaxSize: 0x0428
class ABP_CB_RemoveBattery_C : public ABP_CB_Battery_Base_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0419   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0420   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_RemoveBattery.BP_CB_RemoveBattery_C.Server_OnHoldCompleted
	void Server_OnHoldCompleted() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_RemoveBattery.BP_CB_RemoveBattery_C.BP_OnExitBehaviour
	void BP_OnExitBehaviour(ABBQCharacterBehaviour* NewBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(NewBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_RemoveBattery.BP_CB_RemoveBattery_C.BP_OnEnterBehaviour
	void BP_OnEnterBehaviour(ABBQCharacterBehaviour* OldBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(OldBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_RemoveBattery.BP_CB_RemoveBattery_C.ExecuteUbergraph_BP_CB_RemoveBattery
	void ExecuteUbergraph_BP_CB_RemoveBattery(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery.BP_CB_DisableBattery_C
/// Size: 0x0428 (1064 bytes) (0x000419 - 0x000428) align 16 MaxSize: 0x0428
class ABP_CB_DisableBattery_C : public ABP_CB_Battery_Base_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0419   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0420   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery.BP_CB_DisableBattery_C.Server_OnHoldCompleted
	void Server_OnHoldCompleted() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery.BP_CB_DisableBattery_C.BP_OnExitBehaviour
	void BP_OnExitBehaviour(ABBQCharacterBehaviour* NewBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(NewBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery.BP_CB_DisableBattery_C.BP_OnEnterBehaviour
	void BP_OnEnterBehaviour(ABBQCharacterBehaviour* OldBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(OldBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery.BP_CB_DisableBattery_C.ExecuteUbergraph_BP_CB_DisableBattery
	void ExecuteUbergraph_BP_CB_DisableBattery(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery_NoInventory.BP_CB_DisableBattery_NoInventory_C
/// Size: 0x0430 (1072 bytes) (0x000428 - 0x000430) align 16 MaxSize: 0x0430
class ABP_CB_DisableBattery_NoInventory_C : public ABP_CB_DisableBattery_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0428   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery_NoInventory.BP_CB_DisableBattery_NoInventory_C.OnTrapDeactivated
	void OnTrapDeactivated() // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery_NoInventory.BP_CB_DisableBattery_NoInventory_C.Server_OnHoldCompleted
	void Server_OnHoldCompleted() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_DisableBattery_NoInventory.BP_CB_DisableBattery_NoInventory_C.ExecuteUbergraph_BP_CB_DisableBattery_NoInventory
	void ExecuteUbergraph_BP_CB_DisableBattery_NoInventory(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_AddBattery.BP_CB_AddBattery_C
/// Size: 0x0428 (1064 bytes) (0x000419 - 0x000428) align 16 MaxSize: 0x0428
class ABP_CB_AddBattery_C : public ABP_CB_Battery_Base_C
{ 
public:
	unsigned char                                      UnknownData00_8[0x7];                                       // 0x0419   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0420   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_AddBattery.BP_CB_AddBattery_C.Server_OnHoldCompleted
	void Server_OnHoldCompleted() // [0x2438a30] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_AddBattery.BP_CB_AddBattery_C.BP_OnExitBehaviour
	void BP_OnExitBehaviour(ABBQCharacterBehaviour* NewBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(NewBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_AddBattery.BP_CB_AddBattery_C.BP_OnEnterBehaviour
	void BP_OnEnterBehaviour(ABBQCharacterBehaviour* OldBehaviour) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQCharacterBehaviour*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(OldBehaviour);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Behaviours/BP_CB_AddBattery.BP_CB_AddBattery_C.ExecuteUbergraph_BP_CB_AddBattery
	void ExecuteUbergraph_BP_CB_AddBattery(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C
/// Size: 0x01A0 (416 bytes) (0x000130 - 0x0001A0) align 8 MaxSize: 0x01A0
class UBP_ElectroTrapComponent_C : public UBBQElectroTrapComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0130   (0x0008)  
	class UAkAudioEvent*                               AkEventBatteryEnabled;                                      // 0x0138   (0x0008)  
	class UAkAudioEvent*                               AkEventBatteryDisabled;                                     // 0x0140   (0x0008)  
	TArray<class UAkComponent*>                        AkComponent;                                                // 0x0148   (0x0010)  
	TArray<class UNiagaraComponent*>                   ObjectVFXComponent;                                         // 0x0158   (0x0010)  
	bool                                               UsingFreeTrap;                                              // 0x0168   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0169   (0x0007)  MISSED
	TArray<class ABP_ElectroTrap_C*>                   ElectroTrapActors;                                          // 0x0170   (0x0010)  
	bool                                               OnCooldown;                                                 // 0x0180   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0181   (0x0007)  MISSED
	class UNiagaraSystem*                              DefaultObjectTrapVFX;                                       // 0x0188   (0x0008)  
	class UNiagaraSystem*                              FreeTrapObjectTrapVFX;                                      // 0x0190   (0x0008)  
	class UAkAudioEvent*                               AkEventBatteryEnabled_Delayed;                              // 0x0198   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.OnCooldownFinished
	void OnCooldownFinished() // [0x2438a30] Private|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.IsOnCoolDown
	void IsOnCoolDown(bool& IsOnCoolDown) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(IsOnCoolDown);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.OnRep_UsingFreeTrap
	void OnRep_UsingFreeTrap() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.SetElectroTrapsLocation
	// void SetElectroTrapsLocation(TArray<USceneComponent*>& Locators);                                                        // [0x2438a30] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.CreateElectroTrapActor
	void CreateElectroTrapActor(EBBQElectroTrapState OldState, EBBQElectroTrapState NewState) // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQElectroTrapState, EBBQElectroTrapState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(OldState, NewState);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.HasTrap
	void HasTrap(bool& HasTrap) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(HasTrap);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.RipstallFreeTrapAbility
	void RipstallFreeTrapAbility(ABBQGameSessionCharacter* Character) // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(Character);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.IsUsingFreeTrap
	void IsUsingFreeTrap(bool& UsingFreeTrap) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef void (*FuncPtr)(bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(UsingFreeTrap);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.ForceDeactivate
	void ForceDeactivate() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.SetupComponents
	void SetupComponents(UAkComponent* AkComponent, UNiagaraComponent* VfxCompononent) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(UAkComponent*, UNiagaraComponent*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(AkComponent, VfxCompononent);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.OnTrapTriggered
	void OnTrapTriggered(ABBQGameSessionCharacterAnimated* TriggeringCharacter, ABBQGameSessionCharacterAnimated* TrapOwnerCharacter) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(TriggeringCharacter, TrapOwnerCharacter);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.OnStateChanged
	void OnStateChanged(EBBQElectroTrapState OldState, EBBQElectroTrapState NewState) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQElectroTrapState, EBBQElectroTrapState);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(OldState, NewState);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.RemoveFreeTrap
	void RemoveFreeTrap(ABBQGameSessionCharacter* Character) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func(Character);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.EnablingBattery
	void EnablingBattery(ABBQGameSessionCharacter* Instigator, FTransform SlideToTransform) // [0x2438a30] Net|NetMulticast|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacter*, FTransform);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func(Instigator, SlideToTransform);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.Server_BeginCooldown
	void Server_BeginCooldown(float CoolDownTime) // [0x2438a30] Net|NetServer|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func(CoolDownTime);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/BluePrints/BP_ElectroTrapComponent.BP_ElectroTrapComponent_C.ExecuteUbergraph_BP_ElectroTrapComponent
	void ExecuteUbergraph_BP_ElectroTrapComponent(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_PerkUI_BluntForceTraumaHit.GAE_PerkUI_BluntForceTraumaHit_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_PerkUI_BluntForceTraumaHit_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_BluntForceTrauma.GAA_BluntForceTrauma_C
/// Size: 0x0500 (1280 bytes) (0x0004F0 - 0x000500) align 8 MaxSize: 0x0500
class UGAA_BluntForceTrauma_C : public UBBQGameplayAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F0   (0x0008)  
	FActiveGameplayEffectHandle                        UIEffect;                                                   // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_BluntForceTrauma.GAA_BluntForceTrauma_C.OnChange_B26BBDD34DF51102DBDBA684B7F0409A
	void OnChange_B26BBDD34DF51102DBDBA684B7F0409A(bool bMatchesComparison, float CurrentValue) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(bMatchesComparison, CurrentValue);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_BluntForceTrauma.GAA_BluntForceTrauma_C.K2_ActivateAbility
	void K2_ActivateAbility() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_BluntForceTrauma.GAA_BluntForceTrauma_C.BP_OnGiveAbility
	void BP_OnGiveAbility(FGameplayAbilityActorInfo& ActorInfo, FGameplayAbilitySpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FGameplayAbilityActorInfo&, FGameplayAbilitySpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(ActorInfo, Spec);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_BluntForceTrauma.GAA_BluntForceTrauma_C.ExecuteUbergraph_GAA_BluntForceTrauma
	void ExecuteUbergraph_GAA_BluntForceTrauma(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_ShortFuse_Duration.BP_BBQ_Calculation_ShortFuse_Duration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_ShortFuse_Duration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_ShortFuse_Duration.BP_BBQ_Calculation_ShortFuse_Duration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_PerkUI_ShortFuse.GAE_PerkUI_ShortFuse_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_PerkUI_ShortFuse_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_SlowHands.BP_BBQPerk_SlowHands_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_SlowHands_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_ShortFuse.BP_BBQPerk_ShortFuse_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_ShortFuse_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_RipStalled.BP_BBQPerk_RipStalled_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_RipStalled_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_HeartAttack.BP_BBQPerk_HeartAttack_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_HeartAttack_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_Bruiser.BP_BBQPerk_Bruiser_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_Bruiser_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/Perks/BP_BBQPerk_BluntForceTrauma.BP_BBQPerk_BluntForceTrauma_C
/// Size: 0x0288 (648 bytes) (0x000288 - 0x000288) align 8 MaxSize: 0x0288
class UBP_BBQPerk_BluntForceTrauma_C : public UBBQPerk
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_Cooldown_Calc.BP_BBQ_ALPHAAbility_Attack_Cooldown_Calc_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_ALPHAAbility_Attack_Cooldown_Calc_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_Cooldown_Calc.BP_BBQ_ALPHAAbility_Attack_Cooldown_Calc_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_EndLagCooldown_Calc.BP_BBQ_ALPHAAbility_Attack_EndLagCooldown_Calc_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_ALPHAAbility_Attack_EndLagCooldown_Calc_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_EndLagCooldown_Calc.BP_BBQ_ALPHAAbility_Attack_EndLagCooldown_Calc_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_EndLagMissVictimCooldown_Calc.BP_BBQ_ALPHAAbility_Attack_EndLagMissVictimCooldown_Calc_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_ALPHAAbility_Attack_EndLagMissVictimCooldown_Calc_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/BP_BBQ_ALPHAAbility_Attack_EndLagMissVictimCooldown_Calc.BP_BBQ_ALPHAAbility_Attack_EndLagMissVictimCooldown_Calc_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_Alpha_BargeStaminaCost.BP_BBQ_Calculation_Alpha_BargeStaminaCost_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UBP_BBQ_Calculation_Alpha_BargeStaminaCost_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/BP_BBQ_Calculation_Alpha_BargeStaminaCost.BP_BBQ_Calculation_Alpha_BargeStaminaCost_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/CC_Alpha_Barge_StunImmunity_Duration.CC_Alpha_Barge_StunImmunity_Duration_C
/// Size: 0x0040 (64 bytes) (0x000040 - 0x000040) align 8 MaxSize: 0x0040
class UCC_Alpha_Barge_StunImmunity_Duration_C : public UBBQGameplayModMagnitudeCalc
{ 
public:


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/CC_Alpha_Barge_StunImmunity_Duration.CC_Alpha_Barge_StunImmunity_Duration_C.CalculateBaseMagnitude
	float CalculateBaseMagnitude(FGameplayEffectSpec& Spec) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef float (*FuncPtr)(FGameplayEffectSpec&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(Spec);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_ALPHA_Barging.GAE_ALPHA_Barging_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHA_Barging_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/GAE_ALPHA_Barge_StunImmunity.GAE_ALPHA_Barge_StunImmunity_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHA_Barge_StunImmunity_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Effects/Combat/GAE_Alpha_PerformingBarge.GAE_Alpha_PerformingBarge_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_Alpha_PerformingBarge_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/DamageTypes/BP_BBQDamageType_Barge.BP_BBQDamageType_Barge_C
/// Size: 0x0170 (368 bytes) (0x000170 - 0x000170) align 8 MaxSize: 0x0170
class UBP_BBQDamageType_Barge_C : public UBBQDamageType
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_ALPHAAbility_Stance_GaugeDepletion.GAE_ALPHAAbility_Stance_GaugeDepletion_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHAAbility_Stance_GaugeDepletion_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_ALPHAAbility_Barged_AnimDuration.GAE_ALPHAAbility_Barged_AnimDuration_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHAAbility_Barged_AnimDuration_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_ALPHAAbility_Barge_StaminaCost.GAE_ALPHAAbility_Barge_StaminaCost_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHAAbility_Barge_StaminaCost_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_ALPHAAbility_Attack_EndLag_MissVictim.GAE_ALPHAAbility_Attack_EndLag_MissVictim_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHAAbility_Attack_EndLag_MissVictim_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_ALPHAAbility_Attack_EndLag.GAE_ALPHAAbility_Attack_EndLag_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_ALPHAAbility_Attack_EndLag_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAE_AlphaAbility_Attack_Cooldown.GAE_AlphaAbility_Attack_Cooldown_C
/// Size: 0x08F8 (2296 bytes) (0x0008F8 - 0x0008F8) align 8 MaxSize: 0x08F8
class UGAE_AlphaAbility_Attack_Cooldown_C : public UBBQGameplayEffect
{ 
public:
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Ripstall.GAA_ALPHAAbility_Ripstall_C
/// Size: 0x0510 (1296 bytes) (0x000508 - 0x000510) align 8 MaxSize: 0x0510
class UGAA_ALPHAAbility_Ripstall_C : public UBBQAbilityRipstall
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0508   (0x0008)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Ripstall.GAA_ALPHAAbility_Ripstall_C.K2_ActivateAbility
	void K2_ActivateAbility() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Ripstall.GAA_ALPHAAbility_Ripstall_C.ExecuteUbergraph_GAA_ALPHAAbility_Ripstall
	void ExecuteUbergraph_GAA_ALPHAAbility_Ripstall(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C
/// Size: 0x07C0 (1984 bytes) (0x000738 - 0x0007C0) align 8 MaxSize: 0x07C0
class UGAA_ALPHAAbility_Attack_Main_C : public UBBQAbilityBarge
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0738   (0x0008)  
	float                                              HeldTimeForStance;                                          // 0x0740   (0x0004)  
	bool                                               IsHoldStance;                                               // 0x0744   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0745   (0x0003)  MISSED
	FActiveGameplayEffectHandle                        StaminaDepletionEffect;                                     // 0x0748   (0x0008)  
	bool                                               HitVictim;                                                  // 0x0750   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0751   (0x0007)  MISSED
	class UBBQAbilityTask_WaitInputHold*               InputHoldTask;                                              // 0x0758   (0x0008)  
	FActiveGameplayEffectHandle                        GAE_Barging;                                                // 0x0760   (0x0008)  
	bool                                               EnableAimingAssist;                                         // 0x0768   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0769   (0x0007)  MISSED
	class UAbilityTask_PlayMontageAndWait*             PlayMontageTask;                                            // 0x0770   (0x0008)  
	bool                                               IsBargeTriggered;                                           // 0x0778   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0779   (0x0007)  MISSED
	FGameplayTagContainer                              InterruptibleTraversalStates;                               // 0x0780   (0x0020)  
	FGameplayTagContainer                              DisableHitReactionTags;                                     // 0x07A0   (0x0020)  


	/// Functions
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnRep_HitVictim
	void OnRep_HitVictim() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.CanBargeCharacter
	bool CanBargeCharacter(ABBQGameSessionCharacterAnimated* BargingCharacter, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef bool (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func(BargingCharacter, BargedCharacter);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.ApplyDamageIfVictim
	void ApplyDamageIfVictim(ABBQGameSessionCharacterAnimated* BargeInstigator, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(BargeInstigator, BargedCharacter);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.PlayBargeReaction
	void PlayBargeReaction(ABBQGameSessionCharacterAnimated* BargeInstigator, ABBQGameSessionCharacterAnimated* BargedCharacter, bool& IsPlayed) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(BargeInstigator, BargedCharacter, IsPlayed);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.HeartAttackPerk
	void HeartAttackPerk(AActor* Instigator, AActor* Victim) // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AActor*, AActor*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func(Instigator, Victim);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.Should React to Barge
	void ShouldReacttoBarge(ABBQGameSessionCharacterAnimated* BargedCharacter, bool& Result) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, bool&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(BargedCharacter, Result);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.GetBargeReactionAnimSlot
	EBBQAnimSlot_AddOn1 GetBargeReactionAnimSlot(ABBQGameSessionCharacterAnimated* BargeInstigator, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	{
		typedef EBBQAnimSlot_AddOn1 (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		return func(BargeInstigator, BargedCharacter);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnHoldInterrupted_F98F02FE4D7E428D02B93E88EB21A99B
	void OnHoldInterrupted_F98F02FE4D7E428D02B93E88EB21A99B() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnHoldTimeElapsed_F98F02FE4D7E428D02B93E88EB21A99B
	void OnHoldTimeElapsed_F98F02FE4D7E428D02B93E88EB21A99B() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnRelease_F98F02FE4D7E428D02B93E88EB21A99B
	void OnRelease_F98F02FE4D7E428D02B93E88EB21A99B() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnPressFailed_F98F02FE4D7E428D02B93E88EB21A99B
	void OnPressFailed_F98F02FE4D7E428D02B93E88EB21A99B() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnPress_F98F02FE4D7E428D02B93E88EB21A99B
	void OnPress_F98F02FE4D7E428D02B93E88EB21A99B() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnCancelled_461C6C304E2F6456605512A2FC037AE2
	void OnCancelled_461C6C304E2F6456605512A2FC037AE2() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnInterrupted_461C6C304E2F6456605512A2FC037AE2
	void OnInterrupted_461C6C304E2F6456605512A2FC037AE2() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[13]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnBlendOut_461C6C304E2F6456605512A2FC037AE2
	void OnBlendOut_461C6C304E2F6456605512A2FC037AE2() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[14]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnCompleted_461C6C304E2F6456605512A2FC037AE2
	void OnCompleted_461C6C304E2F6456605512A2FC037AE2() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[15]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnChange_648A6FD840F594D57C1052B4ED13CFCE
	void OnChange_648A6FD840F594D57C1052B4ED13CFCE(bool bMatchesComparison, float CurrentValue) // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[16]);
		func(bMatchesComparison, CurrentValue);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.OnCharacterBarged
	void OnCharacterBarged(ABBQGameSessionCharacterAnimated* BargeInstigator, ABBQGameSessionCharacterAnimated* BargedCharacter) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(ABBQGameSessionCharacterAnimated*, ABBQGameSessionCharacterAnimated*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[17]);
		func(BargeInstigator, BargedCharacter);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.K2_OnEndAbility
	void K2_OnEndAbility(bool bWasCancelled) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[18]);
		func(bWasCancelled);
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.K2_ActivateAbility
	void K2_ActivateAbility() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[19]);
		func();
	}
	// Function /Game/BBQAddOn_Alpha/Gameplay/Player/Abilities/GAA_ALPHAAbility_Attack_Main.GAA_ALPHAAbility_Attack_Main_C.ExecuteUbergraph_GAA_ALPHAAbility_Attack_Main
	void ExecuteUbergraph_GAA_ALPHAAbility_Attack_Main(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[20]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQAddOn_Alpha/Data/VariableMod/Abilities/FamilyAbilities/ALPHA/BP_AbilityPerk_ALPHA.BP_AbilityPerk_ALPHA_C
/// Size: 0x02D0 (720 bytes) (0x0002D0 - 0x0002D0) align 8 MaxSize: 0x02D0
class UBP_AbilityPerk_ALPHA_C : public UBBQFamilyAbilityPerk
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerBase
/// Size: 0x0078 (120 bytes) (0x000030 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerBase : public UGauntletTestController
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0030   (0x0048)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerBasicDedicatedServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerBasicDedicatedServer : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerMatchMakingFlow
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerMatchMakingFlow : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerCompleteGameFlow
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerCompleteGameFlow : public UBBQTestControllerMatchMakingFlow
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerMatchMakingFlowServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerMatchMakingFlowServer : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerCompleteGameFlowServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerCompleteGameFlowServer : public UBBQTestControllerMatchMakingFlowServer
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerComplexPerformanceTest
/// Size: 0x00C0 (192 bytes) (0x000078 - 0x0000C0) align 8 MaxSize: 0x00C0
class UBBQTestControllerComplexPerformanceTest : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0078   (0x0048)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerGamePlayTest
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerGamePlayTest : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerMatchMakingCancelledClient
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerMatchMakingCancelledClient : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerMetaGameClient
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerMetaGameClient : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerMetaGameServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerMetaGameServer : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPerkValidationClient
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPerkValidationClient : public UBBQTestControllerMetaGameClient
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPerkValidationServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPerkValidationServer : public UBBQTestControllerMetaGameServer
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPartyCompleteGameFlowMainClient
/// Size: 0x0090 (144 bytes) (0x000078 - 0x000090) align 8 MaxSize: 0x0090
class UBBQTestControllerPartyCompleteGameFlowMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0078   (0x0018)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyCompleteGameFlowClient
/// Size: 0x0090 (144 bytes) (0x000078 - 0x000090) align 8 MaxSize: 0x0090
class UBBQTestControllerPartyCompleteGameFlowClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0078   (0x0018)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyCreationMainClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyCreationMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyCreationClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyCreationClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyCustomMatchMainClient
/// Size: 0x00A0 (160 bytes) (0x000078 - 0x0000A0) align 8 MaxSize: 0x00A0
class UBBQTestControllerPartyCustomMatchMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0078   (0x0028)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyCustomMatchClient
/// Size: 0x0090 (144 bytes) (0x000078 - 0x000090) align 8 MaxSize: 0x0090
class UBBQTestControllerPartyCustomMatchClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0078   (0x0018)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerNonPartyCustomMatchClient
/// Size: 0x0090 (144 bytes) (0x000078 - 0x000090) align 8 MaxSize: 0x0090
class UBBQTestControllerNonPartyCustomMatchClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0078   (0x0018)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyKickPlayerMainClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyKickPlayerMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyMatchMakingMainClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyMatchMakingMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyMatchMakingClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyMatchMakingClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyMatchMakingCancelledMainClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyMatchMakingCancelledMainClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyMatchMakingCancelledCancellingClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyMatchMakingCancelledCancellingClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPartyMatchMakingCancelledClient
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerPartyMatchMakingCancelledClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPayloadReservationClient
/// Size: 0x0080 (128 bytes) (0x000078 - 0x000080) align 8 MaxSize: 0x0080
class UBBQTestControllerPayloadReservationClient : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0078   (0x0008)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerPayloadReservationServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPayloadReservationServer : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPlayerMatching
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPlayerMatching : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPlayerRankClient
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPlayerRankClient : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerPlayerRankServer
/// Size: 0x0078 (120 bytes) (0x000078 - 0x000078) align 8 MaxSize: 0x0078
class UBBQTestControllerPlayerRankServer : public UBBQTestControllerBase
{ 
public:
};

/// Class /Script/BBQGame.BBQTestControllerScreenshotGather
/// Size: 0x0098 (152 bytes) (0x000078 - 0x000098) align 8 MaxSize: 0x0098
class UBBQTestControllerScreenshotGather : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x20];                                      // 0x0078   (0x0020)  MISSED
};

/// Class /Script/BBQGame.BBQTestControllerSimplePerformanceTest
/// Size: 0x0088 (136 bytes) (0x000078 - 0x000088) align 8 MaxSize: 0x0088
class UBBQTestControllerSimplePerformanceTest : public UBBQTestControllerBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0078   (0x0010)  MISSED
};

/// Class /Game/BBQGame/Gameplay/Player/Effects/Combat/BP_VarSet_Combat.BP_VarSet_Combat_C
/// Size: 0x003C (60 bytes) (0x000038 - 0x00003C) align 8 MaxSize: 0x003C
class UBP_VarSet_Combat_C : public UGameplayVariableSet
{ 
public:
	float                                              SneakAttack_ChanceToNotBreakShard;                          // 0x0038   (0x0004)  
};

/// Class /Game/BBQGame/Gameplay/Player/Abilities/Perks/FamilyPerks/BP_VarSet_FamilyPerks.BP_VarSet_FamilyPerks_C
/// Size: 0x00A4 (164 bytes) (0x000038 - 0x0000A4) align 8 MaxSize: 0x00A4
class UBP_VarSet_FamilyPerks_C : public UGameplayVariableSet
{ 
public:
	float                                              BBQPerkVictimSprintDetectionRadius;                         // 0x0038   (0x0004)  
	int32_t                                            BBQPerkSkinnerAmount;                                       // 0x003C   (0x0004)  
	float                                              BBQPerkSoulCrusherWTLRemovalAmount;                         // 0x0040   (0x0004)  
	float                                              BBQPerksSteadyFeetStunTime;                                 // 0x0044   (0x0004)  
	float                                              BBQPerksTagYoureItHighlightRadius;                          // 0x0048   (0x0004)  
	float                                              BBQPerksSerratedDuration;                                   // 0x004C   (0x0004)  
	float                                              BBQPerksWellBalancedStunTimeMod_in_BP_BBQPerk_WellBalanced; // 0x0050   (0x0004)  
	float                                              HidingSearchTime;                                           // 0x0054   (0x0004)  
	float                                              BBQPerkWellWellWellClimbDamage_USENEWVARS_;                 // 0x0058   (0x0004)  
	float                                              BBQPerkWellWellWellJumpDamage_USENEWVARS_;                  // 0x005C   (0x0004)  
	float                                              KnockoutTimeAfterBloodLet;                                  // 0x0060   (0x0004)  
	float                                              KnockoutTimeWhenPlaced;                                     // 0x0064   (0x0004)  
	float                                              StaminaDrainWhileDragging;                                  // 0x0068   (0x0004)  
	float                                              BBQPerkSuffocatingGripBaseStruggleTimingRate;               // 0x006C   (0x0004)  
	int32_t                                            BBQPerkBargeToThePoint_SuccessRate;                         // 0x0070   (0x0004)  
	float                                              StaminaRegenDelayMultiplier;                                // 0x0074   (0x0004)  
	float                                              UniversalDonorMultiplier;                                   // 0x0078   (0x0004)  
	float                                              ExteriorAlarms_Duration;                                    // 0x007C   (0x0004)  
	float                                              SlowHands_NoiseMinigameProgressRate;                        // 0x0080   (0x0004)  
	float                                              SlowHands_Duration;                                         // 0x0084   (0x0004)  
	float                                              BluntForceTrauma_StaminaThreshold;                          // 0x0088   (0x0004)  
	float                                              HeartAttack_Duration;                                       // 0x008C   (0x0004)  
	float                                              ShortFuse_HighlightDuration;                                // 0x0090   (0x0004)  
	float                                              SpringClean_StaminaConsumptionReduction;                    // 0x0094   (0x0004)  
	float                                              FreshIsBest_VictimBloodPercentage;                          // 0x0098   (0x0004)  
	float                                              FreshIsBest_BloodBucketPercentage;                          // 0x009C   (0x0004)  
	float                                              HeartAttack_BleedingPerSec;                                 // 0x00A0   (0x0004)  
};

/// Class /Game/BBQGame/Gameplay/Player/Abilities/Perks/VictimStarSignPerks/BP_VarSet_VictimStarSignPerkSet.BP_VarSet_VictimStarSignPerkSet_C
/// Size: 0x00E5 (229 bytes) (0x000038 - 0x0000E5) align 8 MaxSize: 0x00E5
class UBP_VarSet_VictimStarSignPerkSet_C : public UGameplayVariableSet
{ 
public:
	float                                              FocusedCooldownAmount;                                      // 0x0038   (0x0004)  
	float                                              FocusedProximityRangeReductionDuration;                     // 0x003C   (0x0004)  
	float                                              FocusStaminaConsumptionAmount;                              // 0x0040   (0x0004)  
	float                                              FirstAidProgressDuration;                                   // 0x0044   (0x0004)  
	float                                              FirstAidCooldownAmount;                                     // 0x0048   (0x0004)  
	float                                              FirstAidBleedoutPauseDuration;                              // 0x004C   (0x0004)  
	float                                              FirstAidStaminaCostReductionAmount;                         // 0x0050   (0x0004)  
	float                                              FirstAidStaminaCostReductionDuration;                       // 0x0054   (0x0004)  
	float                                              FocusProximityRangeReductionAmount;                         // 0x0058   (0x0004)  
	float                                              LifeSaverBuffDuration;                                      // 0x005C   (0x0004)  
	float                                              LifeSaverActivationStackAmount;                             // 0x0060   (0x0004)  
	float                                              LifeSaverHarvestRescueDurationMod;                          // 0x0064   (0x0004)  
	float                                              LifeSaverIncapRescueDurationMod;                            // 0x0068   (0x0004)  
	float                                              PainIsNothingDuration;                                      // 0x006C   (0x0004)  
	float                                              PainIsNothingCooldownAmount;                                // 0x0070   (0x0004)  
	float                                              PainIsNothingDamageMultRedcution;                           // 0x0074   (0x0004)  
	float                                              PainIsNothingMeleeHitStaminaRecover;                        // 0x0078   (0x0004)  
	float                                              UltimateEscapeAbilityUses;                                  // 0x007C   (0x0004)  
	float                                              UltimateEscapeDuration;                                     // 0x0080   (0x0004)  
	float                                              UltimateEscapeCooldown;                                     // 0x0084   (0x0004)  
	float                                              UltimateEscapeStaminaCostMod;                               // 0x0088   (0x0004)  
	float                                              LifeSaverPrimaryStunDuration;                               // 0x008C   (0x0004)  
	float                                              LifeSaverSecondaryStunDuration;                             // 0x0090   (0x0004)  
	float                                              HeightenedSenseCooldown;                                    // 0x0094   (0x0004)  
	float                                              HeightenedSenseDetectionRadius;                             // 0x0098   (0x0004)  
	float                                              HeightenedSenseConsumption;                                 // 0x009C   (0x0004)  
	float                                              HeightenedSenseRecharge;                                    // 0x00A0   (0x0004)  
	bool                                               HeightenedSenseTeamIdentification;                          // 0x00A4   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00A5   (0x0003)  MISSED
	float                                              FocusStaminaRegenInhibitDuration;                           // 0x00A8   (0x0004)  
	float                                              FocusedCooldownStarting;                                    // 0x00AC   (0x0004)  
	float                                              FirstAidCooldownStarting;                                   // 0x00B0   (0x0004)  
	float                                              PainIsNothingCooldownStarting;                              // 0x00B4   (0x0004)  
	float                                              UltimateEscapeCooldownStarting;                             // 0x00B8   (0x0004)  
	float                                              HeightenedSensesCooldownStarting;                           // 0x00BC   (0x0004)  
	float                                              LifeSaverCooldown;                                          // 0x00C0   (0x0004)  
	float                                              LifeSaverCooldownStarting;                                  // 0x00C4   (0x0004)  
	float                                              LifeSaverBargeStunRange;                                    // 0x00C8   (0x0004)  
	float                                              LifeSaverStaminaRestore_L1;                                 // 0x00CC   (0x0004)  
	float                                              LifeSaverStaminaRestore_L2;                                 // 0x00D0   (0x0004)  
	float                                              Focused_DoorUnlock_NoiseTap_Hold;                           // 0x00D4   (0x0004)  
	float                                              Focused_DoorUnlock_SweetSpotSize;                           // 0x00D8   (0x0004)  
	float                                              Focused_DoorUnlock_ProgressHoldPointsPerTick;               // 0x00DC   (0x0004)  
	float                                              Focused_DoorUnlock_ProgressPointsOnTap;                     // 0x00E0   (0x0004)  
	bool                                               PainIsNothingAlwaysApplyStaminaRecover;                     // 0x00E4   (0x0001)  
};

/// Class /Game/BBQGame/Data/VariableSets/BP_VarSet_Minigames.BP_VarSet_Minigames_C
/// Size: 0x031C (796 bytes) (0x000038 - 0x00031C) align 8 MaxSize: 0x031C
class UBP_VarSet_Minigames_C : public UGameplayVariableSet
{ 
public:
	float                                              ChainsawActivate_TimeOut;                                   // 0x0038   (0x0004)  
	float                                              ChainsawActivate_MinPoints;                                 // 0x003C   (0x0004)  
	float                                              ChainsawActivate_MaxPoints;                                 // 0x0040   (0x0004)  
	float                                              ChainsawActivate_StartPoints;                               // 0x0044   (0x0004)  
	float                                              ChainsawActivate_DecayRate;                                 // 0x0048   (0x0004)  
	float                                              ChainsawActivate_DecayValue;                                // 0x004C   (0x0004)  
	float                                              ChainsawActivate_SweetZoneHitAddPoints;                     // 0x0050   (0x0004)  
	float                                              ChainsawActivate_SweetZoneMissAddPoints;                    // 0x0054   (0x0004)  
	float                                              ChainsawActivate_SweetZoneSize;                             // 0x0058   (0x0004)  
	float                                              ChainsawActivate_MarkerSpeedModifier;                       // 0x005C   (0x0004)  
	float                                              DoorUnlock_TimeOut;                                         // 0x0060   (0x0004)  
	float                                              DoorUnlock_MinPoints;                                       // 0x0064   (0x0004)  
	float                                              DoorUnlock_MaxPoints;                                       // 0x0068   (0x0004)  
	float                                              DoorUnlock_StartPoints;                                     // 0x006C   (0x0004)  
	float                                              DoorUnlock_DecayRate;                                       // 0x0070   (0x0004)  
	float                                              DoorUnlock_DecayValue;                                      // 0x0074   (0x0004)  
	int32_t                                            DoorUnlock_NumberOfSections;                                // 0x0078   (0x0004)  
	float                                              DoorUnlock_SweetSpotSize;                                   // 0x007C   (0x0004)  
	float                                              DoorUnlock_HoldUpdateTickRate;                              // 0x0080   (0x0004)  
	float                                              DoorUnlock_ProgressHoldPointsPerTick;                       // 0x0084   (0x0004)  
	float                                              DoorUnlock_ProgressPointsOnTap;                             // 0x0088   (0x0004)  
	float                                              DoorUnlock_NoiseHoldValuePerTick;                           // 0x008C   (0x0004)  
	float                                              DoorUnlock_NoiseValueOnTap;                                 // 0x0090   (0x0004)  
	float                                              DoorUnlock_NoiseMaxValue;                                   // 0x0094   (0x0004)  
	float                                              DoorUnlock_NoiseDecayTickRate;                              // 0x0098   (0x0004)  
	float                                              DoorUnlock_NoiseDecayPerTick;                               // 0x009C   (0x0004)  
	float                                              Fusebox_TimeOut;                                            // 0x00A0   (0x0004)  
	float                                              CloseEncounter_TimeOut;                                     // 0x00A4   (0x0004)  
	float                                              CloseEncounter_MinPoints;                                   // 0x00A8   (0x0004)  
	float                                              CloseEncounter_MaxPoints;                                   // 0x00AC   (0x0004)  
	float                                              CloseEncounter_StartPoints;                                 // 0x00B0   (0x0004)  
	float                                              CloseEncounter_DecayRate;                                   // 0x00B4   (0x0004)  
	float                                              CloseEncounter_DecayValue;                                  // 0x00B8   (0x0004)  
	float                                              CloseEncounter_PointsPerTapVictim;                          // 0x00BC   (0x0004)  
	float                                              CloseEncounter_PointsPerTapFamily;                          // 0x00C0   (0x0004)  
	float                                              CloseEncounter_VictimMaxBuffedStartPoints;                  // 0x00C4   (0x0004)  
	float                                              CloseEncounter_VictimBuffedPercentStartMin;                 // 0x00C8   (0x0004)  
	float                                              CloseEncounter_VictimBuffedPercentStartMax;                 // 0x00CC   (0x0004)  
	float                                              DoorBarge_TimeOut;                                          // 0x00D0   (0x0004)  
	float                                              DoorBarge_MinPoints;                                        // 0x00D4   (0x0004)  
	float                                              DoorBarge_MaxPoints;                                        // 0x00D8   (0x0004)  
	float                                              DoorBarge_StartPoints;                                      // 0x00DC   (0x0004)  
	float                                              DoorBarge_DecayRate;                                        // 0x00E0   (0x0004)  
	float                                              DoorBarge_DecayValue;                                       // 0x00E4   (0x0004)  
	float                                              GeneratorActivate_TimeOut;                                  // 0x00E8   (0x0004)  
	float                                              GeneratorActivate_MinPoints;                                // 0x00EC   (0x0004)  
	float                                              GeneratorActivate_MaxPoints;                                // 0x00F0   (0x0004)  
	float                                              GeneratorActivate_StartPoints;                              // 0x00F4   (0x0004)  
	float                                              GeneratorActivate_DecayRate;                                // 0x00F8   (0x0004)  
	float                                              GeneratorActivate_DecayValue;                               // 0x00FC   (0x0004)  
	float                                              EscapeRestraints_TimeOut;                                   // 0x0100   (0x0004)  
	float                                              EscapeRestraints_MinPoints;                                 // 0x0104   (0x0004)  
	float                                              EscapeRestraints_MaxPoints;                                 // 0x0108   (0x0004)  
	float                                              EscapeRestraints_StartPoints;                               // 0x010C   (0x0004)  
	float                                              EscapeRestraints_DecayRate;                                 // 0x0110   (0x0004)  
	float                                              EscapeRestraints_DecayValue;                                // 0x0114   (0x0004)  
	float                                              EscapeTrap_TimeOut;                                         // 0x0118   (0x0004)  
	float                                              EscapeTrap_MinPoints;                                       // 0x011C   (0x0004)  
	float                                              EscapeTrap_MaxPoints;                                       // 0x0120   (0x0004)  
	float                                              EscapeTrap_StartPoints;                                     // 0x0124   (0x0004)  
	float                                              EscapeTrap_DecayRate;                                       // 0x0128   (0x0004)  
	float                                              EscapeTrap_DecayValue;                                      // 0x012C   (0x0004)  
	float                                              ItemGather_TimeOut;                                         // 0x0130   (0x0004)  
	float                                              ItemGather_MinPoints;                                       // 0x0134   (0x0004)  
	float                                              ItemGather_MaxPoints;                                       // 0x0138   (0x0004)  
	float                                              ItemGather_StartPoints;                                     // 0x013C   (0x0004)  
	float                                              ItemGather_DecayRate;                                       // 0x0140   (0x0004)  
	float                                              ItemGather_DecayValue;                                      // 0x0144   (0x0004)  
	float                                              BoltholeOpen_TimeOut;                                       // 0x0148   (0x0004)  
	float                                              BoltholeOpen_MinPoints;                                     // 0x014C   (0x0004)  
	float                                              BoltholeOpen_MaxPoints;                                     // 0x0150   (0x0004)  
	float                                              BoltholeOpen_StartPoints;                                   // 0x0154   (0x0004)  
	float                                              BoltholeOpen_DecayRate;                                     // 0x0158   (0x0004)  
	float                                              BoltholeOpen_DecayValue;                                    // 0x015C   (0x0004)  
	float                                              GeneratorActivate_SweetZoneHitAddPoints;                    // 0x0160   (0x0004)  
	float                                              GeneratorActivate_SweetZoneMissAddPoints;                   // 0x0164   (0x0004)  
	float                                              GeneratorActivate_SweetZoneSize;                            // 0x0168   (0x0004)  
	float                                              GeneratorActivate_MarkerSpeedModifier;                      // 0x016C   (0x0004)  
	float                                              DoorBarge_SweetZoneHitAddPoints;                            // 0x0170   (0x0004)  
	float                                              DoorBarge_SweetZoneMissAddPoints;                           // 0x0174   (0x0004)  
	float                                              DoorBarge_DefaultSweetZoneMiddle;                           // 0x0178   (0x0004)  
	float                                              DoorBarge_SweetZoneSize;                                    // 0x017C   (0x0004)  
	float                                              DoorBarge_MarkerSpeedModifier;                              // 0x0180   (0x0004)  
	float                                              EscapeRestraints_SweetZoneHitAddPoints;                     // 0x0184   (0x0004)  
	float                                              EscapeRestraints_SweetZoneSize;                             // 0x0188   (0x0004)  
	float                                              EscapeRestraints_MarkerSpeedModifier;                       // 0x018C   (0x0004)  
	float                                              EscapeTrap_HoldUpdateTickRate;                              // 0x0190   (0x0004)  
	float                                              EscapeTrap_ProgressHoldPointsPerTick;                       // 0x0194   (0x0004)  
	float                                              EscapeTrap_ProgressPointsOnTap;                             // 0x0198   (0x0004)  
	float                                              EscapeTrap_NoiseHoldValuePerTick;                           // 0x019C   (0x0004)  
	float                                              EscapeTrap_NoiseValueOnTap;                                 // 0x01A0   (0x0004)  
	float                                              EscapeTrap_NoiseMaxValue;                                   // 0x01A4   (0x0004)  
	float                                              EscapeTrap_NoiseDecayTickRate;                              // 0x01A8   (0x0004)  
	float                                              EscapeTrap_NoiseDecayPerTick;                               // 0x01AC   (0x0004)  
	float                                              ItemGather_HoldUpdateTickRate;                              // 0x01B0   (0x0004)  
	float                                              ItemGather_ProgressHoldPointsPerTick;                       // 0x01B4   (0x0004)  
	float                                              ItemGather_ProgressPointsOnTap;                             // 0x01B8   (0x0004)  
	float                                              ItemGather_NoiseHoldValuePerTick;                           // 0x01BC   (0x0004)  
	float                                              ItemGather_NoiseValueOnTap;                                 // 0x01C0   (0x0004)  
	float                                              ItemGather_NoiseMaxValue;                                   // 0x01C4   (0x0004)  
	float                                              ItemGather_NoiseDecayTickRate;                              // 0x01C8   (0x0004)  
	float                                              ItemGather_NoiseDecayPerTick;                               // 0x01CC   (0x0004)  
	float                                              BoltholeOpen_HoldUpdateTickRate;                            // 0x01D0   (0x0004)  
	float                                              BoltholeOpen_ProgressHoldPointsPerTick;                     // 0x01D4   (0x0004)  
	float                                              BoltholeOpen_ProgressPointsOnTap;                           // 0x01D8   (0x0004)  
	float                                              BoltholeOpen_NoiseHoldValuePerTick;                         // 0x01DC   (0x0004)  
	float                                              BoltholeOpen_NoiseValueOnTap;                               // 0x01E0   (0x0004)  
	float                                              BoltholeOpen_NoiseMaxValue;                                 // 0x01E4   (0x0004)  
	float                                              BoltholeOpen_NoiseDecayTickRate;                            // 0x01E8   (0x0004)  
	float                                              BoltholeOpen_NoiseDecayPerTick;                             // 0x01EC   (0x0004)  
	float                                              Fusebox_DoorOpenLength;                                     // 0x01F0   (0x0004)  
	float                                              Generator_CooldownTime;                                     // 0x01F4   (0x0004)  
	float                                              WaterValve_CooldownTime;                                    // 0x01F8   (0x0004)  
	float                                              Trap_ResetHoldTime;                                         // 0x01FC   (0x0004)  
	float                                              Trap_PlaceTrapHoldTime;                                     // 0x0200   (0x0004)  
	float                                              GatherPowder_HoldTime;                                      // 0x0204   (0x0004)  
	float                                              Trap_DismantleHoldTime;                                     // 0x0208   (0x0004)  
	float                                              GeneratorActivate_TurnOffHoldTime;                          // 0x020C   (0x0004)  
	float                                              DestroyDoor_HoldTime;                                       // 0x0210   (0x0004)  
	float                                              DestroyClamberObstacle_HoldTime;                            // 0x0214   (0x0004)  
	float                                              EscapeTrap_MaxNoiseDamage;                                  // 0x0218   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_TimeOut;                        // 0x021C   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_MinPoints;                      // 0x0220   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_MaxPoints;                      // 0x0224   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_StartPoints;                    // 0x0228   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_DecayRate;                      // 0x022C   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_DecayValue;                     // 0x0230   (0x0004)  
	float                                              EscapeRestraints_ButtonMash_PointsPerTap;                   // 0x0234   (0x0004)  
	float                                              EscapeRestraints_Interaction_TimeOut;                       // 0x0238   (0x0004)  
	float                                              EscapeRestraints_Interaction_MinPoints;                     // 0x023C   (0x0004)  
	float                                              EscapeRestraints_Interaction_MaxPoints;                     // 0x0240   (0x0004)  
	float                                              EscapeRestraints_Interaction_StartPoints;                   // 0x0244   (0x0004)  
	float                                              EscapeRestraints_Interaction_DecayRate;                     // 0x0248   (0x0004)  
	float                                              EscapeRestraints_Interaction_DecayValue;                    // 0x024C   (0x0004)  
	float                                              EscapeRestraints_Interaction_HoldUpdateTickRate;            // 0x0250   (0x0004)  
	float                                              EscapeRestraints_Interaction_ProgressPointsPerTick;         // 0x0254   (0x0004)  
	float                                              EscapeRestraints_Interaction_ProgressPointsOnTap;           // 0x0258   (0x0004)  
	float                                              EscapeRestraints_Interaction_NoiseHoldValuePerTick;         // 0x025C   (0x0004)  
	float                                              EscapeRestraints_Interaction_NoiseValueOnTap;               // 0x0260   (0x0004)  
	float                                              EscapeRestraints_Interaction_NoiseMaxValue;                 // 0x0264   (0x0004)  
	float                                              EscapeRestraints_Interaction_NoiseDecayTickRate;            // 0x0268   (0x0004)  
	float                                              EscapeRestraints_Interaction_NoiseDecayPerTick;             // 0x026C   (0x0004)  
	float                                              EscapeTrap_ProgressPointsOnTapBarbedWire;                   // 0x0270   (0x0004)  
	float                                              EscapeTrap_MaxNoiseDamageBarbWire;                          // 0x0274   (0x0004)  
	float                                              Valve_TimeOut;                                              // 0x0278   (0x0004)  
	float                                              Valve_MinPoints;                                            // 0x027C   (0x0004)  
	float                                              Valve_MaxPoints;                                            // 0x0280   (0x0004)  
	float                                              Valve_StartPoints;                                          // 0x0284   (0x0004)  
	float                                              Valve_DecayRate;                                            // 0x0288   (0x0004)  
	float                                              Valve_DecayValue;                                           // 0x028C   (0x0004)  
	float                                              Valve_HoldUpdateTickRate;                                   // 0x0290   (0x0004)  
	float                                              Valve_ProgressHoldPointsPerTick;                            // 0x0294   (0x0004)  
	float                                              Valve_ProgressPointsOnTap;                                  // 0x0298   (0x0004)  
	float                                              Valve_NoiseHoldValuePerTick;                                // 0x029C   (0x0004)  
	float                                              Valve_NoiseValueOnTap;                                      // 0x02A0   (0x0004)  
	float                                              Valve_NoiseMaxValue;                                        // 0x02A4   (0x0004)  
	float                                              Valve_NoiseDecayTickRate;                                   // 0x02A8   (0x0004)  
	float                                              Valve_NoiseDecayPerTick;                                    // 0x02AC   (0x0004)  
	float                                              CarBattery_TurnOffHoldTime;                                 // 0x02B0   (0x0004)  
	float                                              CarBattery_TurnOnHoldTime;                                  // 0x02B4   (0x0004)  
	float                                              Tamper_TimeOut;                                             // 0x02B8   (0x0004)  
	float                                              Tamper_MinPoints;                                           // 0x02BC   (0x0004)  
	float                                              Tamper_MaxPoints;                                           // 0x02C0   (0x0004)  
	float                                              Tamper_StartPoints;                                         // 0x02C4   (0x0004)  
	float                                              Tamper_DecayRate;                                           // 0x02C8   (0x0004)  
	float                                              Tamper_DecayValue;                                          // 0x02CC   (0x0004)  
	int32_t                                            Tamper_NumberOfSections;                                    // 0x02D0   (0x0004)  
	float                                              Tamper_SweetSpotSize;                                       // 0x02D4   (0x0004)  
	float                                              Tamper_HoldUpdateTickRate;                                  // 0x02D8   (0x0004)  
	float                                              Tamper_ProgressHoldPointsPerTick;                           // 0x02DC   (0x0004)  
	float                                              Tamper_ProgressPointsOnTap;                                 // 0x02E0   (0x0004)  
	float                                              Tamper_NoiseHoldValuePerTick;                               // 0x02E4   (0x0004)  
	float                                              Tamper_NoiseValueOnTap;                                     // 0x02E8   (0x0004)  
	float                                              Tamper_NoiseMaxValue;                                       // 0x02EC   (0x0004)  
	float                                              Tamper_NoiseDecayTickRate;                                  // 0x02F0   (0x0004)  
	float                                              Tamper_NoiseDecayPerTick;                                   // 0x02F4   (0x0004)  
	float                                              Tamper_MaxNoiseDamage;                                      // 0x02F8   (0x0004)  
	float                                              DoorBarge_StartDelay;                                       // 0x02FC   (0x0004)  
	float                                              EscapeTrap_MaxPoints_FamilyMult;                            // 0x0300   (0x0004)  
	float                                              FuseBox_AfterSwitchingOnCooldownTime;                       // 0x0304   (0x0004)  
	float                                              FuseBox_AfterSwitchingOffCooldownTime;                      // 0x0308   (0x0004)  
	float                                              Trap_CollectHoldTime;                                       // 0x030C   (0x0004)  
	float                                              Tamper_FuseboxCloseTime;                                    // 0x0310   (0x0004)  
	float                                              Tamper_GeneratorCooldownTime;                               // 0x0314   (0x0004)  
	float                                              BatteryTrap_DisableHoldTime;                                // 0x0318   (0x0004)  
};

/// Class /Game/BBQGame/Data/VariableSets/BP_VarSet_Player.BP_VarSet_Player_C
/// Size: 0x0284 (644 bytes) (0x000038 - 0x000284) align 8 MaxSize: 0x0284
class UBP_VarSet_Player_C : public UGameplayVariableSet
{ 
public:
	float                                              Stun_Large_Duration;                                        // 0x0038   (0x0004)  
	float                                              SmallHealthItem_AddHealthAmount;                            // 0x003C   (0x0004)  
	float                                              SmallHealthItem_AddStaminaAmount;                           // 0x0040   (0x0004)  
	float                                              SmallHealthItem_BleedOutRateMultiplier;                     // 0x0044   (0x0004)  
	float                                              LargeHealthItem_AddHealthAmount;                            // 0x0048   (0x0004)  
	float                                              LargeHealthItem_AddStaminaAmount;                           // 0x004C   (0x0004)  
	float                                              LargeHealthItem_BleedOutRateMultiplier;                     // 0x0050   (0x0004)  
	float                                              Sissy_Poison_Duration;                                      // 0x0054   (0x0004)  
	float                                              Sissy_Poison_AddHealthPerTick;                              // 0x0058   (0x0004)  
	float                                              SmallHealthItem_HoTDuration;                                // 0x005C   (0x0004)  
	float                                              LargeHealthItem_HoTDuration;                                // 0x0060   (0x0004)  
	float                                              SmallHealthItem_HoTAmount;                                  // 0x0064   (0x0004)  
	float                                              LargeHealthItem_HoTAmount;                                  // 0x0068   (0x0004)  
	float                                              Grandpa_GlobalNoiseMultiplyer;                              // 0x006C   (0x0004)  
	float                                              Stun_Large_SpeedMultiplier;                                 // 0x0070   (0x0004)  
	float                                              Stun_Large_AbilityDuration;                                 // 0x0074   (0x0004)  
	float                                              Stun_Medium_Duration;                                       // 0x0078   (0x0004)  
	float                                              Stun_Medium_SpeedMultiplier;                                // 0x007C   (0x0004)  
	float                                              Stun_Small_Duration;                                        // 0x0080   (0x0004)  
	float                                              Stun_Small_SpeedMultiplier;                                 // 0x0084   (0x0004)  
	float                                              StaminaRecharge_Delay;                                      // 0x0088   (0x0004)  
	float                                              Sissy_Poison_CloudSize;                                     // 0x008C   (0x0004)  
	float                                              StaminaRegen_Rate;                                          // 0x0090   (0x0004)  
	float                                              BloodVial_Size;                                             // 0x0094   (0x0004)  
	float                                              BloodCollected_MeleeHit;                                    // 0x0098   (0x0004)  
	float                                              BloodCollected_CloseEncounter;                              // 0x009C   (0x0004)  
	float                                              BloodCollected_ExecutionMultiplier;                         // 0x00A0   (0x0004)  
	float                                              Johnny_TrackingAbility_Depletion;                           // 0x00A4   (0x0004)  
	float                                              Johnny_ConcussionHit_Duration;                              // 0x00A8   (0x0004)  
	float                                              Leatherface_ChainsawRevHeatPerSecond;                       // 0x00AC   (0x0004)  
	float                                              Leatherface_ChainsawHeatLossPerSecond;                      // 0x00B0   (0x0004)  
	float                                              Leatherface_ChainsawIdleHeatGainPerSecond;                  // 0x00B4   (0x0004)  
	float                                              Leatherface_ChainsawHeatAttackMultiplier;                   // 0x00B8   (0x0004)  
	float                                              Leatherface_ChainsawHotThreshold;                           // 0x00BC   (0x0004)  
	float                                              Leatherface_ChainsawPreHotThreshold;                        // 0x00C0   (0x0004)  
	float                                              Leatherface_ChainsawStallThreshold;                         // 0x00C4   (0x0004)  
	float                                              BaseVictim_IncapacitationTimer;                             // 0x00C8   (0x0004)  
	float                                              Sissy_Poison_CloudLifeSpan;                                 // 0x00CC   (0x0004)  
	float                                              Combat_Leatherface_Attack_Damage;                           // 0x00D0   (0x0004)  
	float                                              Combat_Leatherface_Attack_StaminaCost;                      // 0x00D4   (0x0004)  
	float                                              Combat_Leatherface_Attack_Slam_Damage;                      // 0x00D8   (0x0004)  
	float                                              Combat_Leatherface_Attack_Barge_Damage;                     // 0x00DC   (0x0004)  
	float                                              Combat_Leatherface_Attack_Barge_StaminaCost;                // 0x00E0   (0x0004)  
	float                                              Combat_Leatherface_Attack_Thrust_Damage;                    // 0x00E4   (0x0004)  
	float                                              Combat_Leatherface_DestroyDoorInterruptDamage;              // 0x00E8   (0x0004)  
	float                                              Combat_Cook_Attack_Damage;                                  // 0x00EC   (0x0004)  
	float                                              Combat_Cook_Attack_Tired_Damage;                            // 0x00F0   (0x0004)  
	float                                              Combat_Cook_Attack_StaminaCost;                             // 0x00F4   (0x0004)  
	float                                              Combat_Hitchhiker_Attack_Damage;                            // 0x00F8   (0x0004)  
	float                                              Combat_Hitchhiker_Attack_Tired_Damage;                      // 0x00FC   (0x0004)  
	float                                              Combat_Hitchhiker_Attack_StaminaCost;                       // 0x0100   (0x0004)  
	float                                              Combat_Johnny_Attack_Damage;                                // 0x0104   (0x0004)  
	float                                              Combat_Johnny_Attack_Tired_Damage;                          // 0x0108   (0x0004)  
	float                                              Combat_Johnny_Attack_StaminaCost;                           // 0x010C   (0x0004)  
	float                                              Combat_Sissy_Attack_Damage;                                 // 0x0110   (0x0004)  
	float                                              Combat_Sissy_Attack_Tired_Damage;                           // 0x0114   (0x0004)  
	float                                              Combat_Sissy_Attack_StaminaCost;                            // 0x0118   (0x0004)  
	float                                              BaseVictim_SprintStaminaCost;                               // 0x011C   (0x0004)  
	float                                              BaseFamily_SprintStaminaCost;                               // 0x0120   (0x0004)  
	float                                              BaseVictim_HealthChunkAmount;                               // 0x0124   (0x0004)  
	float                                              BaseVictim_HealthValuePerChunk;                             // 0x0128   (0x0004)  
	float                                              BaseVictim_ProximityWarningRadius;                          // 0x012C   (0x0004)  
	float                                              BaseVictim_MaxStaminaAmount;                                // 0x0130   (0x0004)  
	float                                              BaseFamily_MaxStaminaAmount;                                // 0x0134   (0x0004)  
	float                                              BaseVictim_InitialStaminaAmount;                            // 0x0138   (0x0004)  
	float                                              BaseFamily_InitialStaminaAmount;                            // 0x013C   (0x0004)  
	float                                              BaseFamily_HealthChunkAmount;                               // 0x0140   (0x0004)  
	float                                              BaseFamily_HealthValuePerChunk;                             // 0x0144   (0x0004)  
	float                                              Cook_FocusDurationMin;                                      // 0x0148   (0x0004)  
	float                                              Cook_FocusDurationMax;                                      // 0x014C   (0x0004)  
	float                                              Cook_ConsumptionRate;                                       // 0x0150   (0x0004)  
	float                                              Cook_FocusSilhouetteDuration;                               // 0x0154   (0x0004)  
	float                                              Cook_SensesDetectionRadius;                                 // 0x0158   (0x0004)  
	float                                              Cook_TargetingThreshold;                                    // 0x015C   (0x0004)  
	float                                              Cook_TargetingThresholdFocusing;                            // 0x0160   (0x0004)  
	float                                              Grandpa_IncapacitateDuration;                               // 0x0164   (0x0004)  
	float                                              Sissy_Poison_BleedDamageUpgradeDuration;                    // 0x0168   (0x0004)  
	float                                              Johnny_TrackingAbility_RechargeRate;                        // 0x016C   (0x0004)  
	float                                              Johnny_TrackingAbility_ClueDetectionRadius;                 // 0x0170   (0x0004)  
	float                                              Johnny_TrackingAbility_ViewFootprintRange;                  // 0x0174   (0x0004)  
	float                                              Johnny_TrackingAbility_ClueAnalyzeDuration;                 // 0x0178   (0x0004)  
	float                                              Hitchhiker_Trap_CaughtInTrapDamage;                         // 0x017C   (0x0004)  
	float                                              Hitchhiker_Trap_BleedDamageUpgradeDuration;                 // 0x0180   (0x0004)  
	float                                              Cook_ListenRechargeRate;                                    // 0x0184   (0x0004)  
	float                                              Combat_Victim_CE_StaminaRegained;                           // 0x0188   (0x0004)  
	float                                              Leatherface_ChainsawOverheatDuration;                       // 0x018C   (0x0004)  
	float                                              Leatherface_ChainsawStallDuration;                          // 0x0190   (0x0004)  
	float                                              Hitchhiker_Trap_BleedDamageUpgradeDamagePerSec;             // 0x0194   (0x0004)  
	float                                              Sissy_Poison_BleedDamageUpgradeDamagePerSec;                // 0x0198   (0x0004)  
	float                                              BaseVictim_StaminaChunks_TotalStaminaChunks;                // 0x019C   (0x0004)  
	float                                              BaseVictim_StaminaChunks_StartingStaminaChunks;             // 0x01A0   (0x0004)  
	float                                              BaseVictim_StaminaChunks_StaminaPerChunk;                   // 0x01A4   (0x0004)  
	float                                              BaseVictim_StaminaChunks_StaminaChainingRange_Min;          // 0x01A8   (0x0004)  
	float                                              BaseVictim_StaminaChunks_StaminaChainingRange_Max;          // 0x01AC   (0x0004)  
	float                                              BloodCollected_BucketMultiplier;                            // 0x01B0   (0x0004)  
	float                                              BaseFamily_StaminaChunks_TotalStaminaChunks;                // 0x01B4   (0x0004)  
	float                                              BaseFamily_StaminaChunks_StartingStaminaChunks;             // 0x01B8   (0x0004)  
	float                                              BaseFamily_StaminaChunks_StaminaPerChunk;                   // 0x01BC   (0x0004)  
	float                                              BaseFamily_StaminaChunks_StaminaChainingRange_Max;          // 0x01C0   (0x0004)  
	float                                              BaseFamily_StaminaChunks_StaminaChainingRange_Min;          // 0x01C4   (0x0004)  
	float                                              BloodCollected_LeatherfaceBarge;                            // 0x01C8   (0x0004)  
	float                                              Combat_Victim_SlowAnimDamageReductionMultiplier;            // 0x01CC   (0x0004)  
	float                                              Grandpa_GlobalNoiseMultiplyer_SlidingDoor;                  // 0x01D0   (0x0004)  
	float                                              Nancy_Barb_Damage;                                          // 0x01D4   (0x0004)  
	float                                              ChickenNoiseMaker_RadiusMultiplier;                         // 0x01D8   (0x0004)  
	float                                              SpyAbility_Depletion;                                       // 0x01DC   (0x0004)  
	float                                              SpyAbility_RechargeRate;                                    // 0x01E0   (0x0004)  
	float                                              SpyAbility_CooldownTime;                                    // 0x01E4   (0x0004)  
	float                                              Nancy_Barb_MaxDistance;                                     // 0x01E8   (0x0004)  
	float                                              Nancy_Barb_MovementOutlineDuration;                         // 0x01EC   (0x0004)  
	float                                              Nancy_Barb_InitailOutlineDuration;                          // 0x01F0   (0x0004)  
	float                                              Leatherface_SprintStaminaCost;                              // 0x01F4   (0x0004)  
	float                                              Leatherface_MaxStaminaAmount;                               // 0x01F8   (0x0004)  
	float                                              Leatherface_InitialStaminaAmount;                           // 0x01FC   (0x0004)  
	float                                              Johnny_TrackingAbility_ProximityRange;                      // 0x0200   (0x0004)  
	float                                              Nancy_Barb_TrappedDamage;                                   // 0x0204   (0x0004)  
	float                                              Sissy_PoisonHit_Duration;                                   // 0x0208   (0x0004)  
	float                                              DannyStudyHoldTime;                                         // 0x020C   (0x0004)  
	float                                              DannyStudy_KnowledgeGatheredMultiplier;                     // 0x0210   (0x0004)  
	float                                              DannyStudyHoldShortTime;                                    // 0x0214   (0x0004)  
	float                                              BaseVictim_StaminaCost_Dash;                                // 0x0218   (0x0004)  
	float                                              Hitchhiker_Trap_AbilityCollectBlood;                        // 0x021C   (0x0004)  
	float                                              SneakAttackStunDuration;                                    // 0x0220   (0x0004)  
	float                                              CattleGridStunDuration;                                     // 0x0224   (0x0004)  
	float                                              DoorStaggerStunDuration;                                    // 0x0228   (0x0004)  
	float                                              Hunt_HighlightDuration;                                     // 0x022C   (0x0004)  
	float                                              Hunt_Cooldown;                                              // 0x0230   (0x0004)  
	float                                              Combat_Nancy_Attack_Damage;                                 // 0x0234   (0x0004)  
	float                                              Combat_Nancy_Attack_Tired_Damage;                           // 0x0238   (0x0004)  
	float                                              Combat_Nancy_Attack_StaminaCost;                            // 0x023C   (0x0004)  
	float                                              Hunt_RechargeDelay;                                         // 0x0240   (0x0004)  
	float                                              ChickenNoiseMaker_RadiusMultiplier_Far;                     // 0x0244   (0x0004)  
	float                                              LVS_Grandpa_LVL5_ProximityDuration;                         // 0x0248   (0x0004)  
	float                                              Sissy_Poison_Duration_Mult;                                 // 0x024C   (0x0004)  
	float                                              TrappedLampStunDuration;                                    // 0x0250   (0x0004)  
	float                                              Combat_DamageMultiplier_Melee;                              // 0x0254   (0x0004)  
	float                                              FocusAbility_PointsPerTap;                                  // 0x0258   (0x0004)  
	float                                              FocusAbility_MaxPoints;                                     // 0x025C   (0x0004)  
	float                                              Noisemaker_NoiseRetriggerTimer;                             // 0x0260   (0x0004)  
	float                                              Noisemaker_Duration;                                        // 0x0264   (0x0004)  
	float                                              SneakAttackStunImmunity_AfterLightStun_Length;              // 0x0268   (0x0004)  
	float                                              LifeSaverStunImmunity_AfterLightStun_Length;                // 0x026C   (0x0004)  
	float                                              TotalStunImmunity_AfterDoorStun_Length;                     // 0x0270   (0x0004)  
	float                                              TotalStunImmunity_AfterSneakAttack_Length;                  // 0x0274   (0x0004)  
	float                                              TotalStunImmunity_AfterLifeSaverBargeLength;                // 0x0278   (0x0004)  
	float                                              TotalStunImmunity_AfterCloseEncounter;                      // 0x027C   (0x0004)  
	float                                              Incap_HealthBack;                                           // 0x0280   (0x0004)  
};

/// Class /Game/BBQGame/Data/VariableSets/BP_VarSet_Traversals.BP_VarSet_Traversals_C
/// Size: 0x0084 (132 bytes) (0x000038 - 0x000084) align 8 MaxSize: 0x0084
class UBP_VarSet_Traversals_C : public UGameplayVariableSet
{ 
public:
	float                                              WindowJump_PlayerFallDamage;                                // 0x0038   (0x0004)  
	float                                              Bolthole_SpeedBuffDuration;                                 // 0x003C   (0x0004)  
	float                                              Bolthole_SpeedBuffMultiplier;                               // 0x0040   (0x0004)  
	float                                              WindowJump_PlayerFallDamage_1stFloorWindow;                 // 0x0044   (0x0004)  
	float                                              WindowJump_WindowBreakDamage;                               // 0x0048   (0x0004)  
	float                                              WellClimb_Damage;                                           // 0x004C   (0x0004)  
	float                                              WellJump_Damage;                                            // 0x0050   (0x0004)  
	float                                              HidingObject_BurstOutStunRange;                             // 0x0054   (0x0004)  
	float                                              HidingObject_DiscoveredDamage;                              // 0x0058   (0x0004)  
	float                                              Sidle_AnimSpeedMultiplier;                                  // 0x005C   (0x0004)  
	float                                              Bolthole_AnimSpeedMultiplier;                               // 0x0060   (0x0004)  
	float                                              WellRecoveryPlayRate;                                       // 0x0064   (0x0004)  
	float                                              WindowJump_RecoverAnimRate;                                 // 0x0068   (0x0004)  
	float                                              Ladder_GrabDamageMultiplier;                                // 0x006C   (0x0004)  
	float                                              PipeExit_Highlight;                                         // 0x0070   (0x0004)  
	float                                              FuseDoor_Highlight;                                         // 0x0074   (0x0004)  
	float                                              HidingObject_GrabbedDamage;                                 // 0x0078   (0x0004)  
	float                                              FuseDoor_TamperedHighlight;                                 // 0x007C   (0x0004)  
	float                                              PipeExit_TamperedHighlight;                                 // 0x0080   (0x0004)  
};

/// Class /Game/BBQGame/Data/VariableSets/BP_VarSet_Perks.BP_VarSet_Perks_C
/// Size: 0x02BC (700 bytes) (0x000038 - 0x0002BC) align 8 MaxSize: 0x02BC
class UBP_VarSet_Perks_C : public UGameplayVariableSet
{ 
public:
	float                                              SappingCut_MaxStaminaDuration;                              // 0x0038   (0x0004)  
	float                                              SappingCut_MaxStaminaMultiplier;                            // 0x003C   (0x0004)  
	float                                              ToolMaster_KeepToolChance;                                  // 0x0040   (0x0004)  
	float                                              FuseInsightHightlightDuration;                              // 0x0044   (0x0004)  
	float                                              JumpScare_SpeedDuration;                                    // 0x0048   (0x0004)  
	float                                              MarathonSprinter_SprintDrainMultiplier;                     // 0x004C   (0x0004)  
	float                                              MarathonSprinter_SprintSpeedMultiplier;                     // 0x0050   (0x0004)  
	float                                              LuckyLockpicker_KeepToolChance;                             // 0x0054   (0x0004)  
	float                                              SpotAndRun_BuffDuration;                                    // 0x0058   (0x0004)  
	float                                              DinnersReady_MaxStaminaAdd;                                 // 0x005C   (0x0004)  
	float                                              ShardMaster_KeepToolChance;                                 // 0x0060   (0x0004)  
	float                                              Scouter_SpeedMultiplier;                                    // 0x0064   (0x0004)  
	float                                              Scouter_DamageMultiplier;                                   // 0x0068   (0x0004)  
	float                                              Hobble_DebuffDuration;                                      // 0x006C   (0x0004)  
	float                                              Hobble_StaminaRegenMultiplier;                              // 0x0070   (0x0004)  
	int32_t                                            Overlooked_AvoidDetectionCharges;                           // 0x0074   (0x0004)  
	float                                              IronWill_AddHealthMultiplier;                               // 0x0078   (0x0004)  
	float                                              HystericalStrength_StaminaCheckValue;                       // 0x007C   (0x0004)  
	float                                              HystericalStrength_MeleeDamageMultiplier;                   // 0x0080   (0x0004)  
	float                                              RenewedVigor_AddChargeMultiplier;                           // 0x0084   (0x0004)  
	float                                              DeadWeight_SpeedMultiplier;                                 // 0x0088   (0x0004)  
	float                                              BetterTogetherHighlightDuration;                            // 0x008C   (0x0004)  
	float                                              PickOnMeHighlightDuration;                                  // 0x0090   (0x0004)  
	float                                              OneForAll_HighlightDuration;                                // 0x0094   (0x0004)  
	float                                              BadBlood_DebuffDuration;                                    // 0x0098   (0x0004)  
	float                                              BadBlood_MeleeDamageMultiplier;                             // 0x009C   (0x0004)  
	float                                              UnScrewed_ToolboxMaxDistance;                               // 0x00A0   (0x0004)  
	float                                              UnScrewed_ToolboxHighlightDuration;                         // 0x00A4   (0x0004)  
	float                                              HurtPride_Time;                                             // 0x00A8   (0x0004)  
	float                                              HurtPride_StaminaRegen;                                     // 0x00AC   (0x0004)  
	float                                              Rage_ChargeFillPercent_Cook;                                // 0x00B0   (0x0004)  
	float                                              Rage_ChargeFillPercent_Johnny;                              // 0x00B4   (0x0004)  
	float                                              HuntersEye_RadiusMultiplier;                                // 0x00B8   (0x0004)  
	float                                              ApothecarysEye_RadiusMultiplier;                            // 0x00BC   (0x0004)  
	float                                              DrugDetector_RadiusMultiplier;                              // 0x00C0   (0x0004)  
	float                                              CoverMe_HighlightDuration;                                  // 0x00C4   (0x0004)  
	float                                              RunForYourLife_Duration;                                    // 0x00C8   (0x0004)  
	float                                              RunForYourLife_StaminaAdded;                                // 0x00CC   (0x0004)  
	float                                              SecondWind_Duration;                                        // 0x00D0   (0x0004)  
	float                                              SecondWind_RecoverHealthMultiplier;                         // 0x00D4   (0x0004)  
	float                                              Unscrewed_ZThreshold;                                       // 0x00D8   (0x0004)  
	float                                              GetBackUpAgain_StunMultiplier;                              // 0x00DC   (0x0004)  
	float                                              SpotterHighlightRadiusMultiplier;                           // 0x00E0   (0x0004)  
	float                                              CoverBurst_TimeStayHiddenForPerk;                           // 0x00E4   (0x0004)  
	float                                              CoverBurst_EffectDuration;                                  // 0x00E8   (0x0004)  
	float                                              CoverBurst_SprintStaminaConsumptionMultiplier;              // 0x00EC   (0x0004)  
	float                                              AwkwardPatientMultiplier;                                   // 0x00F0   (0x0004)  
	float                                              SissysBlend_StaminaRegenMultiplier;                         // 0x00F4   (0x0004)  
	float                                              SissysBlend_BuffDuration;                                   // 0x00F8   (0x0004)  
	float                                              BloodlustGallows_MeleeMultiplier;                           // 0x00FC   (0x0004)  
	float                                              Intuition_HighlightDuration;                                // 0x0100   (0x0004)  
	float                                              SporeLoser_Cooldown;                                        // 0x0104   (0x0004)  
	float                                              Vialent_DamageMultiplier;                                   // 0x0108   (0x0004)  
	float                                              HitAndRun_BuffDuration;                                     // 0x010C   (0x0004)  
	float                                              HitAndRun_SpeedMultiplier;                                  // 0x0110   (0x0004)  
	float                                              PlagueCloud_SpeedMultiplier;                                // 0x0114   (0x0004)  
	float                                              KnockedIntoActionStamina;                                   // 0x0118   (0x0004)  
	float                                              KnockedIntoActionHealth;                                    // 0x011C   (0x0004)  
	float                                              ConfusingMechanicCooldownDuration;                          // 0x0120   (0x0004)  
	int32_t                                            WhatDoorCharges;                                            // 0x0124   (0x0004)  
	int32_t                                            NoSellCharges;                                              // 0x0128   (0x0004)  
	float                                              BloodyAttacker_BloodMultiplier;                             // 0x012C   (0x0004)  
	float                                              SafetyInNumbers_MaxHealthMultiplier;                        // 0x0130   (0x0004)  
	float                                              SafetyInNumbers_MaxStaminaMultiplier;                       // 0x0134   (0x0004)  
	int32_t                                            SleightOfHandCharges;                                       // 0x0138   (0x0004)  
	float                                              RescueMedic_HealPlayRate;                                   // 0x013C   (0x0004)  
	float                                              HerbalistChanceValue;                                       // 0x0140   (0x0004)  
	float                                              ElectricInsightHightlightDuration;                          // 0x0144   (0x0004)  
	float                                              HelpMePercentage;                                           // 0x0148   (0x0004)  
	float                                              TagYoureItDuration;                                         // 0x014C   (0x0004)  
	float                                              DownTheRabbitHoleDuration;                                  // 0x0150   (0x0004)  
	float                                              ExtraBiteDuration;                                          // 0x0154   (0x0004)  
	float                                              StrongGripDamage;                                           // 0x0158   (0x0004)  
	int32_t                                            KillerFeedbackCharges;                                      // 0x015C   (0x0004)  
	float                                              SerratedDuration;                                           // 0x0160   (0x0004)  
	float                                              WellBalanced_DamageMultiplier;                              // 0x0164   (0x0004)  
	float                                              WellBalanced_Duration;                                      // 0x0168   (0x0004)  
	float                                              SanguineShadow_HealthPercentage;                            // 0x016C   (0x0004)  
	float                                              ExtraSharpChainsaw_Duration;                                // 0x0170   (0x0004)  
	float                                              ExtraSharpChainsaw_HpOverSecond;                            // 0x0174   (0x0004)  
	float                                              Despair_Duration;                                           // 0x0178   (0x0004)  
	float                                              Despair_StaminaReduction;                                   // 0x017C   (0x0004)  
	float                                              GoodHeart_StaminaMultiplier;                                // 0x0180   (0x0004)  
	float                                              Conditioned_StaminaMultiplier;                              // 0x0184   (0x0004)  
	float                                              Payback_AddHealthValue;                                     // 0x0188   (0x0004)  
	float                                              Payback_AddStaminaMultiplier;                               // 0x018C   (0x0004)  
	float                                              TwinkleToes_ChanceWeight;                                   // 0x0190   (0x0004)  
	float                                              YoullPayForThat_DamageMultiplier;                           // 0x0194   (0x0004)  
	float                                              MyChicken_RadiusMultiplier;                                 // 0x0198   (0x0004)  
	float                                              KnowYouAreWatching_Range;                                   // 0x019C   (0x0004)  
	float                                              LastButNotLeast_HighlightDuration;                          // 0x01A0   (0x0004)  
	int32_t                                            AdrenalineRush_Charges;                                     // 0x01A4   (0x0004)  
	float                                              WellTrained_HighlightDuration;                              // 0x01A8   (0x0004)  
	float                                              FurnitureFu_Duration;                                       // 0x01AC   (0x0004)  
	float                                              FurnitureFu_SpeedMultiplier;                                // 0x01B0   (0x0004)  
	int32_t                                            SticksAndStones_Charges;                                    // 0x01B4   (0x0004)  
	float                                              SanguineShadow_HealthAdded;                                 // 0x01B8   (0x0004)  
	float                                              SticksAndStones_HealthPercentage;                           // 0x01BC   (0x0004)  
	float                                              DrugDetector_HealthThreshold;                               // 0x01C0   (0x0004)  
	float                                              SpotAndRun_StaminaMultiplier;                               // 0x01C4   (0x0004)  
	float                                              Quarterback_Cooldown;                                       // 0x01C8   (0x0004)  
	float                                              LastVictimStanding_StaminaRegenRate;                        // 0x01CC   (0x0004)  
	float                                              Last_VictimStanding_StaminaConsumption;                     // 0x01D0   (0x0004)  
	float                                              Last_VictimStanding_Highlight_Duration;                     // 0x01D4   (0x0004)  
	float                                              PinsAndNeedlesNoInventoryConsumeChance;                     // 0x01D8   (0x0004)  
	float                                              KillThemAllDamagePercent;                                   // 0x01DC   (0x0004)  
	float                                              KillThemAllDuration;                                        // 0x01E0   (0x0004)  
	float                                              PoisonedClawsDuration;                                      // 0x01E4   (0x0004)  
	float                                              Headstart_HighlightDuration;                                // 0x01E8   (0x0004)  
	float                                              StrongMinded_StaminaMultiplier;                             // 0x01EC   (0x0004)  
	float                                              StrongMinded_Duration;                                      // 0x01F0   (0x0004)  
	float                                              GiveMeMore_StaminaRegenMultiplier;                          // 0x01F4   (0x0004)  
	float                                              WaitAMinute_Duration;                                       // 0x01F8   (0x0004)  
	float                                              HeySissy_BlurryVisionDuration;                              // 0x01FC   (0x0004)  
	float                                              NoStopping_StaminaDepletionReduction;                       // 0x0200   (0x0004)  
	float                                              HushOrDie_HealthThresholdPercent;                           // 0x0204   (0x0004)  
	int32_t                                            HushOrDie_StealthAttributeLevelOffset;                      // 0x0208   (0x0004)  
	float                                              NoShock_HighlightDuration;                                  // 0x020C   (0x0004)  
	int32_t                                            WaxOnWaxOff_StrengthLevelOffset;                            // 0x0210   (0x0004)  
	int32_t                                            SeeingThings_PerceptionLevelOffset;                         // 0x0214   (0x0004)  
	int32_t                                            ICanDoThis_ProficiencyLevelOffset;                          // 0x0218   (0x0004)  
	int32_t                                            ICanMakeIt_EnduranceLevelOffset;                            // 0x021C   (0x0004)  
	float                                              IKnowEngines_SenseDuration;                                 // 0x0220   (0x0004)  
	float                                              IKnowEngines_SenseRadius;                                   // 0x0224   (0x0004)  
	float                                              ThereTheyAre_ProximityRadius;                               // 0x0228   (0x0004)  
	float                                              ThereTheyAre_HighlightWaitTime;                             // 0x022C   (0x0004)  
	int32_t                                            SeeingThings_ToughnessLevelOffset;                          // 0x0230   (0x0004)  
	float                                              OutOfMyHead_SpyAbilityDepletionRateOffsetMultiplier;        // 0x0234   (0x0004)  
	float                                              DingDong_SFXValue;                                          // 0x0238   (0x0004)  
	float                                              AdrenalineRushStaminaPct;                                   // 0x023C   (0x0004)  
	float                                              BadBlood_HighlightDuration;                                 // 0x0240   (0x0004)  
	int32_t                                            Immunity_Charges;                                           // 0x0244   (0x0004)  
	float                                              ImComingOut_DamageReceiveMultiplier;                        // 0x0248   (0x0004)  
	float                                              ImComingOut_Duration;                                       // 0x024C   (0x0004)  
	float                                              BloodRun_BllodInVialCheck;                                  // 0x0250   (0x0004)  
	float                                              BloodyEncounter_BloodGrantedLose;                           // 0x0254   (0x0004)  
	int32_t                                            GrantedPoisonedHits;                                        // 0x0258   (0x0004)  
	float                                              BloodTies_Duration;                                         // 0x025C   (0x0004)  
	float                                              HitAndRun_StaminaReductionMultiplier;                       // 0x0260   (0x0004)  
	float                                              DoorSplinters_VictimDamage;                                 // 0x0264   (0x0004)  
	float                                              KnockKnock_HighlightDuration;                               // 0x0268   (0x0004)  
	float                                              KillerFeedbackDuration;                                     // 0x026C   (0x0004)  
	float                                              DinnersReady_Duration;                                      // 0x0270   (0x0004)  
	float                                              BackstabMasterUIDuration;                                   // 0x0274   (0x0004)  
	float                                              OutOfMyHead_Sissy_PoisonDurationReduction;                  // 0x0278   (0x0004)  
	float                                              ArtfulDodger_Radius;                                        // 0x027C   (0x0004)  
	float                                              WhiteMeat_HealthMultiplier;                                 // 0x0280   (0x0004)  
	float                                              CrimsonCocktail_HealthMultiplier;                           // 0x0284   (0x0004)  
	int32_t                                            CrimsonCocktail_Charges;                                    // 0x0288   (0x0004)  
	float                                              PepTalk_HealthMultiplier;                                   // 0x028C   (0x0004)  
	float                                              WellMarker_Distance;                                        // 0x0290   (0x0004)  
	float                                              WellMarker_HighlightDuration;                               // 0x0294   (0x0004)  
	float                                              TalkAndRun_Duration;                                        // 0x0298   (0x0004)  
	float                                              TalkAndRun_StaminaMultiplier;                               // 0x029C   (0x0004)  
	float                                              BloodclotCry_HealthAdded;                                   // 0x02A0   (0x0004)  
	int32_t                                            BloodclotCry_Charges;                                       // 0x02A4   (0x0004)  
	float                                              BloodclotCry_HealthPercentNeededToApply;                    // 0x02A8   (0x0004)  
	float                                              BackForBlood_HealthMultiplier;                              // 0x02AC   (0x0004)  
	float                                              FinalGirl_StaminaIncrease;                                  // 0x02B0   (0x0004)  
	int32_t                                            NoShardDisarmTrapCharges;                                   // 0x02B4   (0x0004)  
	float                                              ChooseFightStunExtra;                                       // 0x02B8   (0x0004)  
};

/// Class /Game/BBQGame/Gameplay/Interactables/Types/BP_InteractionType_Default.BP_InteractionType_Default_C
/// Size: 0x01A8 (424 bytes) (0x0001A8 - 0x0001A8) align 8 MaxSize: 0x01A8
class UBP_InteractionType_Default_C : public UBBQInteractionType
{ 
public:
};

/// Class /Game/BBQGame/UI/RichText/BP_RichTextDecorator_PlatformIcons.BP_RichTextDecorator_PlatformIcons_C
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UBP_RichTextDecorator_PlatformIcons_C : public URichTextBlockImageDecorator
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_MenuInputIcon.WBP_MenuInputIcon_C
/// Size: 0x0348 (840 bytes) (0x000348 - 0x000348) align 8 MaxSize: 0x0348
class UWBP_MenuInputIcon_C : public UBBQUI_MenuInputIcon
{ 
public:
};

/// Class /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_Pop_Up_BG_Overlay.WBP_Pop_Up_BG_Overlay_C
/// Size: 0x0270 (624 bytes) (0x000260 - 0x000270) align 8 MaxSize: 0x0270
class UWBP_Pop_Up_BG_Overlay_C : public UUserWidget
{ 
public:
	class UImage*                                      dust01;                                                     // 0x0260   (0x0008)  
	class UImage*                                      white;                                                      // 0x0268   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C
/// Size: 0x0470 (1136 bytes) (0x000430 - 0x000470) align 8 MaxSize: 0x0470
class UWBP_MenuInputPrompt_C : public UBBQUI_MenuInputPrompt
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0430   (0x0008)  
	class UBBQUI_Image*                                Cross;                                                      // 0x0438   (0x0008)  
	class UBBQUI_Image*                                Highlight;                                                  // 0x0440   (0x0008)  
	class UBBQUI_Image*                                HighlightImage;                                             // 0x0448   (0x0008)  
	FDataTableRowHandle                                HighlightColor;                                             // 0x0450   (0x0010)  
	FDataTableRowHandle                                DefaultTextColor;                                           // 0x0460   (0x0010)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.BP_OnHovered
	void BP_OnHovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.BP_OnUnhovered
	void BP_OnUnhovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.BP_SetupVisuals
	void BP_SetupVisuals() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.BP_OnSelected
	void BP_OnSelected() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.BP_OnDeselected
	void BP_OnDeselected() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuInputPrompt.WBP_MenuInputPrompt_C.ExecuteUbergraph_WBP_MenuInputPrompt
	void ExecuteUbergraph_WBP_MenuInputPrompt(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_AspectRatioLock.WBP_AspectRatioLock_C
/// Size: 0x0268 (616 bytes) (0x000260 - 0x000268) align 8 MaxSize: 0x0268
class UWBP_AspectRatioLock_C : public UUserWidget
{ 
public:
	class UNamedSlot*                                  AspectRatioLockSlot;                                        // 0x0260   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuSmall.WBP_PopUp_MenuSmall_C
/// Size: 0x0568 (1384 bytes) (0x000568 - 0x000568) align 8 MaxSize: 0x0568
class UWBP_PopUp_MenuSmall_C : public UBBQUI_RichTextPopUpWidget
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C
/// Size: 0x0619 (1561 bytes) (0x000560 - 0x000619) align 8 MaxSize: 0x0619
class UWBP_PopUp_Generic_C : public UBBQUI_PopUpWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	class UButton*                                     Button_Cancel;                                              // 0x0568   (0x0008)  
	class UButton*                                     Button_Confirm;                                             // 0x0570   (0x0008)  
	class UButton*                                     Button_No;                                                  // 0x0578   (0x0008)  
	class UButton*                                     Button_Yes;                                                 // 0x0580   (0x0008)  
	class UCanvasPanel*                                ButtonPanel_Cancel;                                         // 0x0588   (0x0008)  
	class UCanvasPanel*                                ButtonPanel_Confirm;                                        // 0x0590   (0x0008)  
	class UCanvasPanel*                                ButtonPanel_No;                                             // 0x0598   (0x0008)  
	class UCanvasPanel*                                ButtonPanel_Yes;                                            // 0x05A0   (0x0008)  
	class UGridPanel*                                  GridPanel;                                                  // 0x05A8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05B0   (0x0008)  
	FKey                                               InputKey_Confirm;                                           // 0x05B8   (0x0018)  
	FKey                                               InputKey_Cancel;                                            // 0x05D0   (0x0018)  
	FKey                                               InputKey_Yes;                                               // 0x05E8   (0x0018)  
	FKey                                               InputKey_No;                                                // 0x0600   (0x0018)  
	bool                                               WasMouseCursorEnabled;                                      // 0x0618   (0x0001)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.InitializeButtons
	void InitializeButtons() // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.DisplayInputKeyName
	FText DisplayInputKeyName() // [0x2438a30] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef FText (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		return func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.OnPopUpInitialized
	void OnPopUpInitialized() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.BndEvt__Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_Yes_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.BndEvt__Button_No_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_No_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature() // [0x2438a30] BlueprintEvent       
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.OnShowPopUp
	void OnShowPopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.OnHidePopUp
	void OnHidePopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Generic.WBP_PopUp_Generic_C.ExecuteUbergraph_WBP_PopUp_Generic
	void ExecuteUbergraph_WBP_PopUp_Generic(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_AbilityTreeAcquire.WBP_Popup_AbilityTreeAcquire_C
/// Size: 0x05D8 (1496 bytes) (0x0005A0 - 0x0005D8) align 8 MaxSize: 0x05D8
class UWBP_Popup_AbilityTreeAcquire_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                InfoBGImage;                                                // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05C0   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C8   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05D0   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_AbilityTreeCannotAcquire.WBP_Popup_AbilityTreeCannotAcquire_C
/// Size: 0x05D0 (1488 bytes) (0x0005A0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_Popup_AbilityTreeCannotAcquire_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05B8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05C8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_Confirm_SaveLoadout.WBP_Popup_Confirm_SaveLoadout_C
/// Size: 0x05D0 (1488 bytes) (0x0005A0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_Popup_Confirm_SaveLoadout_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05B8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05C8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_Confirm_SetDefaultLoadout.WBP_Popup_Confirm_SetDefaultLoadout_C
/// Size: 0x05D0 (1488 bytes) (0x0005A0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_Popup_Confirm_SetDefaultLoadout_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05B8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05C8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuMedium.WBP_PopUp_MenuMedium_C
/// Size: 0x0590 (1424 bytes) (0x000560 - 0x000590) align 8 MaxSize: 0x0590
class UWBP_PopUp_MenuMedium_C : public UBBQUI_PopUpWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x0568   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x0570   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x0578   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0580   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x0588   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuMedium.WBP_PopUp_MenuMedium_C.Construct
	void Construct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuMedium.WBP_PopUp_MenuMedium_C.ExecuteUbergraph_WBP_PopUp_MenuMedium
	void ExecuteUbergraph_WBP_PopUp_MenuMedium(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_UnlockTreePurchase.WBP_Popup_UnlockTreePurchase_C
/// Size: 0x05F0 (1520 bytes) (0x0005A0 - 0x0005F0) align 8 MaxSize: 0x05F0
class UWBP_Popup_UnlockTreePurchase_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image0;                                               // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image1;                                               // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image2;                                               // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05C0   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05C8   (0x0008)  
	class UBBQUI_Image*                                PopupCostBG;                                                // 0x05D0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05D8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05E0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05E8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_UnlockTreeReset.WBP_Popup_UnlockTreeReset_C
/// Size: 0x05F0 (1520 bytes) (0x0005A0 - 0x0005F0) align 8 MaxSize: 0x05F0
class UWBP_Popup_UnlockTreeReset_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image0;                                               // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image1;                                               // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image2;                                               // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05C0   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05C8   (0x0008)  
	class UBBQUI_Image*                                PopupCostBG;                                                // 0x05D0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05D8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05E0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05E8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_UnlockTreeInProgress.WBP_Popup_UnlockTreeInProgress_C
/// Size: 0x05F0 (1520 bytes) (0x0005A0 - 0x0005F0) align 8 MaxSize: 0x05F0
class UWBP_Popup_UnlockTreeInProgress_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image0;                                               // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image1;                                               // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05C0   (0x0008)  
	class UBBQUI_Image*                                PopupCostBG;                                                // 0x05C8   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05D0   (0x0008)  
	class UThrobber*                                   Throbber;                                                   // 0x05D8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05E0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05E8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_UnlockTreeError.WBP_Popup_UnlockTreeError_C
/// Size: 0x05D0 (1488 bytes) (0x0005A0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_Popup_UnlockTreeError_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05B8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05C8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_AbilityTreeReset.WBP_Popup_AbilityTreeReset_C
/// Size: 0x05D8 (1496 bytes) (0x0005A0 - 0x0005D8) align 8 MaxSize: 0x05D8
class UWBP_Popup_AbilityTreeReset_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image0;                                               // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05C0   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C8   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05D0   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_Popup_AbilityTreeInProgress.WBP_Popup_AbilityTreeInProgress_C
/// Size: 0x05E0 (1504 bytes) (0x0005A0 - 0x0005E0) align 8 MaxSize: 0x05E0
class UWBP_Popup_AbilityTreeInProgress_C : public UBBQUI_MetaGamePopupWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image0;                                               // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05B8   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05C0   (0x0008)  
	class UThrobber*                                   Throbber;                                                   // 0x05C8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05D0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05D8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_ContentStoreIcon.WBP_ContentStoreIcon_C
/// Size: 0x02E8 (744 bytes) (0x0002D8 - 0x0002E8) align 8 MaxSize: 0x02E8
class UWBP_ContentStoreIcon_C : public UBBQUI_ContentStoreIcon
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D8   (0x0008)  
	class USizeBox*                                    IconSizeBox;                                                // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/Common/WBP_ContentStoreIcon.WBP_ContentStoreIcon_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_ContentStoreIcon.WBP_ContentStoreIcon_C.ExecuteUbergraph_WBP_ContentStoreIcon
	void ExecuteUbergraph_WBP_ContentStoreIcon(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStore.WBP_PopUp_ContentStore_C
/// Size: 0x0570 (1392 bytes) (0x000560 - 0x000570) align 8 MaxSize: 0x0570
class UWBP_PopUp_ContentStore_C : public UBBQUI_PopUpWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0568   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStore.WBP_PopUp_ContentStore_C.Destruct
	void Destruct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStore.WBP_PopUp_ContentStore_C.ExecuteUbergraph_WBP_PopUp_ContentStore
	void ExecuteUbergraph_WBP_PopUp_ContentStore(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_MenuReadyInputPrompt.WBP_MenuReadyInputPrompt_C
/// Size: 0x0470 (1136 bytes) (0x000430 - 0x000470) align 8 MaxSize: 0x0470
class UWBP_MenuReadyInputPrompt_C : public UBBQUI_MenuInputPrompt
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0430   (0x0008)  
	class UBBQUI_Image*                                Cross;                                                      // 0x0438   (0x0008)  
	class UBBQUI_Image*                                Highlight;                                                  // 0x0440   (0x0008)  
	class UBBQUI_Image*                                HighlightImage;                                             // 0x0448   (0x0008)  
	FDataTableRowHandle                                HighlightColor;                                             // 0x0450   (0x0010)  
	FDataTableRowHandle                                DefaultTextColor;                                           // 0x0460   (0x0010)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuReadyInputPrompt.WBP_MenuReadyInputPrompt_C.BP_OnHovered
	void BP_OnHovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuReadyInputPrompt.WBP_MenuReadyInputPrompt_C.BP_OnUnhovered
	void BP_OnUnhovered() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuReadyInputPrompt.WBP_MenuReadyInputPrompt_C.BP_SetupVisuals
	void BP_SetupVisuals() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/Common/WBP_MenuReadyInputPrompt.WBP_MenuReadyInputPrompt_C.ExecuteUbergraph_WBP_MenuReadyInputPrompt
	void ExecuteUbergraph_WBP_MenuReadyInputPrompt(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_LobbyInvite.WBP_PopUp_LobbyInvite_C
/// Size: 0x05F0 (1520 bytes) (0x0005E8 - 0x0005F0) align 8 MaxSize: 0x05F0
class UWBP_PopUp_LobbyInvite_C : public UBBQUI_LobbyInvitePopUp
{ 
public:
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05E8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/FriendModuleV1/WBP_CodeInviteButton.WBP_CodeInviteButton_C
/// Size: 0x02B8 (696 bytes) (0x0002B8 - 0x0002B8) align 8 MaxSize: 0x02B8
class UWBP_CodeInviteButton_C : public UBBQUI_CodeInviteButton
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/FriendModuleV1/WBP_CodeInviteInputBox.WBP_CodeInviteInputBox_C
/// Size: 0x02E8 (744 bytes) (0x0002E8 - 0x0002E8) align 8 MaxSize: 0x02E8
class UWBP_CodeInviteInputBox_C : public UBBQUI_CodeInviteInputBox
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuSmallSinglePrompt.WBP_PopUp_MenuSmallSinglePrompt_C
/// Size: 0x0568 (1384 bytes) (0x000568 - 0x000568) align 8 MaxSize: 0x0568
class UWBP_PopUp_MenuSmallSinglePrompt_C : public UBBQUI_RichTextPopUpWidget
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoLF.WBP_PopUp_Lobby_NoLF_C
/// Size: 0x05A0 (1440 bytes) (0x000560 - 0x0005A0) align 8 MaxSize: 0x05A0
class UWBP_PopUp_Lobby_NoLF_C : public UBBQUI_PopUpWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x0568   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x0570   (0x0008)  
	class UBBQUI_Image*                                IconBaseImage;                                              // 0x0578   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x0580   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x0588   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0590   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x0598   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoLF.WBP_PopUp_Lobby_NoLF_C.OnShowPopUp
	void OnShowPopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoLF.WBP_PopUp_Lobby_NoLF_C.ExecuteUbergraph_WBP_PopUp_Lobby_NoLF
	void ExecuteUbergraph_WBP_PopUp_Lobby_NoLF(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoVictim.WBP_PopUp_Lobby_NoVictim_C
/// Size: 0x05A0 (1440 bytes) (0x000560 - 0x0005A0) align 8 MaxSize: 0x05A0
class UWBP_PopUp_Lobby_NoVictim_C : public UBBQUI_PopUpWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x0568   (0x0008)  
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x0570   (0x0008)  
	class UBBQUI_Image*                                IconBaseImage;                                              // 0x0578   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x0580   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x0588   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0590   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x0598   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoVictim.WBP_PopUp_Lobby_NoVictim_C.OnShowPopUp
	void OnShowPopUp() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_Lobby_NoVictim.WBP_PopUp_Lobby_NoVictim_C.ExecuteUbergraph_WBP_PopUp_Lobby_NoVictim
	void ExecuteUbergraph_WBP_PopUp_Lobby_NoVictim(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStoreLarge.WBP_PopUp_ContentStoreLarge_C
/// Size: 0x05D0 (1488 bytes) (0x000570 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_PopUp_ContentStoreLarge_C : public UBBQUI_StoreItemPopupWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0570   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Bottom;                                               // 0x0578   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Center;                                               // 0x0580   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Corner;                                               // 0x0588   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Corner0;                                              // 0x0590   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Corner1;                                              // 0x0598   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Corner2;                                              // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Left;                                                 // 0x05A8   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Right;                                                // 0x05B0   (0x0008)  
	class UBBQUI_Image*                                BBQUI_Top;                                                  // 0x05B8   (0x0008)  
	class UWBP_MenuInputPrompt_C*                      ScrollPrompt;                                               // 0x05C0   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05C8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStoreLarge.WBP_PopUp_ContentStoreLarge_C.Get_ScrollPrompt_Visibility
	ESlateVisibility Get_ScrollPrompt_Visibility() // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	{
		typedef ESlateVisibility (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStoreLarge.WBP_PopUp_ContentStoreLarge_C.Destruct
	void Destruct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_ContentStoreLarge.WBP_PopUp_ContentStoreLarge_C.ExecuteUbergraph_WBP_PopUp_ContentStoreLarge
	void ExecuteUbergraph_WBP_PopUp_ContentStoreLarge(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_CharacterSwap.WBP_PopUp_CharacterSwap_C
/// Size: 0x0820 (2080 bytes) (0x000820 - 0x000820) align 8 MaxSize: 0x0820
class UWBP_PopUp_CharacterSwap_C : public UBBQUI_CharacterRequestPopUp
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/CrossPlay/WBP_PlatformIcon.WBP_PlatformIcon_C
/// Size: 0x0320 (800 bytes) (0x000320 - 0x000320) align 8 MaxSize: 0x0320
class UWBP_PlatformIcon_C : public UBBQUI_PlatformIcon
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/GamerDetail/WBP_PlayerAvatar.WBP_PlayerAvatar_C
/// Size: 0x0278 (632 bytes) (0x000278 - 0x000278) align 8 MaxSize: 0x0278
class UWBP_PlayerAvatar_C : public UBBQUI_PlayerAvatar
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUpTimer.WBP_PopUpTimer_C
/// Size: 0x05C0 (1472 bytes) (0x000598 - 0x0005C0) align 8 MaxSize: 0x05C0
class UWBP_PopUpTimer_C : public UBBQUI_TimerPopUp
{ 
public:
	class UBBQUI_Image*                                ButtonPromptBG;                                             // 0x0598   (0x0008)  
	class UBBQUI_Image*                                PopupBG;                                                    // 0x05A0   (0x0008)  
	class UBBQUI_Image*                                PopupTitleBG;                                               // 0x05A8   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x05B0   (0x0008)  
	class UWBP_Pop_Up_BG_Overlay_C*                    WBP_Pop_Up_BG_Overlay;                                      // 0x05B8   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_KeyRebindPopUp.WBP_KeyRebindPopUp_C
/// Size: 0x05D0 (1488 bytes) (0x0005D0 - 0x0005D0) align 8 MaxSize: 0x05D0
class UWBP_KeyRebindPopUp_C : public UBBQUI_KeyRebindPopUp
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/PopUp/WBP_PopUp_MenuSmall_Processing.WBP_PopUp_MenuSmall_Processing_C
/// Size: 0x0570 (1392 bytes) (0x000568 - 0x000570) align 8 MaxSize: 0x0570
class UWBP_PopUp_MenuSmall_Processing_C : public UBBQUI_RichTextPopUpWidget
{ 
public:
	class UThrobber*                                   Spinner_Dots;                                               // 0x0568   (0x0008)  
};

/// Class /Game/BBQGame/UI/Menus/LoadingScreen/WBP_ChainsawLoadingIcon.WBP_ChainsawLoadingIcon_C
/// Size: 0x0298 (664 bytes) (0x000260 - 0x000298) align 8 MaxSize: 0x0298
class UWBP_ChainsawLoadingIcon_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UBBQUI_Image*                                ChainsawIcon;                                               // 0x0268   (0x0008)  
	TWeakObjectPtr<class UMaterialInterface*>          ChainsawIconMaterial;                                       // 0x0270   (0x0008)  
	unsigned char                                      UnknownData00_7[0x20];                                      // 0x0278   (0x0020)  MISSED


	/// Functions
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_ChainsawLoadingIcon.WBP_ChainsawLoadingIcon_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_ChainsawLoadingIcon.WBP_ChainsawLoadingIcon_C.Construct
	void Construct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_ChainsawLoadingIcon.WBP_ChainsawLoadingIcon_C.ExecuteUbergraph_WBP_ChainsawLoadingIcon
	void ExecuteUbergraph_WBP_ChainsawLoadingIcon(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_AutosaveWarning.WBP_AutoSaveWarning_C
/// Size: 0x03E8 (1000 bytes) (0x0003E0 - 0x0003E8) align 8 MaxSize: 0x03E8
class UWBP_AutoSaveWarning_C : public UBBQUI_AutoSaveWarning
{ 
public:
	class UWBP_UI_AutoSave_Icon_C*                     AutoSaveIcon;                                               // 0x03E0   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_AutosaveWarning.WBP_AutoSaveWarning_C.GetAutoSaveWarningMaterial
	UMaterialInstanceDynamic* GetAutoSaveWarningMaterial() // [0x2438a30] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	{
		typedef class UMaterialInstanceDynamic* (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func();
	}
};

/// Class /Game/BBQGame/UI/Menus/WBP_BBQ_TechnicalTest_WatermarkText.WBP_BBQ_TechnicalTest_WatermarkText_C
/// Size: 0x0270 (624 bytes) (0x000260 - 0x000270) align 8 MaxSize: 0x0270
class UWBP_BBQ_TechnicalTest_WatermarkText_C : public UUserWidget
{ 
public:
	class UBBQUI_Image*                                BBQUI_Image;                                                // 0x0260   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0268   (0x0008)  
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C
/// Size: 0x02B0 (688 bytes) (0x000290 - 0x0002B0) align 8 MaxSize: 0x02B0
class UWBP_BBQVoiceIndicatorBase_Full_C : public UBBQUI_VoiceChatIndicator
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	FTimerHandle                                       PostSilenceTimer;                                           // 0x0298   (0x0008)  
	class UWidgetAnimation*                            ShowAnimation;                                              // 0x02A0   (0x0008)  
	class UWidgetAnimation*                            HideAnimation;                                              // 0x02A8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.Event Post Silence Hiding Delay Elapsed
	void EventPostSilenceHidingDelayElapsed() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.OnRemove
	void OnRemove() // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.Event On Remove Animation Finished
	void EventOnRemoveAnimationFinished() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.OnChatIndicatorChanged
	void OnChatIndicatorChanged(EBBQVoiceChatIndicator OldIndicator, EBBQVoiceChatIndicator NewIndicator) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(EBBQVoiceChatIndicator, EBBQVoiceChatIndicator);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(OldIndicator, NewIndicator);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.OnInitialized
	void OnInitialized() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorBase_Full.WBP_BBQVoiceIndicatorBase_Full_C.ExecuteUbergraph_WBP_BBQVoiceIndicatorBase_Full
	void ExecuteUbergraph_WBP_BBQVoiceIndicatorBase_Full(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/Common/WBP_BottomPromptBarV2.WBP_BottomPromptBarV2_C
/// Size: 0x0278 (632 bytes) (0x000278 - 0x000278) align 8 MaxSize: 0x0278
class UWBP_BottomPromptBarV2_C : public UBBQUI_MenuPromptBar
{ 
public:
};

/// Class /Game/BBQGame/UI/Menus/LoadingScreen/BP_RichTextDecorator_InputIcons.BP_RichTextDecorator_InputIcons_C
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UBP_RichTextDecorator_InputIcons_C : public URichTextBlockImageDecorator
{ 
public:
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroupBase_SingleIcon.WBP_BBQVoiceIndicatorGroupBase_SingleIcon_C
/// Size: 0x02E8 (744 bytes) (0x0002C0 - 0x0002E8) align 8 MaxSize: 0x02E8
class UWBP_BBQVoiceIndicatorGroupBase_SingleIcon_C : public UBBQUI_VoiceChatIndicatorGroup
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	bool                                               IconVisible;                                                // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02C9   (0x0003)  MISSED
	float                                              PostSilenceHidingDelay;                                     // 0x02CC   (0x0004)  
	FTimerHandle                                       PostSilenceTimer;                                           // 0x02D0   (0x0008)  
	class UWidgetAnimation*                            HideIconAnimation;                                          // 0x02D8   (0x0008)  
	class UWidgetAnimation*                            ShowIconAnimation;                                          // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroupBase_SingleIcon.WBP_BBQVoiceIndicatorGroupBase_SingleIcon_C.Event Post Silence Hiding Delay Elapsed
	void EventPostSilenceHidingDelayElapsed() // [0x2438a30] BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroupBase_SingleIcon.WBP_BBQVoiceIndicatorGroupBase_SingleIcon_C.OnHasTalkingIndicatorsChanged
	void OnHasTalkingIndicatorsChanged(bool bHasTalkingIndicators) // [0x2438a30] Event|Protected|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(bHasTalkingIndicators);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroupBase_SingleIcon.WBP_BBQVoiceIndicatorGroupBase_SingleIcon_C.Construct
	void Construct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroupBase_SingleIcon.WBP_BBQVoiceIndicatorGroupBase_SingleIcon_C.ExecuteUbergraph_WBP_BBQVoiceIndicatorGroupBase_SingleIcon
	void ExecuteUbergraph_WBP_BBQVoiceIndicatorGroupBase_SingleIcon(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_UI_AutoSave_Icon.WBP_UI_AutoSave_Icon_C
/// Size: 0x0270 (624 bytes) (0x000260 - 0x000270) align 8 MaxSize: 0x0270
class UWBP_UI_AutoSave_Icon_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_UI_AutoSave_Icon.WBP_UI_AutoSave_Icon_C.Construct
	void Construct() // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_UI_AutoSave_Icon.WBP_UI_AutoSave_Icon_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FGeometry, float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(MyGeometry, InDeltaTime);
	}
	// Function /Game/BBQGame/UI/Widgets/CommonWidgets/WBP_UI_AutoSave_Icon.WBP_UI_AutoSave_Icon_C.ExecuteUbergraph_WBP_UI_AutoSave_Icon
	void ExecuteUbergraph_WBP_UI_AutoSave_Icon(int32_t EntryPoint) // [0x2438a30] Final|HasDefaults    
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_Lobby.WBP_BBQVoiceIndicatorGroup_Lobby_C
/// Size: 0x0308 (776 bytes) (0x0002E8 - 0x000308) align 8 MaxSize: 0x0308
class UWBP_BBQVoiceIndicatorGroup_Lobby_C : public UWBP_BBQVoiceIndicatorGroupBase_SingleIcon_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	class UWidgetAnimation*                            Anim_IconHide;                                              // 0x02F0   (0x0008)  
	class UWidgetAnimation*                            Anim_IconShow;                                              // 0x02F8   (0x0008)  
	class UOverlay*                                    SoundIconContainer;                                         // 0x0300   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_Lobby.WBP_BBQVoiceIndicatorGroup_Lobby_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_Lobby.WBP_BBQVoiceIndicatorGroup_Lobby_C.ExecuteUbergraph_WBP_BBQVoiceIndicatorGroup_Lobby
	void ExecuteUbergraph_WBP_BBQVoiceIndicatorGroup_Lobby(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_HUD.WBP_BBQVoiceIndicatorGroup_HUD_C
/// Size: 0x0308 (776 bytes) (0x0002E8 - 0x000308) align 8 MaxSize: 0x0308
class UWBP_BBQVoiceIndicatorGroup_HUD_C : public UWBP_BBQVoiceIndicatorGroupBase_SingleIcon_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	class UWidgetAnimation*                            Anim_IconHide;                                              // 0x02F0   (0x0008)  
	class UWidgetAnimation*                            Anim_IconShow;                                              // 0x02F8   (0x0008)  
	class UOverlay*                                    SoundIconContainer;                                         // 0x0300   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_HUD.WBP_BBQVoiceIndicatorGroup_HUD_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicatorGroup_HUD.WBP_BBQVoiceIndicatorGroup_HUD_C.ExecuteUbergraph_WBP_BBQVoiceIndicatorGroup_HUD
	void ExecuteUbergraph_WBP_BBQVoiceIndicatorGroup_HUD(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/BP_BBQViewportClient.BP_BBQViewportClient_C
/// Size: 0x0418 (1048 bytes) (0x000418 - 0x000418) align 8 MaxSize: 0x0418
class UBP_BBQViewportClient_C : public UBBQViewportClient
{ 
public:


	/// Functions
	// Function /Game/BBQGame/UI/BP_BBQViewportClient.BP_BBQViewportClient_C.CreateLoadingScreenWidget
	UWidget* CreateLoadingScreenWidget(bool IsVictim, bool bIsMatchmakingScreen) // [0x2438a30] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef class UWidget* (*FuncPtr)(bool, bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		return func(IsVictim, bIsMatchmakingScreen);
	}
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_LeftAligned.WBP_BBQVoiceIndicator_LeftAligned_C
/// Size: 0x02D0 (720 bytes) (0x0002B0 - 0x0002D0) align 8 MaxSize: 0x02D0
class UWBP_BBQVoiceIndicator_LeftAligned_C : public UWBP_BBQVoiceIndicatorBase_Full_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            HideAnim;                                                   // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            ShowAnim;                                                   // 0x02C0   (0x0008)  
	class UBBQUI_Image*                                Background;                                                 // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_LeftAligned.WBP_BBQVoiceIndicator_LeftAligned_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_LeftAligned.WBP_BBQVoiceIndicator_LeftAligned_C.ExecuteUbergraph_WBP_BBQVoiceIndicator_LeftAligned
	void ExecuteUbergraph_WBP_BBQVoiceIndicator_LeftAligned(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_RightAligned.WBP_BBQVoiceIndicator_RightAligned_C
/// Size: 0x02D0 (720 bytes) (0x0002B0 - 0x0002D0) align 8 MaxSize: 0x02D0
class UWBP_BBQVoiceIndicator_RightAligned_C : public UWBP_BBQVoiceIndicatorBase_Full_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B0   (0x0008)  
	class UWidgetAnimation*                            HideAnim;                                                   // 0x02B8   (0x0008)  
	class UWidgetAnimation*                            ShowAnim;                                                   // 0x02C0   (0x0008)  
	class UBBQUI_Image*                                Background;                                                 // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_RightAligned.WBP_BBQVoiceIndicator_RightAligned_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/HUD/BBQChat/WBP_BBQVoiceIndicator_RightAligned.WBP_BBQVoiceIndicator_RightAligned_C.ExecuteUbergraph_WBP_BBQVoiceIndicator_RightAligned
	void ExecuteUbergraph_WBP_BBQVoiceIndicator_RightAligned(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/Gameplay/GameModes/BP_BBQBootFlowGameMode.BP_BBQBootFlowGameMode_C
/// Size: 0x03C0 (960 bytes) (0x0003B0 - 0x0003C0) align 8 MaxSize: 0x03C0
class ABP_BBQBootFlowGameMode_C : public ABBQBootFlowGameMode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03B0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x03B8   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/Gameplay/GameModes/BP_BBQBootFlowGameMode.BP_BBQBootFlowGameMode_C.HandleStartingNewPlayer
	void HandleStartingNewPlayer(APlayerController* NewPlayer) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(APlayerController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func(NewPlayer);
	}
	// Function /Game/BBQGame/Gameplay/GameModes/BP_BBQBootFlowGameMode.BP_BBQBootFlowGameMode_C.K2_OnLogout
	void K2_OnLogout(AController* ExitingController) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(AController*);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(ExitingController);
	}
	// Function /Game/BBQGame/Gameplay/GameModes/BP_BBQBootFlowGameMode.BP_BBQBootFlowGameMode_C.ExecuteUbergraph_BP_BBQBootFlowGameMode
	void ExecuteUbergraph_BP_BBQBootFlowGameMode(int32_t EntryPoint) // [0x2438a30] Final                
	{
		typedef void (*FuncPtr)(int32_t);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func(EntryPoint);
	}
};

/// Class /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C
/// Size: 0x04C8 (1224 bytes) (0x000430 - 0x0004C8) align 8 MaxSize: 0x04C8
class UWBP_LoadingScreen_C : public UBBQUI_LoadingScreen
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0430   (0x0008)  
	class UWidgetAnimation*                            ProgressAnimation;                                          // 0x0438   (0x0008)  
	class UImage*                                      BackgroundImage;                                            // 0x0440   (0x0008)  
	class UImage*                                      Banner;                                                     // 0x0448   (0x0008)  
	class UProgressBar*                                Progress;                                                   // 0x0450   (0x0008)  
	class UBBQUI_TextBlock*                            ProgressTime;                                               // 0x0458   (0x0008)  
	class UOverlay*                                    ProgressWidget;                                             // 0x0460   (0x0008)  
	class UWBP_AspectRatioLock_C*                      WBP_AspectRatioLock;                                        // 0x0468   (0x0008)  
	class UWBP_BBQVoiceIndicatorGroup_HUD_C*           WBP_BBQVoiceIndicatorGroup_HUD;                             // 0x0470   (0x0008)  
	class UWBP_BottomPromptBarV2_C*                    WBP_BottomPromptBarV2;                                      // 0x0478   (0x0008)  
	class UWBP_ChainsawLoadingIcon_C*                  WBP_ChainsawLoadingIcon;                                    // 0x0480   (0x0008)  
	SDK_UNDEFINED(16,605) /* FMulticastInlineDelegate */ __um(ButtonPressed);                                      // 0x0488   (0x0010)  
	FTimespan                                          Timespan;                                                   // 0x0498   (0x0008)  
	bool                                               VisibilityAndTimespanEvent;                                 // 0x04A0   (0x0001)  
	bool                                               IsMatchmakingScreen;                                        // 0x04A1   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x04A2   (0x0006)  MISSED
	FText                                              CancellingText;                                             // 0x04A8   (0x0018)  
	FDateTime                                          StartTime;                                                  // 0x04C0   (0x0008)  


	/// Functions
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SequenceEvent__ENTRYPOINTWBP_LoadingScreen
	void SequenceEvent__ENTRYPOINTWBP_LoadingScreen() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[0]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetStartTime
	void SetStartTime(FDateTime& Timestamp) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(FDateTime&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[1]);
		func(Timestamp);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.UpdateProgress
	void UpdateProgress() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[2]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetMatchmakingScreen
	void SetMatchmakingScreen(bool IsMatchmakingScreen) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[3]);
		func(IsMatchmakingScreen);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.EndProgressBar
	void EndProgressBar() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[4]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.StartProgressBar
	void StartProgressBar() // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[5]);
		func();
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetProgressVisibilityAndTimeSpan
	void SetProgressVisibilityAndTimeSpan(bool bIsEnabled, FTimespan& Timespan) // [0x2438a30] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, FTimespan&);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[6]);
		func(bIsEnabled, Timespan);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.UpdateTimeTextFromPercentage
	void UpdateTimeTextFromPercentage(float Percentage) // [0x2438a30] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[7]);
		func(Percentage);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetProgressPercent
	void SetProgressPercent(float InPercent) // [0x2438a30] Public|BlueprintCallable|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[8]);
		func(InPercent);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetProgressPercentage
	void SetProgressPercentage(float ProgessPercentage) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(float);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[9]);
		func(ProgessPercentage);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.SetProgressBarVisibilityAndTimeSpan
	void SetProgressBarVisibilityAndTimeSpan(bool bIsVisible, FTimespan Timespan) // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool, FTimespan);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[10]);
		func(bIsVisible, Timespan);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.PreConstruct
	void PreConstruct(bool IsDesignTime) // [0x2438a30] BlueprintCosmetic|Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)(bool);
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[11]);
		func(IsDesignTime);
	}
	// Function /Game/BBQGame/UI/Menus/LoadingScreen/WBP_LoadingScreen.WBP_LoadingScreen_C.OnCancelPressed
	void OnCancelPressed() // [0x2438a30] Event|Public|BlueprintEvent 
	{
		typedef void (*FuncPtr)();
		auto vtablePtr = reinterpret_cast<uintptr_t*>(vtable);
		auto func = reinterpret_cast<FuncPtr>(vtablePtr[12]);
		func();
	}
