
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
#include "BasicType.h"
#include "CoreUObject.h"
#include "merged_AudioMixer_Engine_UMG_MovieScene_MovieSceneTracks.h"
#include "PlayFabCommon.h"

#pragma pack(push, 0x1)

class UPlayFabAdminAPI;
class UPlayFabAdminModelDecoder;
class UPlayFabAuthenticationAPI;
class UPlayFabAuthenticationModelDecoder;
class UPlayFabClientAPI;
class UPlayFabClientModelDecoder;
class UPlayFabCloudScriptAPI;
class UPlayFabCloudScriptModelDecoder;
class UPlayFabDataAPI;
class UPlayFabDataModelDecoder;
class UPlayFabEconomyAPI;
class UPlayFabEconomyModelDecoder;
class UPlayFabEventsAPI;
class UPlayFabEventsModelDecoder;
class UPlayFabExperimentationAPI;
class UPlayFabExperimentationModelDecoder;
class UPlayFabGroupsAPI;
class UPlayFabGroupsModelDecoder;
class UPlayFabInsightsAPI;
class UPlayFabInsightsModelDecoder;
class UPlayFabJsonObject;
class UPlayFabJsonValue;
class UPlayFabLocalizationAPI;
class UPlayFabLocalizationModelDecoder;
class UPlayFabMatchmakerAPI;
class UPlayFabMatchmakerModelDecoder;
class UPlayFabMultiplayerAPI;
class UPlayFabMultiplayerModelDecoder;
class UPlayFabProfilesAPI;
class UPlayFabProfilesModelDecoder;
class UPlayFabServerAPI;
class UPlayFabServerModelDecoder;
class UPlayFabUtilities;

/// Enum /Script/PlayFab.EStatisticResetIntervalOption
/// Size: 0x01 (1 bytes)
enum class EStatisticResetIntervalOption : uint8_t
{
	EStatisticResetIntervalOption__pfenum_Never                                      = 0,
	EStatisticResetIntervalOption__pfenum_Hour                                       = 1,
	EStatisticResetIntervalOption__pfenum_Day                                        = 2,
	EStatisticResetIntervalOption__pfenum_Week                                       = 3,
	EStatisticResetIntervalOption__pfenum_Month                                      = 4
};

/// Enum /Script/PlayFab.EStatisticAggregationMethod
/// Size: 0x01 (1 bytes)
enum class EStatisticAggregationMethod : uint8_t
{
	EStatisticAggregationMethod__pfenum_Last                                         = 0,
	EStatisticAggregationMethod__pfenum_Min                                          = 1,
	EStatisticAggregationMethod__pfenum_Max                                          = 2,
	EStatisticAggregationMethod__pfenum_Sum                                          = 3
};

/// Enum /Script/PlayFab.ERegion
/// Size: 0x01 (1 bytes)
enum class ERegion : uint8_t
{
	ERegion__pfenum_USCentral                                                        = 0,
	ERegion__pfenum_USEast                                                           = 1,
	ERegion__pfenum_EUWest                                                           = 2,
	ERegion__pfenum_Singapore                                                        = 3,
	ERegion__pfenum_Japan                                                            = 4,
	ERegion__pfenum_Brazil                                                           = 5,
	ERegion__pfenum_Australia                                                        = 6
};

/// Enum /Script/PlayFab.EPfSourceType
/// Size: 0x01 (1 bytes)
enum class EPfSourceType : uint8_t
{
	EPfSourceType__pfenum_Admin                                                      = 0,
	EPfSourceType__pfenum_BackEnd                                                    = 1,
	EPfSourceType__pfenum_GameClient                                                 = 2,
	EPfSourceType__pfenum_GameServer                                                 = 3,
	EPfSourceType__pfenum_Partner                                                    = 4,
	EPfSourceType__pfenum_Custom                                                     = 5,
	EPfSourceType__pfenum_API                                                        = 6
};

/// Enum /Script/PlayFab.EGameBuildStatus
/// Size: 0x01 (1 bytes)
enum class EGameBuildStatus : uint8_t
{
	EGameBuildStatus__pfenum_Available                                               = 0,
	EGameBuildStatus__pfenum_Validating                                              = 1,
	EGameBuildStatus__pfenum_InvalidBuildPackage                                     = 2,
	EGameBuildStatus__pfenum_Processing                                              = 3,
	EGameBuildStatus__pfenum_FailedToProcess                                         = 4
};

/// Enum /Script/PlayFab.EAuthTokenType
/// Size: 0x01 (1 bytes)
enum class EAuthTokenType : uint8_t
{
	EAuthTokenType__pfenum_Email                                                     = 0
};

/// Enum /Script/PlayFab.ETaskInstanceStatus
/// Size: 0x01 (1 bytes)
enum class ETaskInstanceStatus : uint8_t
{
	ETaskInstanceStatus__pfenum_Succeeded                                            = 0,
	ETaskInstanceStatus__pfenum_Starting                                             = 1,
	ETaskInstanceStatus__pfenum_InProgress                                           = 2,
	ETaskInstanceStatus__pfenum_Failed                                               = 3,
	ETaskInstanceStatus__pfenum_Aborted                                              = 4,
	ETaskInstanceStatus__pfenum_Stalled                                              = 5
};

/// Enum /Script/PlayFab.EResolutionOutcome
/// Size: 0x01 (1 bytes)
enum class EResolutionOutcome : uint8_t
{
	EResolutionOutcome__pfenum_Revoke                                                = 0,
	EResolutionOutcome__pfenum_Reinstate                                             = 1,
	EResolutionOutcome__pfenum_Manual                                                = 2
};

/// Enum /Script/PlayFab.EPushSetupPlatform
/// Size: 0x01 (1 bytes)
enum class EPushSetupPlatform : uint8_t
{
	EPushSetupPlatform__pfenum_GCM                                                   = 0,
	EPushSetupPlatform__pfenum_APNS                                                  = 1,
	EPushSetupPlatform__pfenum_APNS_SANDBOX                                          = 2
};

/// Enum /Script/PlayFab.EScheduledTaskType
/// Size: 0x01 (1 bytes)
enum class EScheduledTaskType : uint8_t
{
	EScheduledTaskType__pfenum_CloudScript                                           = 0,
	EScheduledTaskType__pfenum_ActionsOnPlayerSegment                                = 1,
	EScheduledTaskType__pfenum_CloudScriptAzureFunctions                             = 2,
	EScheduledTaskType__pfenum_InsightsScheduledScaling                              = 3
};

/// Enum /Script/PlayFab.EUserDataPermission
/// Size: 0x01 (1 bytes)
enum class EUserDataPermission : uint8_t
{
	EUserDataPermission__pfenum_Private                                              = 0,
	EUserDataPermission__pfenum_Public                                               = 1
};

/// Enum /Script/PlayFab.ELoginIdentityProvider
/// Size: 0x01 (1 bytes)
enum class ELoginIdentityProvider : uint8_t
{
	ELoginIdentityProvider__pfenum_Unknown                                           = 0,
	ELoginIdentityProvider__pfenum_PlayFab                                           = 1,
	ELoginIdentityProvider__pfenum_Custom                                            = 2,
	ELoginIdentityProvider__pfenum_GameCenter                                        = 3,
	ELoginIdentityProvider__pfenum_GooglePlay                                        = 4,
	ELoginIdentityProvider__pfenum_Steam                                             = 5,
	ELoginIdentityProvider__pfenum_XBoxLive                                          = 6,
	ELoginIdentityProvider__pfenum_PSN                                               = 7,
	ELoginIdentityProvider__pfenum_Kongregate                                        = 8,
	ELoginIdentityProvider__pfenum_Facebook                                          = 9,
	ELoginIdentityProvider__pfenum_IOSDevice                                         = 10,
	ELoginIdentityProvider__pfenum_AndroidDevice                                     = 11,
	ELoginIdentityProvider__pfenum_Twitch                                            = 12,
	ELoginIdentityProvider__pfenum_WindowsHello                                      = 13,
	ELoginIdentityProvider__pfenum_GameServer                                        = 14,
	ELoginIdentityProvider__pfenum_CustomServer                                      = 15,
	ELoginIdentityProvider__pfenum_NintendoSwitch                                    = 16,
	ELoginIdentityProvider__pfenum_FacebookInstantGames                              = 17,
	ELoginIdentityProvider__pfenum_OpenIdConnect                                     = 18,
	ELoginIdentityProvider__pfenum_Apple                                             = 19,
	ELoginIdentityProvider__pfenum_NintendoSwitchAccount                             = 20
};

/// Enum /Script/PlayFab.EIdentifiedDeviceType
/// Size: 0x01 (1 bytes)
enum class EIdentifiedDeviceType : uint8_t
{
	EIdentifiedDeviceType__pfenum_Unknown                                            = 0,
	EIdentifiedDeviceType__pfenum_XboxOne                                            = 1,
	EIdentifiedDeviceType__pfenum_Scarlett                                           = 2
};

/// Enum /Script/PlayFab.EMatchmakeStatus
/// Size: 0x01 (1 bytes)
enum class EMatchmakeStatus : uint8_t
{
	EMatchmakeStatus__pfenum_Complete                                                = 0,
	EMatchmakeStatus__pfenum_Waiting                                                 = 1,
	EMatchmakeStatus__pfenum_GameNotFound                                            = 2,
	EMatchmakeStatus__pfenum_NoAvailableSlots                                        = 3,
	EMatchmakeStatus__pfenum_SessionClosed                                           = 4
};

/// Enum /Script/PlayFab.ETransactionStatus
/// Size: 0x01 (1 bytes)
enum class ETransactionStatus : uint8_t
{
	ETransactionStatus__pfenum_CreateCart                                            = 0,
	ETransactionStatus__pfenum_Init                                                  = 1,
	ETransactionStatus__pfenum_Approved                                              = 2,
	ETransactionStatus__pfenum_Succeeded                                             = 3,
	ETransactionStatus__pfenum_FailedByProvider                                      = 4,
	ETransactionStatus__pfenum_DisputePending                                        = 5,
	ETransactionStatus__pfenum_RefundPending                                         = 6,
	ETransactionStatus__pfenum_Refunded                                              = 7,
	ETransactionStatus__pfenum_RefundFailed                                          = 8,
	ETransactionStatus__pfenum_ChargedBack                                           = 9,
	ETransactionStatus__pfenum_FailedByUber                                          = 10,
	ETransactionStatus__pfenum_FailedByPlayFab                                       = 11,
	ETransactionStatus__pfenum_Revoked                                               = 12,
	ETransactionStatus__pfenum_TradePending                                          = 13,
	ETransactionStatus__pfenum_Traded                                                = 14,
	ETransactionStatus__pfenum_Upgraded                                              = 15,
	ETransactionStatus__pfenum_StackPending                                          = 16,
	ETransactionStatus__pfenum_Stacked                                               = 17,
	ETransactionStatus__pfenum_Other                                                 = 18,
	ETransactionStatus__pfenum_Failed                                                = 19
};

/// Enum /Script/PlayFab.ECloudScriptRevisionOption
/// Size: 0x01 (1 bytes)
enum class ECloudScriptRevisionOption : uint8_t
{
	ECloudScriptRevisionOption__pfenum_Live                                          = 0,
	ECloudScriptRevisionOption__pfenum_Latest                                        = 1,
	ECloudScriptRevisionOption__pfenum_Specific                                      = 2
};

/// Enum /Script/PlayFab.ETradeStatus
/// Size: 0x01 (1 bytes)
enum class ETradeStatus : uint8_t
{
	ETradeStatus__pfenum_Invalid                                                     = 0,
	ETradeStatus__pfenum_Opening                                                     = 1,
	ETradeStatus__pfenum_Open                                                        = 2,
	ETradeStatus__pfenum_Accepting                                                   = 3,
	ETradeStatus__pfenum_Accepted                                                    = 4,
	ETradeStatus__pfenum_Filled                                                      = 5,
	ETradeStatus__pfenum_Cancelled                                                   = 6
};

/// Enum /Script/PlayFab.EAdActivity
/// Size: 0x01 (1 bytes)
enum class EAdActivity : uint8_t
{
	EAdActivity__pfenum_Opened                                                       = 0,
	EAdActivity__pfenum_Closed                                                       = 1,
	EAdActivity__pfenum_Start                                                        = 2,
	EAdActivity__pfenum_End                                                          = 3
};

/// Enum /Script/PlayFab.EPublishResult
/// Size: 0x01 (1 bytes)
enum class EPublishResult : uint8_t
{
	EPublishResult__pfenum_Unknown                                                   = 0,
	EPublishResult__pfenum_Pending                                                   = 1,
	EPublishResult__pfenum_Succeeded                                                 = 2,
	EPublishResult__pfenum_Failed                                                    = 3,
	EPublishResult__pfenum_Canceled                                                  = 4
};

/// Enum /Script/PlayFab.EConcernCategory
/// Size: 0x01 (1 bytes)
enum class EConcernCategory : uint8_t
{
	EConcernCategory__pfenum_None                                                    = 0,
	EConcernCategory__pfenum_OffensiveContent                                        = 1,
	EConcernCategory__pfenum_ChildExploitation                                       = 2,
	EConcernCategory__pfenum_MalwareOrVirus                                          = 3,
	EConcernCategory__pfenum_PrivacyConcerns                                         = 4,
	EConcernCategory__pfenum_MisleadingApp                                           = 5,
	EConcernCategory__pfenum_PoorPerformance                                         = 6,
	EConcernCategory__pfenum_ReviewResponse                                          = 7,
	EConcernCategory__pfenum_SpamAdvertising                                         = 8,
	EConcernCategory__pfenum_Profanity                                               = 9
};

/// Enum /Script/PlayFab.EModerationStatus
/// Size: 0x01 (1 bytes)
enum class EModerationStatus : uint8_t
{
	EModerationStatus__pfenum_Unknown                                                = 0,
	EModerationStatus__pfenum_AwaitingModeration                                     = 1,
	EModerationStatus__pfenum_Approved                                               = 2,
	EModerationStatus__pfenum_Rejected                                               = 3
};

/// Enum /Script/PlayFab.EHelpfulnessVote
/// Size: 0x01 (1 bytes)
enum class EHelpfulnessVote : uint8_t
{
	EHelpfulnessVote__pfenum_None                                                    = 0,
	EHelpfulnessVote__pfenum_UnHelpful                                               = 1,
	EHelpfulnessVote__pfenum_Helpful                                                 = 2
};

/// Enum /Script/PlayFab.EExperimentType
/// Size: 0x01 (1 bytes)
enum class EExperimentType : uint8_t
{
	EExperimentType__pfenum_Active                                                   = 0,
	EExperimentType__pfenum_Snapshot                                                 = 1
};

/// Enum /Script/PlayFab.EOperationTypes
/// Size: 0x01 (1 bytes)
enum class EOperationTypes : uint8_t
{
	EOperationTypes__pfenum_Created                                                  = 0,
	EOperationTypes__pfenum_Updated                                                  = 1,
	EOperationTypes__pfenum_Deleted                                                  = 2,
	EOperationTypes__pfenum_None                                                     = 3
};

/// Enum /Script/PlayFab.EAzureVmSize
/// Size: 0x01 (1 bytes)
enum class EAzureVmSize : uint8_t
{
	EAzureVmSize__pfenum_Standard_A1                                                 = 0,
	EAzureVmSize__pfenum_Standard_A2                                                 = 1,
	EAzureVmSize__pfenum_Standard_A3                                                 = 2,
	EAzureVmSize__pfenum_Standard_A4                                                 = 3,
	EAzureVmSize__pfenum_Standard_A1_v2                                              = 4,
	EAzureVmSize__pfenum_Standard_A2_v2                                              = 5,
	EAzureVmSize__pfenum_Standard_A4_v2                                              = 6,
	EAzureVmSize__pfenum_Standard_A8_v2                                              = 7,
	EAzureVmSize__pfenum_Standard_D1_v2                                              = 8,
	EAzureVmSize__pfenum_Standard_D2_v2                                              = 9,
	EAzureVmSize__pfenum_Standard_D3_v2                                              = 10,
	EAzureVmSize__pfenum_Standard_D4_v2                                              = 11,
	EAzureVmSize__pfenum_Standard_D5_v2                                              = 12,
	EAzureVmSize__pfenum_Standard_D2_v3                                              = 13,
	EAzureVmSize__pfenum_Standard_D4_v3                                              = 14,
	EAzureVmSize__pfenum_Standard_D8_v3                                              = 15,
	EAzureVmSize__pfenum_Standard_D16_v3                                             = 16,
	EAzureVmSize__pfenum_Standard_F1                                                 = 17,
	EAzureVmSize__pfenum_Standard_F2                                                 = 18,
	EAzureVmSize__pfenum_Standard_F4                                                 = 19,
	EAzureVmSize__pfenum_Standard_F8                                                 = 20,
	EAzureVmSize__pfenum_Standard_F16                                                = 21,
	EAzureVmSize__pfenum_Standard_F2s_v2                                             = 22,
	EAzureVmSize__pfenum_Standard_F4s_v2                                             = 23,
	EAzureVmSize__pfenum_Standard_F8s_v2                                             = 24,
	EAzureVmSize__pfenum_Standard_F16s_v2                                            = 25,
	EAzureVmSize__pfenum_Standard_D2as_v4                                            = 26,
	EAzureVmSize__pfenum_Standard_D4as_v4                                            = 27,
	EAzureVmSize__pfenum_Standard_D8as_v4                                            = 28,
	EAzureVmSize__pfenum_Standard_D16as_v4                                           = 29,
	EAzureVmSize__pfenum_Standard_D2a_v4                                             = 30,
	EAzureVmSize__pfenum_Standard_D4a_v4                                             = 31,
	EAzureVmSize__pfenum_Standard_D8a_v4                                             = 32,
	EAzureVmSize__pfenum_Standard_D16a_v4                                            = 33,
	EAzureVmSize__pfenum_Standard_E2a_v4                                             = 34,
	EAzureVmSize__pfenum_Standard_E4a_v4                                             = 35,
	EAzureVmSize__pfenum_Standard_E8a_v4                                             = 36,
	EAzureVmSize__pfenum_Standard_E16a_v4                                            = 37,
	EAzureVmSize__pfenum_Standard_E2as_v4                                            = 38,
	EAzureVmSize__pfenum_Standard_E4as_v4                                            = 39,
	EAzureVmSize__pfenum_Standard_E8as_v4                                            = 40,
	EAzureVmSize__pfenum_Standard_E16as_v4                                           = 41,
	EAzureVmSize__pfenum_Standard_D2s_v3                                             = 42,
	EAzureVmSize__pfenum_Standard_D4s_v3                                             = 43,
	EAzureVmSize__pfenum_Standard_D8s_v3                                             = 44,
	EAzureVmSize__pfenum_Standard_D16s_v3                                            = 45,
	EAzureVmSize__pfenum_Standard_DS1_v2                                             = 46,
	EAzureVmSize__pfenum_Standard_DS2_v2                                             = 47,
	EAzureVmSize__pfenum_Standard_DS3_v2                                             = 48,
	EAzureVmSize__pfenum_Standard_DS4_v2                                             = 49,
	EAzureVmSize__pfenum_Standard_DS5_v2                                             = 50,
	EAzureVmSize__pfenum_Standard_NC4as_T4_v3                                        = 51,
	EAzureVmSize__pfenum_Standard_D2d_v4                                             = 52,
	EAzureVmSize__pfenum_Standard_D4d_v4                                             = 53,
	EAzureVmSize__pfenum_Standard_D8d_v4                                             = 54,
	EAzureVmSize__pfenum_Standard_D16d_v4                                            = 55,
	EAzureVmSize__pfenum_Standard_D2ds_v4                                            = 56,
	EAzureVmSize__pfenum_Standard_D4ds_v4                                            = 57,
	EAzureVmSize__pfenum_Standard_D8ds_v4                                            = 58,
	EAzureVmSize__pfenum_Standard_D16ds_v4                                           = 59,
	EAzureVmSize__pfenum_Standard_HB120_16rs_v3                                      = 60,
	EAzureVmSize__pfenum_Standard_HB120_32rs_v3                                      = 61,
	EAzureVmSize__pfenum_Standard_HB120_64rs_v3                                      = 62,
	EAzureVmSize__pfenum_Standard_HB120_96rs_v3                                      = 63,
	EAzureVmSize__pfenum_Standard_HB120rs_v3                                         = 64
};

/// Enum /Script/PlayFab.EContainerFlavor
/// Size: 0x01 (1 bytes)
enum class EContainerFlavor : uint8_t
{
	EContainerFlavor__pfenum_ManagedWindowsServerCore                                = 0,
	EContainerFlavor__pfenum_CustomLinux                                             = 1,
	EContainerFlavor__pfenum_ManagedWindowsServerCorePreview                         = 2,
	EContainerFlavor__pfenum_Invalid                                                 = 3
};

/// Enum /Script/PlayFab.EOwnerMigrationPolicy
/// Size: 0x01 (1 bytes)
enum class EOwnerMigrationPolicy : uint8_t
{
	EOwnerMigrationPolicy__pfenum_None                                               = 0,
	EOwnerMigrationPolicy__pfenum_Automatic                                          = 1,
	EOwnerMigrationPolicy__pfenum_Manual                                             = 2,
	EOwnerMigrationPolicy__pfenum_Server                                             = 3
};

/// Enum /Script/PlayFab.EAccessPolicy
/// Size: 0x01 (1 bytes)
enum class EAccessPolicy : uint8_t
{
	EAccessPolicy__pfenum_Public                                                     = 0,
	EAccessPolicy__pfenum_Friends                                                    = 1,
	EAccessPolicy__pfenum_Private                                                    = 2
};

/// Enum /Script/PlayFab.ETitleMultiplayerServerEnabledStatus
/// Size: 0x01 (1 bytes)
enum class ETitleMultiplayerServerEnabledStatus : uint8_t
{
	ETitleMultiplayerServerEnabledStatus__pfenum_Initializing                        = 0,
	ETitleMultiplayerServerEnabledStatus__pfenum_Enabled                             = 1,
	ETitleMultiplayerServerEnabledStatus__pfenum_Disabled                            = 2
};

/// Enum /Script/PlayFab.ESubscriptionType
/// Size: 0x01 (1 bytes)
enum class ESubscriptionType : uint8_t
{
	ESubscriptionType__pfenum_LobbyChange                                            = 0,
	ESubscriptionType__pfenum_LobbyInvite                                            = 1
};

/// Enum /Script/PlayFab.EMembershipLock
/// Size: 0x01 (1 bytes)
enum class EMembershipLock : uint8_t
{
	EMembershipLock__pfenum_Unlocked                                                 = 0,
	EMembershipLock__pfenum_Locked                                                   = 1
};

/// Enum /Script/PlayFab.EPlayerConnectionState
/// Size: 0x01 (1 bytes)
enum class EPlayerConnectionState : uint8_t
{
	EPlayerConnectionState__pfenum_Unassigned                                        = 0,
	EPlayerConnectionState__pfenum_Connecting                                        = 1,
	EPlayerConnectionState__pfenum_Participating                                     = 2,
	EPlayerConnectionState__pfenum_Participated                                      = 3
};

/// Enum /Script/PlayFab.EGameInstanceState
/// Size: 0x01 (1 bytes)
enum class EGameInstanceState : uint8_t
{
	EGameInstanceState__pfenum_Open                                                  = 0,
	EGameInstanceState__pfenum_Closed                                                = 1
};

/// Enum /Script/PlayFab.EServerType
/// Size: 0x01 (1 bytes)
enum class EServerType : uint8_t
{
	EServerType__pfenum_Container                                                    = 0,
	EServerType__pfenum_Process                                                      = 1
};

/// Enum /Script/PlayFab.EProtocolType
/// Size: 0x01 (1 bytes)
enum class EProtocolType : uint8_t
{
	EProtocolType__pfenum_TCP                                                        = 0,
	EProtocolType__pfenum_UDP                                                        = 1
};

/// Enum /Script/PlayFab.EOsPlatform
/// Size: 0x01 (1 bytes)
enum class EOsPlatform : uint8_t
{
	EOsPlatform__pfenum_Windows                                                      = 0,
	EOsPlatform__pfenum_Linux                                                        = 1
};

/// Enum /Script/PlayFab.ECancellationReason
/// Size: 0x01 (1 bytes)
enum class ECancellationReason : uint8_t
{
	ECancellationReason__pfenum_Requested                                            = 0,
	ECancellationReason__pfenum_Internal                                             = 1,
	ECancellationReason__pfenum_Timeout                                              = 2
};

/// Enum /Script/PlayFab.EAzureVmFamily
/// Size: 0x01 (1 bytes)
enum class EAzureVmFamily : uint8_t
{
	EAzureVmFamily__pfenum_A                                                         = 0,
	EAzureVmFamily__pfenum_Av2                                                       = 1,
	EAzureVmFamily__pfenum_Dv2                                                       = 2,
	EAzureVmFamily__pfenum_Dv3                                                       = 3,
	EAzureVmFamily__pfenum_F                                                         = 4,
	EAzureVmFamily__pfenum_Fsv2                                                      = 5,
	EAzureVmFamily__pfenum_Dasv4                                                     = 6,
	EAzureVmFamily__pfenum_Dav4                                                      = 7,
	EAzureVmFamily__pfenum_Eav4                                                      = 8,
	EAzureVmFamily__pfenum_Easv4                                                     = 9,
	EAzureVmFamily__pfenum_Ev4                                                       = 10,
	EAzureVmFamily__pfenum_Esv4                                                      = 11,
	EAzureVmFamily__pfenum_Dsv3                                                      = 12,
	EAzureVmFamily__pfenum_Dsv2                                                      = 13,
	EAzureVmFamily__pfenum_NCasT4_v3                                                 = 14,
	EAzureVmFamily__pfenum_Ddv4                                                      = 15,
	EAzureVmFamily__pfenum_Ddsv4                                                     = 16,
	EAzureVmFamily__pfenum_HBv3                                                      = 17
};

/// Enum /Script/PlayFab.EAzureRegion
/// Size: 0x01 (1 bytes)
enum class EAzureRegion : uint8_t
{
	EAzureRegion__pfenum_AustraliaEast                                               = 0,
	EAzureRegion__pfenum_AustraliaSoutheast                                          = 1,
	EAzureRegion__pfenum_BrazilSouth                                                 = 2,
	EAzureRegion__pfenum_CentralUs                                                   = 3,
	EAzureRegion__pfenum_EastAsia                                                    = 4,
	EAzureRegion__pfenum_EastUs                                                      = 5,
	EAzureRegion__pfenum_EastUs2                                                     = 6,
	EAzureRegion__pfenum_JapanEast                                                   = 7,
	EAzureRegion__pfenum_JapanWest                                                   = 8,
	EAzureRegion__pfenum_NorthCentralUs                                              = 9,
	EAzureRegion__pfenum_NorthEurope                                                 = 10,
	EAzureRegion__pfenum_SouthCentralUs                                              = 11,
	EAzureRegion__pfenum_SoutheastAsia                                               = 12,
	EAzureRegion__pfenum_WestEurope                                                  = 13,
	EAzureRegion__pfenum_WestUs                                                      = 14,
	EAzureRegion__pfenum_SouthAfricaNorth                                            = 15,
	EAzureRegion__pfenum_WestCentralUs                                               = 16,
	EAzureRegion__pfenum_KoreaCentral                                                = 17,
	EAzureRegion__pfenum_FranceCentral                                               = 18,
	EAzureRegion__pfenum_WestUs2                                                     = 19,
	EAzureRegion__pfenum_CentralIndia                                                = 20,
	EAzureRegion__pfenum_UaeNorth                                                    = 21,
	EAzureRegion__pfenum_UkSouth                                                     = 22
};

/// Enum /Script/PlayFab.EExperimentState
/// Size: 0x01 (1 bytes)
enum class EExperimentState : uint8_t
{
	EExperimentState__pfenum_New                                                     = 0,
	EExperimentState__pfenum_Started                                                 = 1,
	EExperimentState__pfenum_Stopped                                                 = 2,
	EExperimentState__pfenum_Deleted                                                 = 3
};

/// Enum /Script/PlayFab.EAnalysisTaskState
/// Size: 0x01 (1 bytes)
enum class EAnalysisTaskState : uint8_t
{
	EAnalysisTaskState__pfenum_Waiting                                               = 0,
	EAnalysisTaskState__pfenum_ReadyForSubmission                                    = 1,
	EAnalysisTaskState__pfenum_SubmittingToPipeline                                  = 2,
	EAnalysisTaskState__pfenum_Running                                               = 3,
	EAnalysisTaskState__pfenum_Completed                                             = 4,
	EAnalysisTaskState__pfenum_Failed                                                = 5,
	EAnalysisTaskState__pfenum_Canceled                                              = 6
};

/// Enum /Script/PlayFab.EDisplayPropertyType
/// Size: 0x01 (1 bytes)
enum class EDisplayPropertyType : uint8_t
{
	EDisplayPropertyType__pfenum_None                                                = 0,
	EDisplayPropertyType__pfenum_QueryDateTime                                       = 1,
	EDisplayPropertyType__pfenum_QueryDouble                                         = 2,
	EDisplayPropertyType__pfenum_QueryString                                         = 3,
	EDisplayPropertyType__pfenum_SearchString                                        = 4
};

/// Enum /Script/PlayFab.EPfTriggerType
/// Size: 0x01 (1 bytes)
enum class EPfTriggerType : uint8_t
{
	EPfTriggerType__pfenum_HTTP                                                      = 0,
	EPfTriggerType__pfenum_Queue                                                     = 1
};

/// Enum /Script/PlayFab.EUserOrigination
/// Size: 0x01 (1 bytes)
enum class EUserOrigination : uint8_t
{
	EUserOrigination__pfenum_Organic                                                 = 0,
	EUserOrigination__pfenum_Steam                                                   = 1,
	EUserOrigination__pfenum_Google                                                  = 2,
	EUserOrigination__pfenum_Amazon                                                  = 3,
	EUserOrigination__pfenum_Facebook                                                = 4,
	EUserOrigination__pfenum_Kongregate                                              = 5,
	EUserOrigination__pfenum_GamersFirst                                             = 6,
	EUserOrigination__pfenum_Unknown                                                 = 7,
	EUserOrigination__pfenum_IOS                                                     = 8,
	EUserOrigination__pfenum_LoadTest                                                = 9,
	EUserOrigination__pfenum_Android                                                 = 10,
	EUserOrigination__pfenum_PSN                                                     = 11,
	EUserOrigination__pfenum_GameCenter                                              = 12,
	EUserOrigination__pfenum_CustomId                                                = 13,
	EUserOrigination__pfenum_XboxLive                                                = 14,
	EUserOrigination__pfenum_Parse                                                   = 15,
	EUserOrigination__pfenum_Twitch                                                  = 16,
	EUserOrigination__pfenum_ServerCustomId                                          = 17,
	EUserOrigination__pfenum_NintendoSwitchDeviceId                                  = 18,
	EUserOrigination__pfenum_FacebookInstantGamesId                                  = 19,
	EUserOrigination__pfenum_OpenIdConnect                                           = 20,
	EUserOrigination__pfenum_Apple                                                   = 21,
	EUserOrigination__pfenum_NintendoSwitchAccount                                   = 22
};

/// Enum /Script/PlayFab.ETitleActivationStatus
/// Size: 0x01 (1 bytes)
enum class ETitleActivationStatus : uint8_t
{
	ETitleActivationStatus__pfenum_None                                              = 0,
	ETitleActivationStatus__pfenum_ActivatedTitleKey                                 = 1,
	ETitleActivationStatus__pfenum_PendingSteam                                      = 2,
	ETitleActivationStatus__pfenum_ActivatedSteam                                    = 3,
	ETitleActivationStatus__pfenum_RevokedSteam                                      = 4
};

/// Enum /Script/PlayFab.ESubscriptionProviderStatus
/// Size: 0x01 (1 bytes)
enum class ESubscriptionProviderStatus : uint8_t
{
	ESubscriptionProviderStatus__pfenum_NoError                                      = 0,
	ESubscriptionProviderStatus__pfenum_Cancelled                                    = 1,
	ESubscriptionProviderStatus__pfenum_UnknownError                                 = 2,
	ESubscriptionProviderStatus__pfenum_BillingError                                 = 3,
	ESubscriptionProviderStatus__pfenum_ProductUnavailable                           = 4,
	ESubscriptionProviderStatus__pfenum_CustomerDidNotAcceptPriceChange              = 5,
	ESubscriptionProviderStatus__pfenum_FreeTrial                                    = 6,
	ESubscriptionProviderStatus__pfenum_PaymentPending                               = 7
};

/// Enum /Script/PlayFab.EStatisticVersionStatus
/// Size: 0x01 (1 bytes)
enum class EStatisticVersionStatus : uint8_t
{
	EStatisticVersionStatus__pfenum_Active                                           = 0,
	EStatisticVersionStatus__pfenum_SnapshotPending                                  = 1,
	EStatisticVersionStatus__pfenum_Snapshot                                         = 2,
	EStatisticVersionStatus__pfenum_ArchivalPending                                  = 3,
	EStatisticVersionStatus__pfenum_Archived                                         = 4
};

/// Enum /Script/PlayFab.EStatisticVersionArchivalStatus
/// Size: 0x01 (1 bytes)
enum class EStatisticVersionArchivalStatus : uint8_t
{
	EStatisticVersionArchivalStatus__pfenum_NotScheduled                             = 0,
	EStatisticVersionArchivalStatus__pfenum_Scheduled                                = 1,
	EStatisticVersionArchivalStatus__pfenum_Queued                                   = 2,
	EStatisticVersionArchivalStatus__pfenum_InProgress                               = 3,
	EStatisticVersionArchivalStatus__pfenum_Complete                                 = 4
};

/// Enum /Script/PlayFab.ESegmentPushNotificationDevicePlatform
/// Size: 0x01 (1 bytes)
enum class ESegmentPushNotificationDevicePlatform : uint8_t
{
	ESegmentPushNotificationDevicePlatform__pfenum_ApplePushNotificationService      = 0,
	ESegmentPushNotificationDevicePlatform__pfenum_GoogleCloudMessaging              = 1
};

/// Enum /Script/PlayFab.ESegmentLoginIdentityProvider
/// Size: 0x01 (1 bytes)
enum class ESegmentLoginIdentityProvider : uint8_t
{
	ESegmentLoginIdentityProvider__pfenum_Unknown                                    = 0,
	ESegmentLoginIdentityProvider__pfenum_PlayFab                                    = 1,
	ESegmentLoginIdentityProvider__pfenum_Custom                                     = 2,
	ESegmentLoginIdentityProvider__pfenum_GameCenter                                 = 3,
	ESegmentLoginIdentityProvider__pfenum_GooglePlay                                 = 4,
	ESegmentLoginIdentityProvider__pfenum_Steam                                      = 5,
	ESegmentLoginIdentityProvider__pfenum_XBoxLive                                   = 6,
	ESegmentLoginIdentityProvider__pfenum_PSN                                        = 7,
	ESegmentLoginIdentityProvider__pfenum_Kongregate                                 = 8,
	ESegmentLoginIdentityProvider__pfenum_Facebook                                   = 9,
	ESegmentLoginIdentityProvider__pfenum_IOSDevice                                  = 10,
	ESegmentLoginIdentityProvider__pfenum_AndroidDevice                              = 11,
	ESegmentLoginIdentityProvider__pfenum_Twitch                                     = 12,
	ESegmentLoginIdentityProvider__pfenum_WindowsHello                               = 13,
	ESegmentLoginIdentityProvider__pfenum_GameServer                                 = 14,
	ESegmentLoginIdentityProvider__pfenum_CustomServer                               = 15,
	ESegmentLoginIdentityProvider__pfenum_NintendoSwitch                             = 16,
	ESegmentLoginIdentityProvider__pfenum_FacebookInstantGames                       = 17,
	ESegmentLoginIdentityProvider__pfenum_OpenIdConnect                              = 18,
	ESegmentLoginIdentityProvider__pfenum_Apple                                      = 19,
	ESegmentLoginIdentityProvider__pfenum_NintendoSwitchAccount                      = 20
};

/// Enum /Script/PlayFab.ESegmentFilterComparison
/// Size: 0x01 (1 bytes)
enum class ESegmentFilterComparison : uint8_t
{
	ESegmentFilterComparison__pfenum_GreaterThan                                     = 0,
	ESegmentFilterComparison__pfenum_LessThan                                        = 1,
	ESegmentFilterComparison__pfenum_EqualTo                                         = 2,
	ESegmentFilterComparison__pfenum_NotEqualTo                                      = 3,
	ESegmentFilterComparison__pfenum_GreaterThanOrEqual                              = 4,
	ESegmentFilterComparison__pfenum_LessThanOrEqual                                 = 5,
	ESegmentFilterComparison__pfenum_Exists                                          = 6,
	ESegmentFilterComparison__pfenum_Contains                                        = 7,
	ESegmentFilterComparison__pfenum_NotContains                                     = 8
};

/// Enum /Script/PlayFab.ESegmentCurrency
/// Size: 0x01 (1 bytes)
enum class ESegmentCurrency : uint8_t
{
	ESegmentCurrency__pfenum_AED                                                     = 0,
	ESegmentCurrency__pfenum_AFN                                                     = 1,
	ESegmentCurrency__pfenum_ALL                                                     = 2,
	ESegmentCurrency__pfenum_AMD                                                     = 3,
	ESegmentCurrency__pfenum_ANG                                                     = 4,
	ESegmentCurrency__pfenum_AOA                                                     = 5,
	ESegmentCurrency__pfenum_ARS                                                     = 6,
	ESegmentCurrency__pfenum_AUD                                                     = 7,
	ESegmentCurrency__pfenum_AWG                                                     = 8,
	ESegmentCurrency__pfenum_AZN                                                     = 9,
	ESegmentCurrency__pfenum_BAM                                                     = 10,
	ESegmentCurrency__pfenum_BBD                                                     = 11,
	ESegmentCurrency__pfenum_BDT                                                     = 12,
	ESegmentCurrency__pfenum_BGN                                                     = 13,
	ESegmentCurrency__pfenum_BHD                                                     = 14,
	ESegmentCurrency__pfenum_BIF                                                     = 15,
	ESegmentCurrency__pfenum_BMD                                                     = 16,
	ESegmentCurrency__pfenum_BND                                                     = 17,
	ESegmentCurrency__pfenum_BOB                                                     = 18,
	ESegmentCurrency__pfenum_BRL                                                     = 19,
	ESegmentCurrency__pfenum_BSD                                                     = 20,
	ESegmentCurrency__pfenum_BTN                                                     = 21,
	ESegmentCurrency__pfenum_BWP                                                     = 22,
	ESegmentCurrency__pfenum_BYR                                                     = 23,
	ESegmentCurrency__pfenum_BZD                                                     = 24,
	ESegmentCurrency__pfenum_CAD                                                     = 25,
	ESegmentCurrency__pfenum_CDF                                                     = 26,
	ESegmentCurrency__pfenum_CHF                                                     = 27,
	ESegmentCurrency__pfenum_CLP                                                     = 28,
	ESegmentCurrency__pfenum_CNY                                                     = 29,
	ESegmentCurrency__pfenum_COP                                                     = 30,
	ESegmentCurrency__pfenum_CRC                                                     = 31,
	ESegmentCurrency__pfenum_CUC                                                     = 32,
	ESegmentCurrency__pfenum_CUP                                                     = 33,
	ESegmentCurrency__pfenum_CVE                                                     = 34,
	ESegmentCurrency__pfenum_CZK                                                     = 35,
	ESegmentCurrency__pfenum_DJF                                                     = 36,
	ESegmentCurrency__pfenum_DKK                                                     = 37,
	ESegmentCurrency__pfenum_DOP                                                     = 38,
	ESegmentCurrency__pfenum_DZD                                                     = 39,
	ESegmentCurrency__pfenum_EGP                                                     = 40,
	ESegmentCurrency__pfenum_ERN                                                     = 41,
	ESegmentCurrency__pfenum_ETB                                                     = 42,
	ESegmentCurrency__pfenum_EUR                                                     = 43,
	ESegmentCurrency__pfenum_FJD                                                     = 44,
	ESegmentCurrency__pfenum_FKP                                                     = 45,
	ESegmentCurrency__pfenum_GBP                                                     = 46,
	ESegmentCurrency__pfenum_GEL                                                     = 47,
	ESegmentCurrency__pfenum_GGP                                                     = 48,
	ESegmentCurrency__pfenum_GHS                                                     = 49,
	ESegmentCurrency__pfenum_GIP                                                     = 50,
	ESegmentCurrency__pfenum_GMD                                                     = 51,
	ESegmentCurrency__pfenum_GNF                                                     = 52,
	ESegmentCurrency__pfenum_GTQ                                                     = 53,
	ESegmentCurrency__pfenum_GYD                                                     = 54,
	ESegmentCurrency__pfenum_HKD                                                     = 55,
	ESegmentCurrency__pfenum_HNL                                                     = 56,
	ESegmentCurrency__pfenum_HRK                                                     = 57,
	ESegmentCurrency__pfenum_HTG                                                     = 58,
	ESegmentCurrency__pfenum_HUF                                                     = 59,
	ESegmentCurrency__pfenum_IDR                                                     = 60,
	ESegmentCurrency__pfenum_ILS                                                     = 61,
	ESegmentCurrency__pfenum_IMP                                                     = 62,
	ESegmentCurrency__pfenum_INR                                                     = 63,
	ESegmentCurrency__pfenum_IQD                                                     = 64,
	ESegmentCurrency__pfenum_IRR                                                     = 65,
	ESegmentCurrency__pfenum_ISK                                                     = 66,
	ESegmentCurrency__pfenum_JEP                                                     = 67,
	ESegmentCurrency__pfenum_JMD                                                     = 68,
	ESegmentCurrency__pfenum_JOD                                                     = 69,
	ESegmentCurrency__pfenum_JPY                                                     = 70,
	ESegmentCurrency__pfenum_KES                                                     = 71,
	ESegmentCurrency__pfenum_KGS                                                     = 72,
	ESegmentCurrency__pfenum_KHR                                                     = 73,
	ESegmentCurrency__pfenum_KMF                                                     = 74,
	ESegmentCurrency__pfenum_KPW                                                     = 75,
	ESegmentCurrency__pfenum_KRW                                                     = 76,
	ESegmentCurrency__pfenum_KWD                                                     = 77,
	ESegmentCurrency__pfenum_KYD                                                     = 78,
	ESegmentCurrency__pfenum_KZT                                                     = 79,
	ESegmentCurrency__pfenum_LAK                                                     = 80,
	ESegmentCurrency__pfenum_LBP                                                     = 81,
	ESegmentCurrency__pfenum_LKR                                                     = 82,
	ESegmentCurrency__pfenum_LRD                                                     = 83,
	ESegmentCurrency__pfenum_LSL                                                     = 84,
	ESegmentCurrency__pfenum_LYD                                                     = 85,
	ESegmentCurrency__pfenum_MAD                                                     = 86,
	ESegmentCurrency__pfenum_MDL                                                     = 87,
	ESegmentCurrency__pfenum_MGA                                                     = 88,
	ESegmentCurrency__pfenum_MKD                                                     = 89,
	ESegmentCurrency__pfenum_MMK                                                     = 90,
	ESegmentCurrency__pfenum_MNT                                                     = 91,
	ESegmentCurrency__pfenum_MOP                                                     = 92,
	ESegmentCurrency__pfenum_MRO                                                     = 93,
	ESegmentCurrency__pfenum_MUR                                                     = 94,
	ESegmentCurrency__pfenum_MVR                                                     = 95,
	ESegmentCurrency__pfenum_MWK                                                     = 96,
	ESegmentCurrency__pfenum_MXN                                                     = 97,
	ESegmentCurrency__pfenum_MYR                                                     = 98,
	ESegmentCurrency__pfenum_MZN                                                     = 99,
	ESegmentCurrency__pfenum_NAD                                                     = 100,
	ESegmentCurrency__pfenum_NGN                                                     = 101,
	ESegmentCurrency__pfenum_NIO                                                     = 102,
	ESegmentCurrency__pfenum_NOK                                                     = 103,
	ESegmentCurrency__pfenum_NPR                                                     = 104,
	ESegmentCurrency__pfenum_NZD                                                     = 105,
	ESegmentCurrency__pfenum_OMR                                                     = 106,
	ESegmentCurrency__pfenum_PAB                                                     = 107,
	ESegmentCurrency__pfenum_PEN                                                     = 108,
	ESegmentCurrency__pfenum_PGK                                                     = 109,
	ESegmentCurrency__pfenum_PHP                                                     = 110,
	ESegmentCurrency__pfenum_PKR                                                     = 111,
	ESegmentCurrency__pfenum_PLN                                                     = 112,
	ESegmentCurrency__pfenum_PYG                                                     = 113,
	ESegmentCurrency__pfenum_QAR                                                     = 114,
	ESegmentCurrency__pfenum_RON                                                     = 115,
	ESegmentCurrency__pfenum_RSD                                                     = 116,
	ESegmentCurrency__pfenum_RUB                                                     = 117,
	ESegmentCurrency__pfenum_RWF                                                     = 118,
	ESegmentCurrency__pfenum_SAR                                                     = 119,
	ESegmentCurrency__pfenum_SBD                                                     = 120,
	ESegmentCurrency__pfenum_SCR                                                     = 121,
	ESegmentCurrency__pfenum_SDG                                                     = 122,
	ESegmentCurrency__pfenum_SEK                                                     = 123,
	ESegmentCurrency__pfenum_SGD                                                     = 124,
	ESegmentCurrency__pfenum_SHP                                                     = 125,
	ESegmentCurrency__pfenum_SLL                                                     = 126,
	ESegmentCurrency__pfenum_SOS                                                     = 127,
	ESegmentCurrency__pfenum_SPL                                                     = 128,
	ESegmentCurrency__pfenum_SRD                                                     = 129,
	ESegmentCurrency__pfenum_STD                                                     = 130,
	ESegmentCurrency__pfenum_SVC                                                     = 131,
	ESegmentCurrency__pfenum_SYP                                                     = 132,
	ESegmentCurrency__pfenum_SZL                                                     = 133,
	ESegmentCurrency__pfenum_THB                                                     = 134,
	ESegmentCurrency__pfenum_TJS                                                     = 135,
	ESegmentCurrency__pfenum_TMT                                                     = 136,
	ESegmentCurrency__pfenum_TND                                                     = 137,
	ESegmentCurrency__pfenum_TOP                                                     = 138,
	ESegmentCurrency__pfenum_TRY                                                     = 139,
	ESegmentCurrency__pfenum_TTD                                                     = 140,
	ESegmentCurrency__pfenum_TVD                                                     = 141,
	ESegmentCurrency__pfenum_TWD                                                     = 142,
	ESegmentCurrency__pfenum_TZS                                                     = 143,
	ESegmentCurrency__pfenum_UAH                                                     = 144,
	ESegmentCurrency__pfenum_UGX                                                     = 145,
	ESegmentCurrency__pfenum_USD                                                     = 146,
	ESegmentCurrency__pfenum_UYU                                                     = 147,
	ESegmentCurrency__pfenum_UZS                                                     = 148,
	ESegmentCurrency__pfenum_VEF                                                     = 149,
	ESegmentCurrency__pfenum_VND                                                     = 150,
	ESegmentCurrency__pfenum_VUV                                                     = 151,
	ESegmentCurrency__pfenum_WST                                                     = 152,
	ESegmentCurrency__pfenum_XAF                                                     = 153,
	ESegmentCurrency__pfenum_XCD                                                     = 154,
	ESegmentCurrency__pfenum_XDR                                                     = 155,
	ESegmentCurrency__pfenum_XOF                                                     = 156,
	ESegmentCurrency__pfenum_XPF                                                     = 157,
	ESegmentCurrency__pfenum_YER                                                     = 158,
	ESegmentCurrency__pfenum_ZAR                                                     = 159,
	ESegmentCurrency__pfenum_ZMW                                                     = 160,
	ESegmentCurrency__pfenum_ZWD                                                     = 161
};

/// Enum /Script/PlayFab.ESegmentCountryCode
/// Size: 0x01 (1 bytes)
enum class ESegmentCountryCode : uint8_t
{
	ESegmentCountryCode__pfenum_AF                                                   = 0,
	ESegmentCountryCode__pfenum_AX                                                   = 1,
	ESegmentCountryCode__pfenum_AL                                                   = 2,
	ESegmentCountryCode__pfenum_DZ                                                   = 3,
	ESegmentCountryCode__pfenum_AS                                                   = 4,
	ESegmentCountryCode__pfenum_AD                                                   = 5,
	ESegmentCountryCode__pfenum_AO                                                   = 6,
	ESegmentCountryCode__pfenum_AI                                                   = 7,
	ESegmentCountryCode__pfenum_AQ                                                   = 8,
	ESegmentCountryCode__pfenum_AG                                                   = 9,
	ESegmentCountryCode__pfenum_AR                                                   = 10,
	ESegmentCountryCode__pfenum_AM                                                   = 11,
	ESegmentCountryCode__pfenum_AW                                                   = 12,
	ESegmentCountryCode__pfenum_AU                                                   = 13,
	ESegmentCountryCode__pfenum_AT                                                   = 14,
	ESegmentCountryCode__pfenum_AZ                                                   = 15,
	ESegmentCountryCode__pfenum_BS                                                   = 16,
	ESegmentCountryCode__pfenum_BH                                                   = 17,
	ESegmentCountryCode__pfenum_BD                                                   = 18,
	ESegmentCountryCode__pfenum_BB                                                   = 19,
	ESegmentCountryCode__pfenum_BY                                                   = 20,
	ESegmentCountryCode__pfenum_BE                                                   = 21,
	ESegmentCountryCode__pfenum_BZ                                                   = 22,
	ESegmentCountryCode__pfenum_BJ                                                   = 23,
	ESegmentCountryCode__pfenum_BM                                                   = 24,
	ESegmentCountryCode__pfenum_BT                                                   = 25,
	ESegmentCountryCode__pfenum_BO                                                   = 26,
	ESegmentCountryCode__pfenum_BQ                                                   = 27,
	ESegmentCountryCode__pfenum_BA                                                   = 28,
	ESegmentCountryCode__pfenum_BW                                                   = 29,
	ESegmentCountryCode__pfenum_BV                                                   = 30,
	ESegmentCountryCode__pfenum_BR                                                   = 31,
	ESegmentCountryCode__pfenum_IO                                                   = 32,
	ESegmentCountryCode__pfenum_BN                                                   = 33,
	ESegmentCountryCode__pfenum_BG                                                   = 34,
	ESegmentCountryCode__pfenum_BF                                                   = 35,
	ESegmentCountryCode__pfenum_BI                                                   = 36,
	ESegmentCountryCode__pfenum_KH                                                   = 37,
	ESegmentCountryCode__pfenum_CM                                                   = 38,
	ESegmentCountryCode__pfenum_CA                                                   = 39,
	ESegmentCountryCode__pfenum_CV                                                   = 40,
	ESegmentCountryCode__pfenum_KY                                                   = 41,
	ESegmentCountryCode__pfenum_CF                                                   = 42,
	ESegmentCountryCode__pfenum_TD                                                   = 43,
	ESegmentCountryCode__pfenum_CL                                                   = 44,
	ESegmentCountryCode__pfenum_CN                                                   = 45,
	ESegmentCountryCode__pfenum_CX                                                   = 46,
	ESegmentCountryCode__pfenum_CC                                                   = 47,
	ESegmentCountryCode__pfenum_CO                                                   = 48,
	ESegmentCountryCode__pfenum_KM                                                   = 49,
	ESegmentCountryCode__pfenum_CG                                                   = 50,
	ESegmentCountryCode__pfenum_CD                                                   = 51,
	ESegmentCountryCode__pfenum_CK                                                   = 52,
	ESegmentCountryCode__pfenum_CR                                                   = 53,
	ESegmentCountryCode__pfenum_CI                                                   = 54,
	ESegmentCountryCode__pfenum_HR                                                   = 55,
	ESegmentCountryCode__pfenum_CU                                                   = 56,
	ESegmentCountryCode__pfenum_CW                                                   = 57,
	ESegmentCountryCode__pfenum_CY                                                   = 58,
	ESegmentCountryCode__pfenum_CZ                                                   = 59,
	ESegmentCountryCode__pfenum_DK                                                   = 60,
	ESegmentCountryCode__pfenum_DJ                                                   = 61,
	ESegmentCountryCode__pfenum_DM                                                   = 62,
	ESegmentCountryCode__pfenum_DO                                                   = 63,
	ESegmentCountryCode__pfenum_EC                                                   = 64,
	ESegmentCountryCode__pfenum_EG                                                   = 65,
	ESegmentCountryCode__pfenum_SV                                                   = 66,
	ESegmentCountryCode__pfenum_GQ                                                   = 67,
	ESegmentCountryCode__pfenum_ER                                                   = 68,
	ESegmentCountryCode__pfenum_EE                                                   = 69,
	ESegmentCountryCode__pfenum_ET                                                   = 70,
	ESegmentCountryCode__pfenum_FK                                                   = 71,
	ESegmentCountryCode__pfenum_FO                                                   = 72,
	ESegmentCountryCode__pfenum_FJ                                                   = 73,
	ESegmentCountryCode__pfenum_FI                                                   = 74,
	ESegmentCountryCode__pfenum_FR                                                   = 75,
	ESegmentCountryCode__pfenum_GF                                                   = 76,
	ESegmentCountryCode__pfenum_PF                                                   = 77,
	ESegmentCountryCode__pfenum_TF                                                   = 78,
	ESegmentCountryCode__pfenum_GA                                                   = 79,
	ESegmentCountryCode__pfenum_GM                                                   = 80,
	ESegmentCountryCode__pfenum_GE                                                   = 81,
	ESegmentCountryCode__pfenum_DE                                                   = 82,
	ESegmentCountryCode__pfenum_GH                                                   = 83,
	ESegmentCountryCode__pfenum_GI                                                   = 84,
	ESegmentCountryCode__pfenum_GR                                                   = 85,
	ESegmentCountryCode__pfenum_GL                                                   = 86,
	ESegmentCountryCode__pfenum_GD                                                   = 87,
	ESegmentCountryCode__pfenum_GP                                                   = 88,
	ESegmentCountryCode__pfenum_GU                                                   = 89,
	ESegmentCountryCode__pfenum_GT                                                   = 90,
	ESegmentCountryCode__pfenum_GG                                                   = 91,
	ESegmentCountryCode__pfenum_GN                                                   = 92,
	ESegmentCountryCode__pfenum_GW                                                   = 93,
	ESegmentCountryCode__pfenum_GY                                                   = 94,
	ESegmentCountryCode__pfenum_HT                                                   = 95,
	ESegmentCountryCode__pfenum_HM                                                   = 96,
	ESegmentCountryCode__pfenum_VA                                                   = 97,
	ESegmentCountryCode__pfenum_HN                                                   = 98,
	ESegmentCountryCode__pfenum_HK                                                   = 99,
	ESegmentCountryCode__pfenum_HU                                                   = 100,
	ESegmentCountryCode__pfenum_IS                                                   = 101,
	ESegmentCountryCode__pfenum_IN                                                   = 102,
	ESegmentCountryCode__pfenum_ID                                                   = 103,
	ESegmentCountryCode__pfenum_IR                                                   = 104,
	ESegmentCountryCode__pfenum_IQ                                                   = 105,
	ESegmentCountryCode__pfenum_IE                                                   = 106,
	ESegmentCountryCode__pfenum_IM                                                   = 107,
	ESegmentCountryCode__pfenum_IL                                                   = 108,
	ESegmentCountryCode__pfenum_IT                                                   = 109,
	ESegmentCountryCode__pfenum_JM                                                   = 110,
	ESegmentCountryCode__pfenum_JP                                                   = 111,
	ESegmentCountryCode__pfenum_JE                                                   = 112,
	ESegmentCountryCode__pfenum_JO                                                   = 113,
	ESegmentCountryCode__pfenum_KZ                                                   = 114,
	ESegmentCountryCode__pfenum_KE                                                   = 115,
	ESegmentCountryCode__pfenum_KI                                                   = 116,
	ESegmentCountryCode__pfenum_KP                                                   = 117,
	ESegmentCountryCode__pfenum_KR                                                   = 118,
	ESegmentCountryCode__pfenum_KW                                                   = 119,
	ESegmentCountryCode__pfenum_KG                                                   = 120,
	ESegmentCountryCode__pfenum_LA                                                   = 121,
	ESegmentCountryCode__pfenum_LV                                                   = 122,
	ESegmentCountryCode__pfenum_LB                                                   = 123,
	ESegmentCountryCode__pfenum_LS                                                   = 124,
	ESegmentCountryCode__pfenum_LR                                                   = 125,
	ESegmentCountryCode__pfenum_LY                                                   = 126,
	ESegmentCountryCode__pfenum_LI                                                   = 127,
	ESegmentCountryCode__pfenum_LT                                                   = 128,
	ESegmentCountryCode__pfenum_LU                                                   = 129,
	ESegmentCountryCode__pfenum_MO                                                   = 130,
	ESegmentCountryCode__pfenum_MK                                                   = 131,
	ESegmentCountryCode__pfenum_MG                                                   = 132,
	ESegmentCountryCode__pfenum_MW                                                   = 133,
	ESegmentCountryCode__pfenum_MY                                                   = 134,
	ESegmentCountryCode__pfenum_MV                                                   = 135,
	ESegmentCountryCode__pfenum_ML                                                   = 136,
	ESegmentCountryCode__pfenum_MT                                                   = 137,
	ESegmentCountryCode__pfenum_MH                                                   = 138,
	ESegmentCountryCode__pfenum_MQ                                                   = 139,
	ESegmentCountryCode__pfenum_MR                                                   = 140,
	ESegmentCountryCode__pfenum_MU                                                   = 141,
	ESegmentCountryCode__pfenum_YT                                                   = 142,
	ESegmentCountryCode__pfenum_MX                                                   = 143,
	ESegmentCountryCode__pfenum_FM                                                   = 144,
	ESegmentCountryCode__pfenum_MD                                                   = 145,
	ESegmentCountryCode__pfenum_MC                                                   = 146,
	ESegmentCountryCode__pfenum_MN                                                   = 147,
	ESegmentCountryCode__pfenum_ME                                                   = 148,
	ESegmentCountryCode__pfenum_MS                                                   = 149,
	ESegmentCountryCode__pfenum_MA                                                   = 150,
	ESegmentCountryCode__pfenum_MZ                                                   = 151,
	ESegmentCountryCode__pfenum_MM                                                   = 152,
	ESegmentCountryCode__pfenum_NA                                                   = 153,
	ESegmentCountryCode__pfenum_NR                                                   = 154,
	ESegmentCountryCode__pfenum_NP                                                   = 155,
	ESegmentCountryCode__pfenum_NL                                                   = 156,
	ESegmentCountryCode__pfenum_NC                                                   = 157,
	ESegmentCountryCode__pfenum_NZ                                                   = 158,
	ESegmentCountryCode__pfenum_NI                                                   = 159,
	ESegmentCountryCode__pfenum_NE                                                   = 160,
	ESegmentCountryCode__pfenum_NG                                                   = 161,
	ESegmentCountryCode__pfenum_NU                                                   = 162,
	ESegmentCountryCode__pfenum_NF                                                   = 163,
	ESegmentCountryCode__pfenum_MP                                                   = 164,
	ESegmentCountryCode__pfenum_NO                                                   = 165,
	ESegmentCountryCode__pfenum_OM                                                   = 166,
	ESegmentCountryCode__pfenum_PK                                                   = 167,
	ESegmentCountryCode__pfenum_PW                                                   = 168,
	ESegmentCountryCode__pfenum_PS                                                   = 169,
	ESegmentCountryCode__pfenum_PA                                                   = 170,
	ESegmentCountryCode__pfenum_PG                                                   = 171,
	ESegmentCountryCode__pfenum_PY                                                   = 172,
	ESegmentCountryCode__pfenum_PE                                                   = 173,
	ESegmentCountryCode__pfenum_PH                                                   = 174,
	ESegmentCountryCode__pfenum_PN                                                   = 175,
	ESegmentCountryCode__pfenum_PL                                                   = 176,
	ESegmentCountryCode__pfenum_PT                                                   = 177,
	ESegmentCountryCode__pfenum_PR                                                   = 178,
	ESegmentCountryCode__pfenum_QA                                                   = 179,
	ESegmentCountryCode__pfenum_RE                                                   = 180,
	ESegmentCountryCode__pfenum_RO                                                   = 181,
	ESegmentCountryCode__pfenum_RU                                                   = 182,
	ESegmentCountryCode__pfenum_RW                                                   = 183,
	ESegmentCountryCode__pfenum_BL                                                   = 184,
	ESegmentCountryCode__pfenum_SH                                                   = 185,
	ESegmentCountryCode__pfenum_KN                                                   = 186,
	ESegmentCountryCode__pfenum_LC                                                   = 187,
	ESegmentCountryCode__pfenum_MF                                                   = 188,
	ESegmentCountryCode__pfenum_PM                                                   = 189,
	ESegmentCountryCode__pfenum_VC                                                   = 190,
	ESegmentCountryCode__pfenum_WS                                                   = 191,
	ESegmentCountryCode__pfenum_SM                                                   = 192,
	ESegmentCountryCode__pfenum_ST                                                   = 193,
	ESegmentCountryCode__pfenum_SA                                                   = 194,
	ESegmentCountryCode__pfenum_SN                                                   = 195,
	ESegmentCountryCode__pfenum_RS                                                   = 196,
	ESegmentCountryCode__pfenum_SC                                                   = 197,
	ESegmentCountryCode__pfenum_SL                                                   = 198,
	ESegmentCountryCode__pfenum_SG                                                   = 199,
	ESegmentCountryCode__pfenum_SX                                                   = 200,
	ESegmentCountryCode__pfenum_SK                                                   = 201,
	ESegmentCountryCode__pfenum_SI                                                   = 202,
	ESegmentCountryCode__pfenum_SB                                                   = 203,
	ESegmentCountryCode__pfenum_SO                                                   = 204,
	ESegmentCountryCode__pfenum_ZA                                                   = 205,
	ESegmentCountryCode__pfenum_GS                                                   = 206,
	ESegmentCountryCode__pfenum_SS                                                   = 207,
	ESegmentCountryCode__pfenum_ES                                                   = 208,
	ESegmentCountryCode__pfenum_LK                                                   = 209,
	ESegmentCountryCode__pfenum_SD                                                   = 210,
	ESegmentCountryCode__pfenum_SR                                                   = 211,
	ESegmentCountryCode__pfenum_SJ                                                   = 212,
	ESegmentCountryCode__pfenum_SZ                                                   = 213,
	ESegmentCountryCode__pfenum_SE                                                   = 214,
	ESegmentCountryCode__pfenum_CH                                                   = 215,
	ESegmentCountryCode__pfenum_SY                                                   = 216,
	ESegmentCountryCode__pfenum_TW                                                   = 217,
	ESegmentCountryCode__pfenum_TJ                                                   = 218,
	ESegmentCountryCode__pfenum_TZ                                                   = 219,
	ESegmentCountryCode__pfenum_TH                                                   = 220,
	ESegmentCountryCode__pfenum_TL                                                   = 221,
	ESegmentCountryCode__pfenum_TG                                                   = 222,
	ESegmentCountryCode__pfenum_TK                                                   = 223,
	ESegmentCountryCode__pfenum_TO                                                   = 224,
	ESegmentCountryCode__pfenum_TT                                                   = 225,
	ESegmentCountryCode__pfenum_TN                                                   = 226,
	ESegmentCountryCode__pfenum_TR                                                   = 227,
	ESegmentCountryCode__pfenum_TM                                                   = 228,
	ESegmentCountryCode__pfenum_TC                                                   = 229,
	ESegmentCountryCode__pfenum_TV                                                   = 230,
	ESegmentCountryCode__pfenum_UG                                                   = 231,
	ESegmentCountryCode__pfenum_UA                                                   = 232,
	ESegmentCountryCode__pfenum_AE                                                   = 233,
	ESegmentCountryCode__pfenum_GB                                                   = 234,
	ESegmentCountryCode__pfenum_US                                                   = 235,
	ESegmentCountryCode__pfenum_UM                                                   = 236,
	ESegmentCountryCode__pfenum_UY                                                   = 237,
	ESegmentCountryCode__pfenum_UZ                                                   = 238,
	ESegmentCountryCode__pfenum_VU                                                   = 239,
	ESegmentCountryCode__pfenum_VE                                                   = 240,
	ESegmentCountryCode__pfenum_VN                                                   = 241,
	ESegmentCountryCode__pfenum_VG                                                   = 242,
	ESegmentCountryCode__pfenum_VI                                                   = 243,
	ESegmentCountryCode__pfenum_WF                                                   = 244,
	ESegmentCountryCode__pfenum_EH                                                   = 245,
	ESegmentCountryCode__pfenum_YE                                                   = 246,
	ESegmentCountryCode__pfenum_ZM                                                   = 247,
	ESegmentCountryCode__pfenum_ZW                                                   = 248
};

/// Enum /Script/PlayFab.EResultTableNodeType
/// Size: 0x01 (1 bytes)
enum class EResultTableNodeType : uint8_t
{
	EResultTableNodeType__pfenum_ItemId                                              = 0,
	EResultTableNodeType__pfenum_TableId                                             = 1
};

/// Enum /Script/PlayFab.EPushNotificationPlatform
/// Size: 0x01 (1 bytes)
enum class EPushNotificationPlatform : uint8_t
{
	EPushNotificationPlatform__pfenum_ApplePushNotificationService                   = 0,
	EPushNotificationPlatform__pfenum_GoogleCloudMessaging                           = 1
};

/// Enum /Script/PlayFab.EEmailVerificationStatus
/// Size: 0x01 (1 bytes)
enum class EEmailVerificationStatus : uint8_t
{
	EEmailVerificationStatus__pfenum_Unverified                                      = 0,
	EEmailVerificationStatus__pfenum_Pending                                         = 1,
	EEmailVerificationStatus__pfenum_Confirmed                                       = 2
};

/// Enum /Script/PlayFab.EEffectType
/// Size: 0x01 (1 bytes)
enum class EEffectType : uint8_t
{
	EEffectType__pfenum_Allow                                                        = 0,
	EEffectType__pfenum_Deny                                                         = 1
};

/// Enum /Script/PlayFab.ECurrency
/// Size: 0x01 (1 bytes)
enum class ECurrency : uint8_t
{
	ECurrency__pfenum_AED                                                            = 0,
	ECurrency__pfenum_AFN                                                            = 1,
	ECurrency__pfenum_ALL                                                            = 2,
	ECurrency__pfenum_AMD                                                            = 3,
	ECurrency__pfenum_ANG                                                            = 4,
	ECurrency__pfenum_AOA                                                            = 5,
	ECurrency__pfenum_ARS                                                            = 6,
	ECurrency__pfenum_AUD                                                            = 7,
	ECurrency__pfenum_AWG                                                            = 8,
	ECurrency__pfenum_AZN                                                            = 9,
	ECurrency__pfenum_BAM                                                            = 10,
	ECurrency__pfenum_BBD                                                            = 11,
	ECurrency__pfenum_BDT                                                            = 12,
	ECurrency__pfenum_BGN                                                            = 13,
	ECurrency__pfenum_BHD                                                            = 14,
	ECurrency__pfenum_BIF                                                            = 15,
	ECurrency__pfenum_BMD                                                            = 16,
	ECurrency__pfenum_BND                                                            = 17,
	ECurrency__pfenum_BOB                                                            = 18,
	ECurrency__pfenum_BRL                                                            = 19,
	ECurrency__pfenum_BSD                                                            = 20,
	ECurrency__pfenum_BTN                                                            = 21,
	ECurrency__pfenum_BWP                                                            = 22,
	ECurrency__pfenum_BYR                                                            = 23,
	ECurrency__pfenum_BZD                                                            = 24,
	ECurrency__pfenum_CAD                                                            = 25,
	ECurrency__pfenum_CDF                                                            = 26,
	ECurrency__pfenum_CHF                                                            = 27,
	ECurrency__pfenum_CLP                                                            = 28,
	ECurrency__pfenum_CNY                                                            = 29,
	ECurrency__pfenum_COP                                                            = 30,
	ECurrency__pfenum_CRC                                                            = 31,
	ECurrency__pfenum_CUC                                                            = 32,
	ECurrency__pfenum_CUP                                                            = 33,
	ECurrency__pfenum_CVE                                                            = 34,
	ECurrency__pfenum_CZK                                                            = 35,
	ECurrency__pfenum_DJF                                                            = 36,
	ECurrency__pfenum_DKK                                                            = 37,
	ECurrency__pfenum_DOP                                                            = 38,
	ECurrency__pfenum_DZD                                                            = 39,
	ECurrency__pfenum_EGP                                                            = 40,
	ECurrency__pfenum_ERN                                                            = 41,
	ECurrency__pfenum_ETB                                                            = 42,
	ECurrency__pfenum_EUR                                                            = 43,
	ECurrency__pfenum_FJD                                                            = 44,
	ECurrency__pfenum_FKP                                                            = 45,
	ECurrency__pfenum_GBP                                                            = 46,
	ECurrency__pfenum_GEL                                                            = 47,
	ECurrency__pfenum_GGP                                                            = 48,
	ECurrency__pfenum_GHS                                                            = 49,
	ECurrency__pfenum_GIP                                                            = 50,
	ECurrency__pfenum_GMD                                                            = 51,
	ECurrency__pfenum_GNF                                                            = 52,
	ECurrency__pfenum_GTQ                                                            = 53,
	ECurrency__pfenum_GYD                                                            = 54,
	ECurrency__pfenum_HKD                                                            = 55,
	ECurrency__pfenum_HNL                                                            = 56,
	ECurrency__pfenum_HRK                                                            = 57,
	ECurrency__pfenum_HTG                                                            = 58,
	ECurrency__pfenum_HUF                                                            = 59,
	ECurrency__pfenum_IDR                                                            = 60,
	ECurrency__pfenum_ILS                                                            = 61,
	ECurrency__pfenum_IMP                                                            = 62,
	ECurrency__pfenum_INR                                                            = 63,
	ECurrency__pfenum_IQD                                                            = 64,
	ECurrency__pfenum_IRR                                                            = 65,
	ECurrency__pfenum_ISK                                                            = 66,
	ECurrency__pfenum_JEP                                                            = 67,
	ECurrency__pfenum_JMD                                                            = 68,
	ECurrency__pfenum_JOD                                                            = 69,
	ECurrency__pfenum_JPY                                                            = 70,
	ECurrency__pfenum_KES                                                            = 71,
	ECurrency__pfenum_KGS                                                            = 72,
	ECurrency__pfenum_KHR                                                            = 73,
	ECurrency__pfenum_KMF                                                            = 74,
	ECurrency__pfenum_KPW                                                            = 75,
	ECurrency__pfenum_KRW                                                            = 76,
	ECurrency__pfenum_KWD                                                            = 77,
	ECurrency__pfenum_KYD                                                            = 78,
	ECurrency__pfenum_KZT                                                            = 79,
	ECurrency__pfenum_LAK                                                            = 80,
	ECurrency__pfenum_LBP                                                            = 81,
	ECurrency__pfenum_LKR                                                            = 82,
	ECurrency__pfenum_LRD                                                            = 83,
	ECurrency__pfenum_LSL                                                            = 84,
	ECurrency__pfenum_LYD                                                            = 85,
	ECurrency__pfenum_MAD                                                            = 86,
	ECurrency__pfenum_MDL                                                            = 87,
	ECurrency__pfenum_MGA                                                            = 88,
	ECurrency__pfenum_MKD                                                            = 89,
	ECurrency__pfenum_MMK                                                            = 90,
	ECurrency__pfenum_MNT                                                            = 91,
	ECurrency__pfenum_MOP                                                            = 92,
	ECurrency__pfenum_MRO                                                            = 93,
	ECurrency__pfenum_MUR                                                            = 94,
	ECurrency__pfenum_MVR                                                            = 95,
	ECurrency__pfenum_MWK                                                            = 96,
	ECurrency__pfenum_MXN                                                            = 97,
	ECurrency__pfenum_MYR                                                            = 98,
	ECurrency__pfenum_MZN                                                            = 99,
	ECurrency__pfenum_NAD                                                            = 100,
	ECurrency__pfenum_NGN                                                            = 101,
	ECurrency__pfenum_NIO                                                            = 102,
	ECurrency__pfenum_NOK                                                            = 103,
	ECurrency__pfenum_NPR                                                            = 104,
	ECurrency__pfenum_NZD                                                            = 105,
	ECurrency__pfenum_OMR                                                            = 106,
	ECurrency__pfenum_PAB                                                            = 107,
	ECurrency__pfenum_PEN                                                            = 108,
	ECurrency__pfenum_PGK                                                            = 109,
	ECurrency__pfenum_PHP                                                            = 110,
	ECurrency__pfenum_PKR                                                            = 111,
	ECurrency__pfenum_PLN                                                            = 112,
	ECurrency__pfenum_PYG                                                            = 113,
	ECurrency__pfenum_QAR                                                            = 114,
	ECurrency__pfenum_RON                                                            = 115,
	ECurrency__pfenum_RSD                                                            = 116,
	ECurrency__pfenum_RUB                                                            = 117,
	ECurrency__pfenum_RWF                                                            = 118,
	ECurrency__pfenum_SAR                                                            = 119,
	ECurrency__pfenum_SBD                                                            = 120,
	ECurrency__pfenum_SCR                                                            = 121,
	ECurrency__pfenum_SDG                                                            = 122,
	ECurrency__pfenum_SEK                                                            = 123,
	ECurrency__pfenum_SGD                                                            = 124,
	ECurrency__pfenum_SHP                                                            = 125,
	ECurrency__pfenum_SLL                                                            = 126,
	ECurrency__pfenum_SOS                                                            = 127,
	ECurrency__pfenum_SPL                                                            = 128,
	ECurrency__pfenum_SRD                                                            = 129,
	ECurrency__pfenum_STD                                                            = 130,
	ECurrency__pfenum_SVC                                                            = 131,
	ECurrency__pfenum_SYP                                                            = 132,
	ECurrency__pfenum_SZL                                                            = 133,
	ECurrency__pfenum_THB                                                            = 134,
	ECurrency__pfenum_TJS                                                            = 135,
	ECurrency__pfenum_TMT                                                            = 136,
	ECurrency__pfenum_TND                                                            = 137,
	ECurrency__pfenum_TOP                                                            = 138,
	ECurrency__pfenum_TRY                                                            = 139,
	ECurrency__pfenum_TTD                                                            = 140,
	ECurrency__pfenum_TVD                                                            = 141,
	ECurrency__pfenum_TWD                                                            = 142,
	ECurrency__pfenum_TZS                                                            = 143,
	ECurrency__pfenum_UAH                                                            = 144,
	ECurrency__pfenum_UGX                                                            = 145,
	ECurrency__pfenum_USD                                                            = 146,
	ECurrency__pfenum_UYU                                                            = 147,
	ECurrency__pfenum_UZS                                                            = 148,
	ECurrency__pfenum_VEF                                                            = 149,
	ECurrency__pfenum_VND                                                            = 150,
	ECurrency__pfenum_VUV                                                            = 151,
	ECurrency__pfenum_WST                                                            = 152,
	ECurrency__pfenum_XAF                                                            = 153,
	ECurrency__pfenum_XCD                                                            = 154,
	ECurrency__pfenum_XDR                                                            = 155,
	ECurrency__pfenum_XOF                                                            = 156,
	ECurrency__pfenum_XPF                                                            = 157,
	ECurrency__pfenum_YER                                                            = 158,
	ECurrency__pfenum_ZAR                                                            = 159,
	ECurrency__pfenum_ZMW                                                            = 160,
	ECurrency__pfenum_ZWD                                                            = 161
};

/// Enum /Script/PlayFab.ECountryCode
/// Size: 0x01 (1 bytes)
enum class ECountryCode : uint8_t
{
	ECountryCode__pfenum_AF                                                          = 0,
	ECountryCode__pfenum_AX                                                          = 1,
	ECountryCode__pfenum_AL                                                          = 2,
	ECountryCode__pfenum_DZ                                                          = 3,
	ECountryCode__pfenum_AS                                                          = 4,
	ECountryCode__pfenum_AD                                                          = 5,
	ECountryCode__pfenum_AO                                                          = 6,
	ECountryCode__pfenum_AI                                                          = 7,
	ECountryCode__pfenum_AQ                                                          = 8,
	ECountryCode__pfenum_AG                                                          = 9,
	ECountryCode__pfenum_AR                                                          = 10,
	ECountryCode__pfenum_AM                                                          = 11,
	ECountryCode__pfenum_AW                                                          = 12,
	ECountryCode__pfenum_AU                                                          = 13,
	ECountryCode__pfenum_AT                                                          = 14,
	ECountryCode__pfenum_AZ                                                          = 15,
	ECountryCode__pfenum_BS                                                          = 16,
	ECountryCode__pfenum_BH                                                          = 17,
	ECountryCode__pfenum_BD                                                          = 18,
	ECountryCode__pfenum_BB                                                          = 19,
	ECountryCode__pfenum_BY                                                          = 20,
	ECountryCode__pfenum_BE                                                          = 21,
	ECountryCode__pfenum_BZ                                                          = 22,
	ECountryCode__pfenum_BJ                                                          = 23,
	ECountryCode__pfenum_BM                                                          = 24,
	ECountryCode__pfenum_BT                                                          = 25,
	ECountryCode__pfenum_BO                                                          = 26,
	ECountryCode__pfenum_BQ                                                          = 27,
	ECountryCode__pfenum_BA                                                          = 28,
	ECountryCode__pfenum_BW                                                          = 29,
	ECountryCode__pfenum_BV                                                          = 30,
	ECountryCode__pfenum_BR                                                          = 31,
	ECountryCode__pfenum_IO                                                          = 32,
	ECountryCode__pfenum_BN                                                          = 33,
	ECountryCode__pfenum_BG                                                          = 34,
	ECountryCode__pfenum_BF                                                          = 35,
	ECountryCode__pfenum_BI                                                          = 36,
	ECountryCode__pfenum_KH                                                          = 37,
	ECountryCode__pfenum_CM                                                          = 38,
	ECountryCode__pfenum_CA                                                          = 39,
	ECountryCode__pfenum_CV                                                          = 40,
	ECountryCode__pfenum_KY                                                          = 41,
	ECountryCode__pfenum_CF                                                          = 42,
	ECountryCode__pfenum_TD                                                          = 43,
	ECountryCode__pfenum_CL                                                          = 44,
	ECountryCode__pfenum_CN                                                          = 45,
	ECountryCode__pfenum_CX                                                          = 46,
	ECountryCode__pfenum_CC                                                          = 47,
	ECountryCode__pfenum_CO                                                          = 48,
	ECountryCode__pfenum_KM                                                          = 49,
	ECountryCode__pfenum_CG                                                          = 50,
	ECountryCode__pfenum_CD                                                          = 51,
	ECountryCode__pfenum_CK                                                          = 52,
	ECountryCode__pfenum_CR                                                          = 53,
	ECountryCode__pfenum_CI                                                          = 54,
	ECountryCode__pfenum_HR                                                          = 55,
	ECountryCode__pfenum_CU                                                          = 56,
	ECountryCode__pfenum_CW                                                          = 57,
	ECountryCode__pfenum_CY                                                          = 58,
	ECountryCode__pfenum_CZ                                                          = 59,
	ECountryCode__pfenum_DK                                                          = 60,
	ECountryCode__pfenum_DJ                                                          = 61,
	ECountryCode__pfenum_DM                                                          = 62,
	ECountryCode__pfenum_DO                                                          = 63,
	ECountryCode__pfenum_EC                                                          = 64,
	ECountryCode__pfenum_EG                                                          = 65,
	ECountryCode__pfenum_SV                                                          = 66,
	ECountryCode__pfenum_GQ                                                          = 67,
	ECountryCode__pfenum_ER                                                          = 68,
	ECountryCode__pfenum_EE                                                          = 69,
	ECountryCode__pfenum_ET                                                          = 70,
	ECountryCode__pfenum_FK                                                          = 71,
	ECountryCode__pfenum_FO                                                          = 72,
	ECountryCode__pfenum_FJ                                                          = 73,
	ECountryCode__pfenum_FI                                                          = 74,
	ECountryCode__pfenum_FR                                                          = 75,
	ECountryCode__pfenum_GF                                                          = 76,
	ECountryCode__pfenum_PF                                                          = 77,
	ECountryCode__pfenum_TF                                                          = 78,
	ECountryCode__pfenum_GA                                                          = 79,
	ECountryCode__pfenum_GM                                                          = 80,
	ECountryCode__pfenum_GE                                                          = 81,
	ECountryCode__pfenum_DE                                                          = 82,
	ECountryCode__pfenum_GH                                                          = 83,
	ECountryCode__pfenum_GI                                                          = 84,
	ECountryCode__pfenum_GR                                                          = 85,
	ECountryCode__pfenum_GL                                                          = 86,
	ECountryCode__pfenum_GD                                                          = 87,
	ECountryCode__pfenum_GP                                                          = 88,
	ECountryCode__pfenum_GU                                                          = 89,
	ECountryCode__pfenum_GT                                                          = 90,
	ECountryCode__pfenum_GG                                                          = 91,
	ECountryCode__pfenum_GN                                                          = 92,
	ECountryCode__pfenum_GW                                                          = 93,
	ECountryCode__pfenum_GY                                                          = 94,
	ECountryCode__pfenum_HT                                                          = 95,
	ECountryCode__pfenum_HM                                                          = 96,
	ECountryCode__pfenum_VA                                                          = 97,
	ECountryCode__pfenum_HN                                                          = 98,
	ECountryCode__pfenum_HK                                                          = 99,
	ECountryCode__pfenum_HU                                                          = 100,
	ECountryCode__pfenum_IS                                                          = 101,
	ECountryCode__pfenum_IN                                                          = 102,
	ECountryCode__pfenum_ID                                                          = 103,
	ECountryCode__pfenum_IR                                                          = 104,
	ECountryCode__pfenum_IQ                                                          = 105,
	ECountryCode__pfenum_IE                                                          = 106,
	ECountryCode__pfenum_IM                                                          = 107,
	ECountryCode__pfenum_IL                                                          = 108,
	ECountryCode__pfenum_IT                                                          = 109,
	ECountryCode__pfenum_JM                                                          = 110,
	ECountryCode__pfenum_JP                                                          = 111,
	ECountryCode__pfenum_JE                                                          = 112,
	ECountryCode__pfenum_JO                                                          = 113,
	ECountryCode__pfenum_KZ                                                          = 114,
	ECountryCode__pfenum_KE                                                          = 115,
	ECountryCode__pfenum_KI                                                          = 116,
	ECountryCode__pfenum_KP                                                          = 117,
	ECountryCode__pfenum_KR                                                          = 118,
	ECountryCode__pfenum_KW                                                          = 119,
	ECountryCode__pfenum_KG                                                          = 120,
	ECountryCode__pfenum_LA                                                          = 121,
	ECountryCode__pfenum_LV                                                          = 122,
	ECountryCode__pfenum_LB                                                          = 123,
	ECountryCode__pfenum_LS                                                          = 124,
	ECountryCode__pfenum_LR                                                          = 125,
	ECountryCode__pfenum_LY                                                          = 126,
	ECountryCode__pfenum_LI                                                          = 127,
	ECountryCode__pfenum_LT                                                          = 128,
	ECountryCode__pfenum_LU                                                          = 129,
	ECountryCode__pfenum_MO                                                          = 130,
	ECountryCode__pfenum_MK                                                          = 131,
	ECountryCode__pfenum_MG                                                          = 132,
	ECountryCode__pfenum_MW                                                          = 133,
	ECountryCode__pfenum_MY                                                          = 134,
	ECountryCode__pfenum_MV                                                          = 135,
	ECountryCode__pfenum_ML                                                          = 136,
	ECountryCode__pfenum_MT                                                          = 137,
	ECountryCode__pfenum_MH                                                          = 138,
	ECountryCode__pfenum_MQ                                                          = 139,
	ECountryCode__pfenum_MR                                                          = 140,
	ECountryCode__pfenum_MU                                                          = 141,
	ECountryCode__pfenum_YT                                                          = 142,
	ECountryCode__pfenum_MX                                                          = 143,
	ECountryCode__pfenum_FM                                                          = 144,
	ECountryCode__pfenum_MD                                                          = 145,
	ECountryCode__pfenum_MC                                                          = 146,
	ECountryCode__pfenum_MN                                                          = 147,
	ECountryCode__pfenum_ME                                                          = 148,
	ECountryCode__pfenum_MS                                                          = 149,
	ECountryCode__pfenum_MA                                                          = 150,
	ECountryCode__pfenum_MZ                                                          = 151,
	ECountryCode__pfenum_MM                                                          = 152,
	ECountryCode__pfenum_NA                                                          = 153,
	ECountryCode__pfenum_NR                                                          = 154,
	ECountryCode__pfenum_NP                                                          = 155,
	ECountryCode__pfenum_NL                                                          = 156,
	ECountryCode__pfenum_NC                                                          = 157,
	ECountryCode__pfenum_NZ                                                          = 158,
	ECountryCode__pfenum_NI                                                          = 159,
	ECountryCode__pfenum_NE                                                          = 160,
	ECountryCode__pfenum_NG                                                          = 161,
	ECountryCode__pfenum_NU                                                          = 162,
	ECountryCode__pfenum_NF                                                          = 163,
	ECountryCode__pfenum_MP                                                          = 164,
	ECountryCode__pfenum_NO                                                          = 165,
	ECountryCode__pfenum_OM                                                          = 166,
	ECountryCode__pfenum_PK                                                          = 167,
	ECountryCode__pfenum_PW                                                          = 168,
	ECountryCode__pfenum_PS                                                          = 169,
	ECountryCode__pfenum_PA                                                          = 170,
	ECountryCode__pfenum_PG                                                          = 171,
	ECountryCode__pfenum_PY                                                          = 172,
	ECountryCode__pfenum_PE                                                          = 173,
	ECountryCode__pfenum_PH                                                          = 174,
	ECountryCode__pfenum_PN                                                          = 175,
	ECountryCode__pfenum_PL                                                          = 176,
	ECountryCode__pfenum_PT                                                          = 177,
	ECountryCode__pfenum_PR                                                          = 178,
	ECountryCode__pfenum_QA                                                          = 179,
	ECountryCode__pfenum_RE                                                          = 180,
	ECountryCode__pfenum_RO                                                          = 181,
	ECountryCode__pfenum_RU                                                          = 182,
	ECountryCode__pfenum_RW                                                          = 183,
	ECountryCode__pfenum_BL                                                          = 184,
	ECountryCode__pfenum_SH                                                          = 185,
	ECountryCode__pfenum_KN                                                          = 186,
	ECountryCode__pfenum_LC                                                          = 187,
	ECountryCode__pfenum_MF                                                          = 188,
	ECountryCode__pfenum_PM                                                          = 189,
	ECountryCode__pfenum_VC                                                          = 190,
	ECountryCode__pfenum_WS                                                          = 191,
	ECountryCode__pfenum_SM                                                          = 192,
	ECountryCode__pfenum_ST                                                          = 193,
	ECountryCode__pfenum_SA                                                          = 194,
	ECountryCode__pfenum_SN                                                          = 195,
	ECountryCode__pfenum_RS                                                          = 196,
	ECountryCode__pfenum_SC                                                          = 197,
	ECountryCode__pfenum_SL                                                          = 198,
	ECountryCode__pfenum_SG                                                          = 199,
	ECountryCode__pfenum_SX                                                          = 200,
	ECountryCode__pfenum_SK                                                          = 201,
	ECountryCode__pfenum_SI                                                          = 202,
	ECountryCode__pfenum_SB                                                          = 203,
	ECountryCode__pfenum_SO                                                          = 204,
	ECountryCode__pfenum_ZA                                                          = 205,
	ECountryCode__pfenum_GS                                                          = 206,
	ECountryCode__pfenum_SS                                                          = 207,
	ECountryCode__pfenum_ES                                                          = 208,
	ECountryCode__pfenum_LK                                                          = 209,
	ECountryCode__pfenum_SD                                                          = 210,
	ECountryCode__pfenum_SR                                                          = 211,
	ECountryCode__pfenum_SJ                                                          = 212,
	ECountryCode__pfenum_SZ                                                          = 213,
	ECountryCode__pfenum_SE                                                          = 214,
	ECountryCode__pfenum_CH                                                          = 215,
	ECountryCode__pfenum_SY                                                          = 216,
	ECountryCode__pfenum_TW                                                          = 217,
	ECountryCode__pfenum_TJ                                                          = 218,
	ECountryCode__pfenum_TZ                                                          = 219,
	ECountryCode__pfenum_TH                                                          = 220,
	ECountryCode__pfenum_TL                                                          = 221,
	ECountryCode__pfenum_TG                                                          = 222,
	ECountryCode__pfenum_TK                                                          = 223,
	ECountryCode__pfenum_TO                                                          = 224,
	ECountryCode__pfenum_TT                                                          = 225,
	ECountryCode__pfenum_TN                                                          = 226,
	ECountryCode__pfenum_TR                                                          = 227,
	ECountryCode__pfenum_TM                                                          = 228,
	ECountryCode__pfenum_TC                                                          = 229,
	ECountryCode__pfenum_TV                                                          = 230,
	ECountryCode__pfenum_UG                                                          = 231,
	ECountryCode__pfenum_UA                                                          = 232,
	ECountryCode__pfenum_AE                                                          = 233,
	ECountryCode__pfenum_GB                                                          = 234,
	ECountryCode__pfenum_US                                                          = 235,
	ECountryCode__pfenum_UM                                                          = 236,
	ECountryCode__pfenum_UY                                                          = 237,
	ECountryCode__pfenum_UZ                                                          = 238,
	ECountryCode__pfenum_VU                                                          = 239,
	ECountryCode__pfenum_VE                                                          = 240,
	ECountryCode__pfenum_VN                                                          = 241,
	ECountryCode__pfenum_VG                                                          = 242,
	ECountryCode__pfenum_VI                                                          = 243,
	ECountryCode__pfenum_WF                                                          = 244,
	ECountryCode__pfenum_EH                                                          = 245,
	ECountryCode__pfenum_YE                                                          = 246,
	ECountryCode__pfenum_ZM                                                          = 247,
	ECountryCode__pfenum_ZW                                                          = 248
};

/// Enum /Script/PlayFab.EContinentCode
/// Size: 0x01 (1 bytes)
enum class EContinentCode : uint8_t
{
	EContinentCode__pfenum_AF                                                        = 0,
	EContinentCode__pfenum_AN                                                        = 1,
	EContinentCode__pfenum_AS                                                        = 2,
	EContinentCode__pfenum_EU                                                        = 3,
	EContinentCode__pfenum_NA                                                        = 4,
	EContinentCode__pfenum_OC                                                        = 5,
	EContinentCode__pfenum_SA                                                        = 6
};

/// Enum /Script/PlayFab.EConditionals
/// Size: 0x01 (1 bytes)
enum class EConditionals : uint8_t
{
	EConditionals__pfenum_Any                                                        = 0,
	EConditionals__pfenum_True                                                       = 1,
	EConditionals__pfenum_False                                                      = 2
};

/// Enum /Script/PlayFab.EChurnRiskLevel
/// Size: 0x01 (1 bytes)
enum class EChurnRiskLevel : uint8_t
{
	EChurnRiskLevel__pfenum_NoData                                                   = 0,
	EChurnRiskLevel__pfenum_LowRisk                                                  = 1,
	EChurnRiskLevel__pfenum_MediumRisk                                               = 2,
	EChurnRiskLevel__pfenum_HighRisk                                                 = 3
};

/// Enum /Script/PlayFab.EPFJson
/// Size: 0x01 (1 bytes)
enum class EPFJson : uint8_t
{
	EPFJson__None                                                                    = 0,
	EPFJson__Null                                                                    = 1,
	EPFJson__String                                                                  = 2,
	EPFJson__Number                                                                  = 3,
	EPFJson__Boolean                                                                 = 4,
	EPFJson__Array                                                                   = 5,
	EPFJson__Object                                                                  = 6
};

/// Struct /Script/PlayFab.PlayFabError
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 MaxSize: 0x0038
struct FPlayFabError
{ 
	bool                                               HasError;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            ErrorCode;                                                  // 0x0004   (0x0004)  
	FString                                            ErrorName;                                                  // 0x0008   (0x0010)  
	FString                                            ErrorMessage;                                               // 0x0018   (0x0010)  
	FString                                            ErrorDetails;                                               // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.PlayFabBaseModel
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 MaxSize: 0x0040
struct FPlayFabBaseModel
{ 
	FPlayFabError                                      responseError;                                              // 0x0000   (0x0038)  
	class UPlayFabJsonObject*                          responseData;                                               // 0x0038   (0x0008)  
};

/// Struct /Script/PlayFab.PlayFabResultCommon
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Request;                                                    // 0x0000   (0x0008)  
};

/// Struct /Script/PlayFab.AdminEmptyResponse
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminEmptyResponse : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.PlayFabRequestCommon
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 MaxSize: 0x0008
struct FPlayFabRequestCommon
{ 
	class UPlayFabAuthenticationContext*               AuthenticationContext;                                      // 0x0000   (0x0008)  
};

/// Struct /Script/PlayFab.AdminAbortTaskInstanceRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminAbortTaskInstanceRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            TaskInstanceId;                                             // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminAddLocalizedNewsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminAddLocalizedNewsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminAddLocalizedNewsRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FAdminAddLocalizedNewsRequest : FPlayFabRequestCommon
{ 
	FString                                            Body;                                                       // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	FString                                            Language;                                                   // 0x0020   (0x0010)  
	FString                                            NewsId;                                                     // 0x0030   (0x0010)  
	FString                                            Title;                                                      // 0x0040   (0x0010)  
};

/// Struct /Script/PlayFab.AdminAddNewsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminAddNewsResult : FPlayFabResultCommon
{ 
	FString                                            NewsId;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminAddNewsRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminAddNewsRequest : FPlayFabRequestCommon
{ 
	FString                                            Body;                                                       // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	FString                                            Timestamp;                                                  // 0x0020   (0x0010)  
	FString                                            Title;                                                      // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.AdminAddPlayerTagResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminAddPlayerTagResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminAddPlayerTagRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminAddPlayerTagRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	FString                                            TagName;                                                    // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminModifyUserVirtualCurrencyResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminModifyUserVirtualCurrencyResult : FPlayFabResultCommon
{ 
	int32_t                                            Balance;                                                    // 0x0008   (0x0004)  
	int32_t                                            BalanceChange;                                              // 0x000C   (0x0004)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	FString                                            VirtualCurrency;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminAddUserVirtualCurrencyRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminAddUserVirtualCurrencyRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Amount;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0010   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	FString                                            VirtualCurrency;                                            // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminBlankResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminBlankResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminAddVirtualCurrencyTypesRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminAddVirtualCurrencyTypesRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  VirtualCurrencies;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminBanUsersResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminBanUsersResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  BanData;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminBanUsersRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminBanUsersRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Bans;                                                       // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
};

/// Struct /Script/PlayFab.AdminCheckLimitedEditionItemAvailabilityResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminCheckLimitedEditionItemAvailabilityResult : FPlayFabResultCommon
{ 
	int32_t                                            Amount;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.AdminCheckLimitedEditionItemAvailabilityRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminCheckLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	FString                                            ItemId;                                                     // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateTaskResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminCreateTaskResult : FPlayFabResultCommon
{ 
	FString                                            TaskId;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateActionsOnPlayerSegmentTaskRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FAdminCreateActionsOnPlayerSegmentTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Description;                                                // 0x0010   (0x0010)  
	bool                                               IsActive;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	FString                                            Name;                                                       // 0x0028   (0x0010)  
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0038   (0x0008)  
	FString                                            Schedule;                                                   // 0x0040   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateCloudScriptTaskRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FAdminCreateCloudScriptTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Description;                                                // 0x0010   (0x0010)  
	bool                                               IsActive;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	FString                                            Name;                                                       // 0x0028   (0x0010)  
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0038   (0x0008)  
	FString                                            Schedule;                                                   // 0x0040   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateInsightsScheduledScalingTaskRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FAdminCreateInsightsScheduledScalingTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Description;                                                // 0x0010   (0x0010)  
	bool                                               IsActive;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	FString                                            Name;                                                       // 0x0028   (0x0010)  
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0038   (0x0008)  
	FString                                            Schedule;                                                   // 0x0040   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateOpenIdConnectionRequest
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000058) align 8 MaxSize: 0x0058
struct FAdminCreateOpenIdConnectionRequest : FPlayFabRequestCommon
{ 
	FString                                            ClientId;                                                   // 0x0008   (0x0010)  
	FString                                            ClientSecret;                                               // 0x0018   (0x0010)  
	FString                                            ConnectionId;                                               // 0x0028   (0x0010)  
	bool                                               IgnoreNonce;                                                // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
	FString                                            IssuerDiscoveryUrl;                                         // 0x0040   (0x0010)  
	class UPlayFabJsonObject*                          IssuerInformation;                                          // 0x0050   (0x0008)  
};

/// Struct /Script/PlayFab.AdminCreatePlayerSharedSecretResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminCreatePlayerSharedSecretResult : FPlayFabResultCommon
{ 
	FString                                            SecretKey;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreatePlayerSharedSecretRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminCreatePlayerSharedSecretRequest : FPlayFabRequestCommon
{ 
	FString                                            FriendlyName;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreatePlayerStatisticDefinitionResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminCreatePlayerStatisticDefinitionResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Statistic;                                                  // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminCreatePlayerStatisticDefinitionRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminCreatePlayerStatisticDefinitionRequest : FPlayFabRequestCommon
{ 
	EStatisticAggregationMethod                        AggregationMethod;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0010   (0x0008)  
	FString                                            StatisticName;                                              // 0x0018   (0x0010)  
	EStatisticResetIntervalOption                      VersionChangeInterval;                                      // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminCreateSegmentResponse
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminCreateSegmentResponse : FPlayFabResultCommon
{ 
	FString                                            ErrorMessage;                                               // 0x0008   (0x0010)  
	FString                                            SegmentId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminCreateSegmentRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminCreateSegmentRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          SegmentModel;                                               // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminDeleteMasterPlayerAccountResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminDeleteMasterPlayerAccountResult : FPlayFabResultCommon
{ 
	FString                                            JobReceiptId;                                               // 0x0008   (0x0010)  
	FString                                            TitleIds;                                                   // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteMembershipSubscriptionResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeleteMembershipSubscriptionResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeletePlayerResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeletePlayerResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeletePlayerSharedSecretResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeletePlayerSharedSecretResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeleteSegmentsResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeleteSegmentsResponse : FPlayFabResultCommon
{ 
	FString                                            ErrorMessage;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteStoreResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeleteStoreResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeleteTitleResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeleteTitleResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeleteTitleDataOverrideResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeleteTitleDataOverrideResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminExportMasterPlayerDataResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminExportMasterPlayerDataResult : FPlayFabResultCommon
{ 
	FString                                            JobReceiptId;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetActionsOnPlayersInSegmentTaskInstanceResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetActionsOnPlayersInSegmentTaskInstanceResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Summary;                                                    // 0x0010   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetAllSegmentsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetAllSegmentsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Segments;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetCatalogItemsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetCatalogItemsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Catalog;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetCloudScriptRevisionResult
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminGetCloudScriptRevisionResult : FPlayFabResultCommon
{ 
	FString                                            CreatedAt;                                                  // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  Files;                                                      // 0x0018   (0x0010)  
	bool                                               IsPublished;                                                // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0029   (0x0003)  MISSED
	int32_t                                            Revision;                                                   // 0x002C   (0x0004)  
	int32_t                                            Version;                                                    // 0x0030   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0034   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.AdminGetCloudScriptTaskInstanceResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetCloudScriptTaskInstanceResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Summary;                                                    // 0x0010   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetCloudScriptVersionsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetCloudScriptVersionsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Versions;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetContentListResult
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminGetContentListResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Contents;                                                   // 0x0008   (0x0010)  
	int32_t                                            ItemCount;                                                  // 0x0018   (0x0004)  
	int32_t                                            TotalSize;                                                  // 0x001C   (0x0004)  
};

/// Struct /Script/PlayFab.AdminGetContentUploadUrlResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetContentUploadUrlResult : FPlayFabResultCommon
{ 
	FString                                            URL;                                                        // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetDataReportResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetDataReportResult : FPlayFabResultCommon
{ 
	FString                                            DownloadUrl;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetMatchmakerGameInfoResult
/// Size: 0x00B8 (184 bytes) (0x000008 - 0x0000B8) align 8 MaxSize: 0x00B8
struct FAdminGetMatchmakerGameInfoResult : FPlayFabResultCommon
{ 
	FString                                            BuildVersion;                                               // 0x0008   (0x0010)  
	FString                                            EndTime;                                                    // 0x0018   (0x0010)  
	FString                                            LobbyId;                                                    // 0x0028   (0x0010)  
	FString                                            Mode;                                                       // 0x0038   (0x0010)  
	FString                                            Players;                                                    // 0x0048   (0x0010)  
	ERegion                                            Region;                                                     // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0059   (0x0007)  MISSED
	FString                                            ServerIPV4Address;                                          // 0x0060   (0x0010)  
	FString                                            ServerIPV6Address;                                          // 0x0070   (0x0010)  
	int32_t                                            ServerPort;                                                 // 0x0080   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0084   (0x0004)  MISSED
	FString                                            ServerPublicDNSName;                                        // 0x0088   (0x0010)  
	FString                                            StartTime;                                                  // 0x0098   (0x0010)  
	FString                                            TitleID;                                                    // 0x00A8   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetMatchmakerGameModesResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetMatchmakerGameModesResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  GameModes;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayedTitleListResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayedTitleListResult : FPlayFabResultCommon
{ 
	FString                                            TitleIds;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerIdFromAuthTokenResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayerIdFromAuthTokenResult : FPlayFabResultCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerProfileResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetPlayerProfileResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          PlayerProfile;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetPlayerSegmentsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayerSegmentsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Segments;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerSharedSecretsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayerSharedSecretsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  SharedSecrets;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayersInSegmentResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminGetPlayersInSegmentResult : FPlayFabResultCommon
{ 
	FString                                            ContinuationToken;                                          // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  PlayerProfiles;                                             // 0x0018   (0x0010)  
	int32_t                                            ProfilesInSegment;                                          // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.AdminGetPlayerStatisticDefinitionsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayerStatisticDefinitionsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Statistics;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerStatisticVersionsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayerStatisticVersionsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  StatisticVersions;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerTagsResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetPlayerTagsResult : FPlayFabResultCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
	FString                                            Tags;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPolicyResponse
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminGetPolicyResponse : FPlayFabResultCommon
{ 
	FString                                            PolicyName;                                                 // 0x0008   (0x0010)  
	int32_t                                            PolicyVersion;                                              // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	TArray<class UPlayFabJsonObject*>                  Statements;                                                 // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPublisherDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetPublisherDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetRandomResultTablesResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetRandomResultTablesResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Tables;                                                     // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetSegmentsResponse
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetSegmentsResponse : FPlayFabResultCommon
{ 
	FString                                            ErrorMessage;                                               // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  Segments;                                                   // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetStoreItemsResult
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FAdminGetStoreItemsResult : FPlayFabResultCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          MarketingData;                                              // 0x0018   (0x0008)  
	EPfSourceType                                      Source;                                                     // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	TArray<class UPlayFabJsonObject*>                  Store;                                                      // 0x0028   (0x0010)  
	FString                                            StoreId;                                                    // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetTaskInstancesResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetTaskInstancesResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Summaries;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetTasksResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetTasksResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Tasks;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetTitleDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetTitleDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminLookupUserAccountInfoResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminLookupUserAccountInfoResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          UserInfo;                                                   // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetUserBansResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetUserBansResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  BanData;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetUserDataResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetUserDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
	int32_t                                            DataVersion;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetUserInventoryResult
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminGetUserInventoryResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Inventory;                                                  // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          VirtualCurrency;                                            // 0x0028   (0x0008)  
	class UPlayFabJsonObject*                          VirtualCurrencyRechargeTimes;                               // 0x0030   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGrantItemsToUsersResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGrantItemsToUsersResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  ItemGrantResults;                                           // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminIncrementLimitedEditionItemAvailabilityResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminIncrementLimitedEditionItemAvailabilityResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminIncrementPlayerStatisticVersionResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminIncrementPlayerStatisticVersionResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          StatisticVersion;                                           // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminListOpenIdConnectionResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminListOpenIdConnectionResponse : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Connections;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminListVirtualCurrencyTypesResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminListVirtualCurrencyTypesResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  VirtualCurrencies;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminModifyServerBuildResult
/// Size: 0x0088 (136 bytes) (0x000008 - 0x000088) align 8 MaxSize: 0x0088
struct FAdminModifyServerBuildResult : FPlayFabResultCommon
{ 
	FString                                            ActiveRegions;                                              // 0x0008   (0x0010)  
	FString                                            BuildId;                                                    // 0x0018   (0x0010)  
	FString                                            CommandLineTemplate;                                        // 0x0028   (0x0010)  
	FString                                            Comment;                                                    // 0x0038   (0x0010)  
	FString                                            ExecutablePath;                                             // 0x0048   (0x0010)  
	int32_t                                            MaxGamesPerHost;                                            // 0x0058   (0x0004)  
	int32_t                                            MinFreeGameSlots;                                           // 0x005C   (0x0004)  
	EGameBuildStatus                                   Status;                                                     // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0061   (0x0007)  MISSED
	FString                                            Timestamp;                                                  // 0x0068   (0x0010)  
	FString                                            TitleID;                                                    // 0x0078   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRefundPurchaseResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRefundPurchaseResponse : FPlayFabResultCommon
{ 
	FString                                            PurchaseStatus;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRemovePlayerTagResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminRemovePlayerTagResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminResetCharacterStatisticsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminResetCharacterStatisticsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminResetPasswordResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminResetPasswordResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminResetUserStatisticsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminResetUserStatisticsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminResolvePurchaseDisputeResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminResolvePurchaseDisputeResponse : FPlayFabResultCommon
{ 
	FString                                            PurchaseStatus;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeAllBansForUserResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeAllBansForUserResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  BanData;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeBansResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeBansResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  BanData;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeInventoryResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminRevokeInventoryResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminRevokeInventoryItemsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeInventoryItemsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Errors;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRunTaskResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRunTaskResult : FPlayFabResultCommon
{ 
	FString                                            TaskInstanceId;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSendAccountRecoveryEmailResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSendAccountRecoveryEmailResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminUpdateCatalogItemsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminUpdateCatalogItemsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetMembershipOverrideResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetMembershipOverrideResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetPlayerSecretResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetPlayerSecretResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetPublishedRevisionResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetPublishedRevisionResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetPublisherDataResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetPublisherDataResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminUpdateStoreItemsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminUpdateStoreItemsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetTitleDataResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetTitleDataResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetTitleDataAndOverridesResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminSetTitleDataAndOverridesResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminSetupPushNotificationResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminSetupPushNotificationResult : FPlayFabResultCommon
{ 
	FString                                            ARN;                                                        // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateBansResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminUpdateBansResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  BanData;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateCloudScriptResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminUpdateCloudScriptResult : FPlayFabResultCommon
{ 
	int32_t                                            Revision;                                                   // 0x0008   (0x0004)  
	int32_t                                            Version;                                                    // 0x000C   (0x0004)  
};

/// Struct /Script/PlayFab.AdminUpdatePlayerSharedSecretResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminUpdatePlayerSharedSecretResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminUpdatePlayerStatisticDefinitionResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminUpdatePlayerStatisticDefinitionResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Statistic;                                                  // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminUpdatePolicyResponse
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminUpdatePolicyResponse : FPlayFabResultCommon
{ 
	FString                                            PolicyName;                                                 // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  Statements;                                                 // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateRandomResultTablesResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminUpdateRandomResultTablesResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.AdminUpdateSegmentResponse
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminUpdateSegmentResponse : FPlayFabResultCommon
{ 
	FString                                            ErrorMessage;                                               // 0x0008   (0x0010)  
	FString                                            SegmentId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateUserDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminUpdateUserDataResult : FPlayFabResultCommon
{ 
	int32_t                                            DataVersion;                                                // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.AdminUpdateUserTitleDisplayNameResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminUpdateUserTitleDisplayNameResult : FPlayFabResultCommon
{ 
	FString                                            DisplayName;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteContentRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeleteContentRequest : FPlayFabRequestCommon
{ 
	FString                                            Key;                                                        // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteMasterPlayerAccountRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminDeleteMasterPlayerAccountRequest : FPlayFabRequestCommon
{ 
	FString                                            MetaData;                                                   // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteMembershipSubscriptionRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminDeleteMembershipSubscriptionRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            MembershipId;                                               // 0x0010   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
	FString                                            SubscriptionId;                                             // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteOpenIdConnectionRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeleteOpenIdConnectionRequest : FPlayFabRequestCommon
{ 
	FString                                            ConnectionId;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeletePlayerRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeletePlayerRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeletePlayerSharedSecretRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeletePlayerSharedSecretRequest : FPlayFabRequestCommon
{ 
	FString                                            SecretKey;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteSegmentRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeleteSegmentRequest : FPlayFabRequestCommon
{ 
	FString                                            SegmentId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteStoreRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminDeleteStoreRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	FString                                            StoreId;                                                    // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminDeleteTaskRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminDeleteTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          Identifier;                                                 // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminDeleteTitleRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminDeleteTitleRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminDeleteTitleDataOverrideRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminDeleteTitleDataOverrideRequest : FPlayFabRequestCommon
{ 
	FString                                            OverrideLabel;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminExportMasterPlayerDataRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminExportMasterPlayerDataRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetTaskInstanceRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetTaskInstanceRequest : FPlayFabRequestCommon
{ 
	FString                                            TaskInstanceId;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetAllSegmentsRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminGetAllSegmentsRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminGetCatalogItemsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetCatalogItemsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetCloudScriptRevisionRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetCloudScriptRevisionRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Revision;                                                   // 0x0008   (0x0004)  
	int32_t                                            Version;                                                    // 0x000C   (0x0004)  
};

/// Struct /Script/PlayFab.AdminGetCloudScriptVersionsRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminGetCloudScriptVersionsRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminGetContentListRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetContentListRequest : FPlayFabRequestCommon
{ 
	FString                                            Prefix;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetContentUploadUrlRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetContentUploadUrlRequest : FPlayFabRequestCommon
{ 
	FString                                            ContentType;                                                // 0x0008   (0x0010)  
	FString                                            Key;                                                        // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetDataReportRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetDataReportRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Day;                                                        // 0x0008   (0x0004)  
	int32_t                                            Month;                                                      // 0x000C   (0x0004)  
	FString                                            ReportName;                                                 // 0x0010   (0x0010)  
	int32_t                                            Year;                                                       // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.AdminGetMatchmakerGameInfoRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetMatchmakerGameInfoRequest : FPlayFabRequestCommon
{ 
	FString                                            LobbyId;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetMatchmakerGameModesRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetMatchmakerGameModesRequest : FPlayFabRequestCommon
{ 
	FString                                            BuildVersion;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayedTitleListRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPlayedTitleListRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerIdFromAuthTokenRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminGetPlayerIdFromAuthTokenRequest : FPlayFabRequestCommon
{ 
	FString                                            Token;                                                      // 0x0008   (0x0010)  
	EAuthTokenType                                     TokenType;                                                  // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0019   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminGetPlayerProfileRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetPlayerProfileRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0020   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetPlayersSegmentsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminGetPlayersSegmentsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerSharedSecretsRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminGetPlayerSharedSecretsRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminGetPlayersInSegmentRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminGetPlayersInSegmentRequest : FPlayFabRequestCommon
{ 
	FString                                            ContinuationToken;                                          // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	int32_t                                            MaxBatchSize;                                               // 0x0020   (0x0004)  
	int32_t                                            SecondsToLive;                                              // 0x0024   (0x0004)  
	FString                                            SegmentId;                                                  // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerStatisticDefinitionsRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminGetPlayerStatisticDefinitionsRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminGetPlayerStatisticVersionsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminGetPlayerStatisticVersionsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            StatisticName;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPlayerTagsRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminGetPlayerTagsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Namespace;                                                  // 0x0010   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPolicyRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPolicyRequest : FPlayFabRequestCommon
{ 
	FString                                            PolicyName;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetPublisherDataRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetPublisherDataRequest : FPlayFabRequestCommon
{ 
	FString                                            Keys;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetRandomResultTablesRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetRandomResultTablesRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetSegmentsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetSegmentsRequest : FPlayFabRequestCommon
{ 
	FString                                            SegmentIds;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetStoreItemsRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetStoreItemsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	FString                                            StoreId;                                                    // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetTaskInstancesRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminGetTaskInstancesRequest : FPlayFabRequestCommon
{ 
	FString                                            StartedAtRangeFrom;                                         // 0x0008   (0x0010)  
	FString                                            StartedAtRangeTo;                                           // 0x0018   (0x0010)  
	ETaskInstanceStatus                                StatusFilter;                                               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	class UPlayFabJsonObject*                          TaskIdentifier;                                             // 0x0030   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetTasksRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminGetTasksRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          Identifier;                                                 // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminGetTitleDataRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminGetTitleDataRequest : FPlayFabRequestCommon
{ 
	FString                                            Keys;                                                       // 0x0008   (0x0010)  
	FString                                            OverrideLabel;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminLookupUserAccountInfoRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FAdminLookupUserAccountInfoRequest : FPlayFabRequestCommon
{ 
	FString                                            Email;                                                      // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	FString                                            TitleDisplayName;                                           // 0x0028   (0x0010)  
	FString                                            Username;                                                   // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetUserBansRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminGetUserBansRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetUserDataRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminGetUserDataRequest : FPlayFabRequestCommon
{ 
	int32_t                                            IfChangedFromDataVersion;                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            Keys;                                                       // 0x0010   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGetUserInventoryRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminGetUserInventoryRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminGrantItemsToUsersRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminGrantItemsToUsersRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	TArray<class UPlayFabJsonObject*>                  ItemGrants;                                                 // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminIncrementLimitedEditionItemAvailabilityRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminIncrementLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Amount;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            CatalogVersion;                                             // 0x0010   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0020   (0x0008)  
	FString                                            ItemId;                                                     // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminIncrementPlayerStatisticVersionRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminIncrementPlayerStatisticVersionRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            StatisticName;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminListOpenIdConnectionRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminListOpenIdConnectionRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminListVirtualCurrencyTypesRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FAdminListVirtualCurrencyTypesRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.AdminModifyServerBuildRequest
/// Size: 0x0078 (120 bytes) (0x000008 - 0x000078) align 8 MaxSize: 0x0078
struct FAdminModifyServerBuildRequest : FPlayFabRequestCommon
{ 
	FString                                            ActiveRegions;                                              // 0x0008   (0x0010)  
	FString                                            BuildId;                                                    // 0x0018   (0x0010)  
	FString                                            CommandLineTemplate;                                        // 0x0028   (0x0010)  
	FString                                            Comment;                                                    // 0x0038   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0048   (0x0008)  
	FString                                            ExecutablePath;                                             // 0x0050   (0x0010)  
	int32_t                                            MaxGamesPerHost;                                            // 0x0060   (0x0004)  
	int32_t                                            MinFreeGameSlots;                                           // 0x0064   (0x0004)  
	FString                                            Timestamp;                                                  // 0x0068   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRefundPurchaseRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminRefundPurchaseRequest : FPlayFabRequestCommon
{ 
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	FString                                            Reason;                                                     // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRemovePlayerTagRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminRemovePlayerTagRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	FString                                            TagName;                                                    // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRemoveVirtualCurrencyTypesRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRemoveVirtualCurrencyTypesRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  VirtualCurrencies;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminResetCharacterStatisticsRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminResetCharacterStatisticsRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminResetPasswordRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminResetPasswordRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Password;                                                   // 0x0010   (0x0010)  
	FString                                            Token;                                                      // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminResetUserStatisticsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAdminResetUserStatisticsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.AdminResolvePurchaseDisputeRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminResolvePurchaseDisputeRequest : FPlayFabRequestCommon
{ 
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	EResolutionOutcome                                 Outcome;                                                    // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0019   (0x0007)  MISSED
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
	FString                                            Reason;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeAllBansForUserRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeAllBansForUserRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeBansRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeBansRequest : FPlayFabRequestCommon
{ 
	FString                                            BanIds;                                                     // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeInventoryItemRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminRevokeInventoryItemRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	FString                                            ItemInstanceId;                                             // 0x0018   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRevokeInventoryItemsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRevokeInventoryItemsRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminRunTaskRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminRunTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Identifier;                                                 // 0x0010   (0x0008)  
};

/// Struct /Script/PlayFab.AdminSendAccountRecoveryEmailRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminSendAccountRecoveryEmailRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Email;                                                      // 0x0010   (0x0010)  
	FString                                            EmailTemplateId;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateCatalogItemsRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminUpdateCatalogItemsRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Catalog;                                                    // 0x0008   (0x0010)  
	FString                                            CatalogVersion;                                             // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0028   (0x0008)  
	bool                                               SetAsDefaultCatalog;                                        // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminSetMembershipOverrideRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminSetMembershipOverrideRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            ExpirationTime;                                             // 0x0010   (0x0010)  
	FString                                            MembershipId;                                               // 0x0020   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSetPlayerSecretRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminSetPlayerSecretRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayerSecret;                                               // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSetPublishedRevisionRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminSetPublishedRevisionRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	int32_t                                            Revision;                                                   // 0x0010   (0x0004)  
	int32_t                                            Version;                                                    // 0x0014   (0x0004)  
};

/// Struct /Script/PlayFab.AdminSetPublisherDataRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminSetPublisherDataRequest : FPlayFabRequestCommon
{ 
	FString                                            Key;                                                        // 0x0008   (0x0010)  
	FString                                            Value;                                                      // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateStoreItemsRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FAdminUpdateStoreItemsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	class UPlayFabJsonObject*                          MarketingData;                                              // 0x0020   (0x0008)  
	TArray<class UPlayFabJsonObject*>                  Store;                                                      // 0x0028   (0x0010)  
	FString                                            StoreId;                                                    // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSetTitleDataRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminSetTitleDataRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Key;                                                        // 0x0010   (0x0010)  
	FString                                            Value;                                                      // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSetTitleDataAndOverridesRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminSetTitleDataAndOverridesRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  KeyValues;                                                  // 0x0008   (0x0010)  
	FString                                            OverrideLabel;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.AdminSetupPushNotificationRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminSetupPushNotificationRequest : FPlayFabRequestCommon
{ 
	FString                                            Credential;                                                 // 0x0008   (0x0010)  
	FString                                            Key;                                                        // 0x0018   (0x0010)  
	FString                                            Name;                                                       // 0x0028   (0x0010)  
	bool                                               OverwriteOldARN;                                            // 0x0038   (0x0001)  
	EPushSetupPlatform                                 PLATFORM;                                                   // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_7[0x6];                                       // 0x003A   (0x0006)  MISSED
};

/// Struct /Script/PlayFab.AdminSubtractUserVirtualCurrencyRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminSubtractUserVirtualCurrencyRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Amount;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0010   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	FString                                            VirtualCurrency;                                            // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateBansRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAdminUpdateBansRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Bans;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateCloudScriptRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminUpdateCloudScriptRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            DeveloperPlayFabId;                                         // 0x0010   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  Files;                                                      // 0x0020   (0x0010)  
	bool                                               Publish;                                                    // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminUpdateOpenIdConnectionRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FAdminUpdateOpenIdConnectionRequest : FPlayFabRequestCommon
{ 
	FString                                            ClientId;                                                   // 0x0008   (0x0010)  
	FString                                            ClientSecret;                                               // 0x0018   (0x0010)  
	FString                                            ConnectionId;                                               // 0x0028   (0x0010)  
	FString                                            IssuerDiscoveryUrl;                                         // 0x0038   (0x0010)  
	class UPlayFabJsonObject*                          IssuerInformation;                                          // 0x0048   (0x0008)  
};

/// Struct /Script/PlayFab.AdminUpdatePlayerSharedSecretRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminUpdatePlayerSharedSecretRequest : FPlayFabRequestCommon
{ 
	bool                                               Disabled;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            FriendlyName;                                               // 0x0010   (0x0010)  
	FString                                            SecretKey;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdatePlayerStatisticDefinitionRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FAdminUpdatePlayerStatisticDefinitionRequest : FPlayFabRequestCommon
{ 
	EStatisticAggregationMethod                        AggregationMethod;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            StatisticName;                                              // 0x0010   (0x0010)  
	EStatisticResetIntervalOption                      VersionChangeInterval;                                      // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminUpdatePolicyRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminUpdatePolicyRequest : FPlayFabRequestCommon
{ 
	bool                                               OverwritePolicy;                                            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0009   (0x0007)  MISSED
	FString                                            PolicyName;                                                 // 0x0010   (0x0010)  
	int32_t                                            PolicyVersion;                                              // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	TArray<class UPlayFabJsonObject*>                  Statements;                                                 // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateRandomResultTablesRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminUpdateRandomResultTablesRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	TArray<class UPlayFabJsonObject*>                  Tables;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateSegmentRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FAdminUpdateSegmentRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          SegmentModel;                                               // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.AdminUpdateTaskRequest
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000060) align 8 MaxSize: 0x0060
struct FAdminUpdateTaskRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Description;                                                // 0x0010   (0x0010)  
	class UPlayFabJsonObject*                          Identifier;                                                 // 0x0020   (0x0008)  
	bool                                               IsActive;                                                   // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FString                                            Name;                                                       // 0x0030   (0x0010)  
	class UPlayFabJsonObject*                          Parameter;                                                  // 0x0040   (0x0008)  
	FString                                            Schedule;                                                   // 0x0048   (0x0010)  
	EScheduledTaskType                                 Type;                                                       // 0x0058   (0x0001)  
	unsigned char                                      UnknownData01_7[0x7];                                       // 0x0059   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.AdminUpdateUserDataRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FAdminUpdateUserDataRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Data;                                                       // 0x0010   (0x0008)  
	FString                                            KeysToRemove;                                               // 0x0018   (0x0010)  
	EUserDataPermission                                Permission;                                                 // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FString                                            PlayFabId;                                                  // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateUserInternalDataRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FAdminUpdateUserInternalDataRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Data;                                                       // 0x0010   (0x0008)  
	FString                                            KeysToRemove;                                               // 0x0018   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.AdminUpdateUserTitleDisplayNameRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAdminUpdateUserTitleDisplayNameRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            DisplayName;                                                // 0x0010   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AuthenticationGetEntityTokenResponse
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAuthenticationGetEntityTokenResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Entity;                                                     // 0x0008   (0x0008)  
	FString                                            EntityToken;                                                // 0x0010   (0x0010)  
	FString                                            TokenExpiration;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.AuthenticationValidateEntityTokenResponse
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FAuthenticationValidateEntityTokenResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Entity;                                                     // 0x0008   (0x0008)  
	EIdentifiedDeviceType                              IdentifiedDeviceType;                                       // 0x0010   (0x0001)  
	ELoginIdentityProvider                             IdentityProvider;                                           // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0012   (0x0006)  MISSED
	FString                                            IdentityProviderIssuedId;                                   // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          Lineage;                                                    // 0x0028   (0x0008)  
};

/// Struct /Script/PlayFab.AuthenticationGetEntityTokenRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FAuthenticationGetEntityTokenRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          Entity;                                                     // 0x0010   (0x0008)  
};

/// Struct /Script/PlayFab.AuthenticationValidateEntityTokenRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FAuthenticationValidateEntityTokenRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            EntityToken;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAcceptTradeResponse
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientAcceptTradeResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Trade;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientAcceptTradeRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FClientAcceptTradeRequest : FPlayFabRequestCommon
{ 
	FString                                            AcceptedInventoryInstanceIds;                               // 0x0008   (0x0010)  
	FString                                            OfferingPlayerId;                                           // 0x0018   (0x0010)  
	FString                                            TradeId;                                                    // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddFriendResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientAddFriendResult : FPlayFabResultCommon
{ 
	bool                                               Created;                                                    // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.ClientAddFriendRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientAddFriendRequest : FPlayFabRequestCommon
{ 
	FString                                            FriendEmail;                                                // 0x0008   (0x0010)  
	FString                                            FriendPlayFabId;                                            // 0x0018   (0x0010)  
	FString                                            FriendTitleDisplayName;                                     // 0x0028   (0x0010)  
	FString                                            FriendUsername;                                             // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddGenericIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientAddGenericIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientAddGenericIDRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientAddGenericIDRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          GenericId;                                                  // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientAddOrUpdateContactEmailResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientAddOrUpdateContactEmailResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientAddOrUpdateContactEmailRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientAddOrUpdateContactEmailRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            EmailAddress;                                               // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddSharedGroupMembersResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientAddSharedGroupMembersResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientAddSharedGroupMembersRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientAddSharedGroupMembersRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabIds;                                                 // 0x0008   (0x0010)  
	FString                                            SharedGroupId;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddUsernamePasswordResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientAddUsernamePasswordResult : FPlayFabResultCommon
{ 
	FString                                            Username;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddUsernamePasswordRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientAddUsernamePasswordRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Email;                                                      // 0x0010   (0x0010)  
	FString                                            Password;                                                   // 0x0020   (0x0010)  
	FString                                            Username;                                                   // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.ClientModifyUserVirtualCurrencyResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientModifyUserVirtualCurrencyResult : FPlayFabResultCommon
{ 
	int32_t                                            Balance;                                                    // 0x0008   (0x0004)  
	int32_t                                            BalanceChange;                                              // 0x000C   (0x0004)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	FString                                            VirtualCurrency;                                            // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAddUserVirtualCurrencyRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientAddUserVirtualCurrencyRequest : FPlayFabRequestCommon
{ 
	int32_t                                            Amount;                                                     // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0010   (0x0008)  
	FString                                            VirtualCurrency;                                            // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientAndroidDevicePushNotificationRegistrationResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientAndroidDevicePushNotificationRegistrationResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientAndroidDevicePushNotificationRegistrationRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientAndroidDevicePushNotificationRegistrationRequest : FPlayFabRequestCommon
{ 
	FString                                            ConfirmationMessage;                                        // 0x0008   (0x0010)  
	FString                                            DeviceToken;                                                // 0x0018   (0x0010)  
	bool                                               SendPushNotificationConfirmation;                           // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.ClientAttributeInstallResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientAttributeInstallResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientAttributeInstallRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientAttributeInstallRequest : FPlayFabRequestCommon
{ 
	FString                                            Adid;                                                       // 0x0008   (0x0010)  
	FString                                            Idfa;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientCancelTradeResponse
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientCancelTradeResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Trade;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientCancelTradeRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientCancelTradeRequest : FPlayFabRequestCommon
{ 
	FString                                            TradeId;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConfirmPurchaseResult
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FClientConfirmPurchaseResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
	FString                                            OrderId;                                                    // 0x0018   (0x0010)  
	FString                                            PurchaseDate;                                               // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConfirmPurchaseRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientConfirmPurchaseRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            OrderId;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumeItemResult
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientConsumeItemResult : FPlayFabResultCommon
{ 
	FString                                            ItemInstanceId;                                             // 0x0008   (0x0010)  
	int32_t                                            RemainingUses;                                              // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x001C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientConsumeItemRequest
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FClientConsumeItemRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	int32_t                                            ConsumeCount;                                               // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0020   (0x0008)  
	FString                                            ItemInstanceId;                                             // 0x0028   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumeMicrosoftStoreEntitlementsResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientConsumeMicrosoftStoreEntitlementsResponse : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumeMicrosoftStoreEntitlementsRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientConsumeMicrosoftStoreEntitlementsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	class UPlayFabJsonObject*                          MarketplaceSpecificData;                                    // 0x0020   (0x0008)  
};

/// Struct /Script/PlayFab.ClientConsumePS5EntitlementsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientConsumePS5EntitlementsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumePS5EntitlementsRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientConsumePS5EntitlementsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	class UPlayFabJsonObject*                          MarketplaceSpecificData;                                    // 0x0020   (0x0008)  
};

/// Struct /Script/PlayFab.ClientConsumePSNEntitlementsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientConsumePSNEntitlementsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  ItemsGranted;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumePSNEntitlementsRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientConsumePSNEntitlementsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	int32_t                                            ServiceLabel;                                               // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientConsumeXboxEntitlementsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientConsumeXboxEntitlementsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientConsumeXboxEntitlementsRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientConsumeXboxEntitlementsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0018   (0x0008)  
	FString                                            XboxToken;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientCreateSharedGroupResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientCreateSharedGroupResult : FPlayFabResultCommon
{ 
	FString                                            SharedGroupId;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientCreateSharedGroupRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientCreateSharedGroupRequest : FPlayFabRequestCommon
{ 
	FString                                            SharedGroupId;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientExecuteCloudScriptResult
/// Size: 0x0060 (96 bytes) (0x000008 - 0x000060) align 8 MaxSize: 0x0060
struct FClientExecuteCloudScriptResult : FPlayFabResultCommon
{ 
	int32_t                                            APIRequestsIssued;                                          // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UPlayFabJsonObject*                          Error;                                                      // 0x0010   (0x0008)  
	int32_t                                            ExecutionTimeSeconds;                                       // 0x0018   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FString                                            FunctionName;                                               // 0x0020   (0x0010)  
	class UPlayFabJsonObject*                          FunctionResult;                                             // 0x0030   (0x0008)  
	bool                                               FunctionResultTooLarge;                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	int32_t                                            HttpRequestsIssued;                                         // 0x003C   (0x0004)  
	TArray<class UPlayFabJsonObject*>                  Logs;                                                       // 0x0040   (0x0010)  
	bool                                               LogsTooLarge;                                               // 0x0050   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0051   (0x0003)  MISSED
	int32_t                                            MemoryConsumedBytes;                                        // 0x0054   (0x0004)  
	int32_t                                            ProcessorTimeSeconds;                                       // 0x0058   (0x0004)  
	int32_t                                            Revision;                                                   // 0x005C   (0x0004)  
};

/// Struct /Script/PlayFab.ClientGetAccountInfoResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetAccountInfoResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          AccountInfo;                                                // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetAdPlacementsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetAdPlacementsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  AdPlacements;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientListUsersCharactersResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientListUsersCharactersResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Characters;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCatalogItemsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetCatalogItemsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Catalog;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCharacterDataResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetCharacterDataResult : FPlayFabResultCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          Data;                                                       // 0x0018   (0x0008)  
	int32_t                                            DataVersion;                                                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetCharacterInventoryResult
/// Size: 0x0038 (56 bytes) (0x000008 - 0x000038) align 8 MaxSize: 0x0038
struct FClientGetCharacterInventoryResult : FPlayFabResultCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  Inventory;                                                  // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          VirtualCurrency;                                            // 0x0028   (0x0008)  
	class UPlayFabJsonObject*                          VirtualCurrencyRechargeTimes;                               // 0x0030   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetCharacterLeaderboardResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetCharacterLeaderboardResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCharacterStatisticsResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetCharacterStatisticsResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          CharacterStatistics;                                        // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetContentDownloadUrlResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetContentDownloadUrlResult : FPlayFabResultCommon
{ 
	FString                                            URL;                                                        // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientCurrentGamesResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientCurrentGamesResult : FPlayFabResultCommon
{ 
	int32_t                                            GameCount;                                                  // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<class UPlayFabJsonObject*>                  Games;                                                      // 0x0010   (0x0010)  
	int32_t                                            PlayerCount;                                                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetLeaderboardResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetLeaderboardResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
	FString                                            NextReset;                                                  // 0x0018   (0x0010)  
	int32_t                                            Version;                                                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetFriendLeaderboardAroundPlayerResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetFriendLeaderboardAroundPlayerResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
	FString                                            NextReset;                                                  // 0x0018   (0x0010)  
	int32_t                                            Version;                                                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetFriendsListResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetFriendsListResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Friends;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGameServerRegionsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGameServerRegionsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Regions;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardAroundCharacterResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetLeaderboardAroundCharacterResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardAroundPlayerResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetLeaderboardAroundPlayerResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
	FString                                            NextReset;                                                  // 0x0018   (0x0010)  
	int32_t                                            Version;                                                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetLeaderboardForUsersCharactersResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetLeaderboardForUsersCharactersResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Leaderboard;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPaymentTokenResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetPaymentTokenResult : FPlayFabResultCommon
{ 
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	FString                                            ProviderToken;                                              // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPhotonAuthenticationTokenResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPhotonAuthenticationTokenResult : FPlayFabResultCommon
{ 
	FString                                            PhotonCustomAuthenticationToken;                            // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerCombinedInfoResult
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGetPlayerCombinedInfoResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          InfoResultPayload;                                          // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerProfileResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetPlayerProfileResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          PlayerProfile;                                              // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetPlayerSegmentsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayerSegmentsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Segments;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerStatisticsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayerStatisticsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Statistics;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerStatisticVersionsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayerStatisticVersionsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  StatisticVersions;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerTagsResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetPlayerTagsResult : FPlayFabResultCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
	FString                                            Tags;                                                       // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerTradesResponse
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetPlayerTradesResponse : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  AcceptedTrades;                                             // 0x0008   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  OpenedTrades;                                               // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromFacebookIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromFacebookIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGameCenterIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGameCenterIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGenericIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGenericIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGoogleIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGoogleIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromKongregateIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromKongregateIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromPSNAccountIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromSteamIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromSteamIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromTwitchIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromTwitchIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromXboxLiveIDsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromXboxLiveIDsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Data;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPublisherDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetPublisherDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetPurchaseResult
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000058) align 8 MaxSize: 0x0058
struct FClientGetPurchaseResult : FPlayFabResultCommon
{ 
	FString                                            OrderId;                                                    // 0x0008   (0x0010)  
	FString                                            PaymentProvider;                                            // 0x0018   (0x0010)  
	FString                                            PurchaseDate;                                               // 0x0028   (0x0010)  
	FString                                            TransactionId;                                              // 0x0038   (0x0010)  
	FString                                            TransactionStatus;                                          // 0x0048   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetSharedGroupDataResult
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGetSharedGroupDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
	FString                                            Members;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetStoreItemsResult
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientGetStoreItemsResult : FPlayFabResultCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          MarketingData;                                              // 0x0018   (0x0008)  
	EPfSourceType                                      Source;                                                     // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	TArray<class UPlayFabJsonObject*>                  Store;                                                      // 0x0028   (0x0010)  
	FString                                            StoreId;                                                    // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetTimeResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetTimeResult : FPlayFabResultCommon
{ 
	FString                                            Time;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetTitleDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetTitleDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetTitleNewsResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetTitleNewsResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  News;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetTitlePublicKeyResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetTitlePublicKeyResult : FPlayFabResultCommon
{ 
	FString                                            RSAPublicKey;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetTradeStatusResponse
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetTradeStatusResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Trade;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetUserDataResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetUserDataResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Data;                                                       // 0x0008   (0x0008)  
	int32_t                                            DataVersion;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientGetUserInventoryResult
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetUserInventoryResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Inventory;                                                  // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          VirtualCurrency;                                            // 0x0018   (0x0008)  
	class UPlayFabJsonObject*                          VirtualCurrencyRechargeTimes;                               // 0x0020   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGrantCharacterToUserResult
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGrantCharacterToUserResult : FPlayFabResultCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	FString                                            CharacterType;                                              // 0x0018   (0x0010)  
	bool                                               Result;                                                     // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.ClientLinkAndroidDeviceIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkAndroidDeviceIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientEmptyResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientEmptyResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkCustomIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkCustomIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkFacebookAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkFacebookAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkFacebookInstantGamesIdResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkFacebookInstantGamesIdResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkGameCenterAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkGameCenterAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkGoogleAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkGoogleAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkIOSDeviceIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkIOSDeviceIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkKongregateAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkKongregateAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkNintendoSwitchDeviceIdResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkNintendoSwitchDeviceIdResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkPSNAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkPSNAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkSteamAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkSteamAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkTwitchAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkTwitchAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientLinkXboxAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientLinkXboxAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.PlayFabLoginResultCommon
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FPlayFabLoginResultCommon : FPlayFabResultCommon
{ 
	class UPlayFabAuthenticationContext*               AuthenticationContext;                                      // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientLoginResult
/// Size: 0x0068 (104 bytes) (0x000010 - 0x000068) align 8 MaxSize: 0x0068
struct FClientLoginResult : FPlayFabLoginResultCommon
{ 
	class UPlayFabJsonObject*                          EntityToken;                                                // 0x0010   (0x0008)  
	class UPlayFabJsonObject*                          InfoResultPayload;                                          // 0x0018   (0x0008)  
	FString                                            LastLoginTime;                                              // 0x0020   (0x0010)  
	bool                                               NewlyCreated;                                               // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
	FString                                            PlayFabId;                                                  // 0x0038   (0x0010)  
	FString                                            SessionTicket;                                              // 0x0048   (0x0010)  
	class UPlayFabJsonObject*                          SettingsForUser;                                            // 0x0058   (0x0008)  
	class UPlayFabJsonObject*                          TreatmentAssignment;                                        // 0x0060   (0x0008)  
};

/// Struct /Script/PlayFab.ClientMatchmakeResult
/// Size: 0x0080 (128 bytes) (0x000008 - 0x000080) align 8 MaxSize: 0x0080
struct FClientMatchmakeResult : FPlayFabResultCommon
{ 
	FString                                            Expires;                                                    // 0x0008   (0x0010)  
	FString                                            LobbyId;                                                    // 0x0018   (0x0010)  
	int32_t                                            PollWaitTimeMS;                                             // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	FString                                            ServerIPV4Address;                                          // 0x0030   (0x0010)  
	FString                                            ServerIPV6Address;                                          // 0x0040   (0x0010)  
	int32_t                                            ServerPort;                                                 // 0x0050   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0054   (0x0004)  MISSED
	FString                                            ServerPublicDNSName;                                        // 0x0058   (0x0010)  
	EMatchmakeStatus                                   Status;                                                     // 0x0068   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0069   (0x0007)  MISSED
	FString                                            Ticket;                                                     // 0x0070   (0x0010)  
};

/// Struct /Script/PlayFab.ClientOpenTradeResponse
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientOpenTradeResponse : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          Trade;                                                      // 0x0008   (0x0008)  
};

/// Struct /Script/PlayFab.ClientPayForPurchaseResult
/// Size: 0x0078 (120 bytes) (0x000008 - 0x000078) align 8 MaxSize: 0x0078
struct FClientPayForPurchaseResult : FPlayFabResultCommon
{ 
	int32_t                                            CreditApplied;                                              // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            OrderId;                                                    // 0x0010   (0x0010)  
	FString                                            ProviderData;                                               // 0x0020   (0x0010)  
	FString                                            ProviderToken;                                              // 0x0030   (0x0010)  
	FString                                            PurchaseConfirmationPageURL;                                // 0x0040   (0x0010)  
	FString                                            PurchaseCurrency;                                           // 0x0050   (0x0010)  
	int32_t                                            PurchasePrice;                                              // 0x0060   (0x0004)  
	ETransactionStatus                                 Status;                                                     // 0x0064   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0065   (0x0003)  MISSED
	class UPlayFabJsonObject*                          VCAmount;                                                   // 0x0068   (0x0008)  
	class UPlayFabJsonObject*                          VirtualCurrency;                                            // 0x0070   (0x0008)  
};

/// Struct /Script/PlayFab.ClientPurchaseItemResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientPurchaseItemResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Items;                                                      // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientRedeemCouponResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientRedeemCouponResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  GrantedItems;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientEmptyResponse
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientEmptyResponse : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientRegisterForIOSPushNotificationResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientRegisterForIOSPushNotificationResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientRegisterPlayFabUserResult
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientRegisterPlayFabUserResult : FPlayFabResultCommon
{ 
	class UPlayFabJsonObject*                          EntityToken;                                                // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	FString                                            SessionTicket;                                              // 0x0020   (0x0010)  
	class UPlayFabJsonObject*                          SettingsForUser;                                            // 0x0030   (0x0008)  
	FString                                            Username;                                                   // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.ClientRemoveContactEmailResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientRemoveContactEmailResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientRemoveFriendResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientRemoveFriendResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientRemoveGenericIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientRemoveGenericIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientRemoveSharedGroupMembersResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientRemoveSharedGroupMembersResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientReportAdActivityResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientReportAdActivityResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientReportPlayerClientResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientReportPlayerClientResult : FPlayFabResultCommon
{ 
	int32_t                                            SubmissionsRemaining;                                       // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientRestoreIOSPurchasesResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientRestoreIOSPurchasesResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Fulfillments;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientRewardAdActivityResult
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000058) align 8 MaxSize: 0x0058
struct FClientRewardAdActivityResult : FPlayFabResultCommon
{ 
	FString                                            AdActivityEventId;                                          // 0x0008   (0x0010)  
	FString                                            DebugResults;                                               // 0x0018   (0x0010)  
	FString                                            PlacementId;                                                // 0x0028   (0x0010)  
	FString                                            PlacementName;                                              // 0x0038   (0x0010)  
	int32_t                                            PlacementViewsRemaining;                                    // 0x0048   (0x0004)  
	int32_t                                            PlacementViewsResetMinutes;                                 // 0x004C   (0x0004)  
	class UPlayFabJsonObject*                          RewardResults;                                              // 0x0050   (0x0008)  
};

/// Struct /Script/PlayFab.ClientSendAccountRecoveryEmailResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientSendAccountRecoveryEmailResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientSetFriendTagsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientSetFriendTagsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientSetPlayerSecretResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientSetPlayerSecretResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientStartPurchaseResult
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientStartPurchaseResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Contents;                                                   // 0x0008   (0x0010)  
	FString                                            OrderId;                                                    // 0x0018   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  PaymentOptions;                                             // 0x0028   (0x0010)  
	class UPlayFabJsonObject*                          VirtualCurrencyBalances;                                    // 0x0038   (0x0008)  
};

/// Struct /Script/PlayFab.ClientUnlinkAndroidDeviceIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkAndroidDeviceIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkCustomIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkCustomIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkFacebookAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkFacebookAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkFacebookInstantGamesIdResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkFacebookInstantGamesIdResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkGameCenterAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkGameCenterAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkGoogleAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkGoogleAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkIOSDeviceIDResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkIOSDeviceIDResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkKongregateAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkKongregateAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkNintendoSwitchDeviceIdResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkNintendoSwitchDeviceIdResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkPSNAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkPSNAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkSteamAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkSteamAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkTwitchAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkTwitchAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlinkXboxAccountResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUnlinkXboxAccountResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUnlockContainerItemResult
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientUnlockContainerItemResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  GrantedItems;                                               // 0x0008   (0x0010)  
	FString                                            UnlockedItemInstanceId;                                     // 0x0018   (0x0010)  
	FString                                            UnlockedWithItemInstanceId;                                 // 0x0028   (0x0010)  
	class UPlayFabJsonObject*                          VirtualCurrency;                                            // 0x0038   (0x0008)  
};

/// Struct /Script/PlayFab.ClientUpdateCharacterDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientUpdateCharacterDataResult : FPlayFabResultCommon
{ 
	int32_t                                            DataVersion;                                                // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientUpdateCharacterStatisticsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUpdateCharacterStatisticsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUpdatePlayerStatisticsResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUpdatePlayerStatisticsResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUpdateSharedGroupDataResult
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientUpdateSharedGroupDataResult : FPlayFabResultCommon
{ 
};

/// Struct /Script/PlayFab.ClientUpdateUserDataResult
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientUpdateUserDataResult : FPlayFabResultCommon
{ 
	int32_t                                            DataVersion;                                                // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x000C   (0x0004)  MISSED
};

/// Struct /Script/PlayFab.ClientUpdateUserTitleDisplayNameResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientUpdateUserTitleDisplayNameResult : FPlayFabResultCommon
{ 
	FString                                            DisplayName;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientValidateAmazonReceiptResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientValidateAmazonReceiptResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Fulfillments;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientValidateGooglePlayPurchaseResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientValidateGooglePlayPurchaseResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Fulfillments;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientValidateIOSReceiptResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientValidateIOSReceiptResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Fulfillments;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientValidateWindowsReceiptResult
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientValidateWindowsReceiptResult : FPlayFabResultCommon
{ 
	TArray<class UPlayFabJsonObject*>                  Fulfillments;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientWriteEventResponse
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientWriteEventResponse : FPlayFabResultCommon
{ 
	FString                                            EventId;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientExecuteCloudScriptRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientExecuteCloudScriptRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            FunctionName;                                               // 0x0010   (0x0010)  
	class UPlayFabJsonObject*                          FunctionParameter;                                          // 0x0020   (0x0008)  
	bool                                               GeneratePlayStreamEvent;                                    // 0x0028   (0x0001)  
	ECloudScriptRevisionOption                         RevisionSelection;                                          // 0x0029   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x002A   (0x0002)  MISSED
	int32_t                                            SpecificRevision;                                           // 0x002C   (0x0004)  
};

/// Struct /Script/PlayFab.ClientGetAccountInfoRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientGetAccountInfoRequest : FPlayFabRequestCommon
{ 
	FString                                            Email;                                                      // 0x0008   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	FString                                            TitleDisplayName;                                           // 0x0028   (0x0010)  
	FString                                            Username;                                                   // 0x0038   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetAdPlacementsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGetAdPlacementsRequest : FPlayFabRequestCommon
{ 
	FString                                            AppId;                                                      // 0x0008   (0x0010)  
	class UPlayFabJsonObject*                          Identifier;                                                 // 0x0018   (0x0008)  
};

/// Struct /Script/PlayFab.ClientListUsersCharactersRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientListUsersCharactersRequest : FPlayFabRequestCommon
{ 
	FString                                            PlayFabId;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCatalogItemsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetCatalogItemsRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCharacterDataRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientGetCharacterDataRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	int32_t                                            IfChangedFromDataVersion;                                   // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FString                                            Keys;                                                       // 0x0020   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCharacterInventoryRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetCharacterInventoryRequest : FPlayFabRequestCommon
{ 
	FString                                            CatalogVersion;                                             // 0x0008   (0x0010)  
	FString                                            CharacterId;                                                // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0028   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetCharacterLeaderboardRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetCharacterLeaderboardRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterType;                                              // 0x0008   (0x0010)  
	int32_t                                            MaxResultsCount;                                            // 0x0018   (0x0004)  
	int32_t                                            StartPosition;                                              // 0x001C   (0x0004)  
	FString                                            StatisticName;                                              // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetCharacterStatisticsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetCharacterStatisticsRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetContentDownloadUrlRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetContentDownloadUrlRequest : FPlayFabRequestCommon
{ 
	FString                                            HttpMethod;                                                 // 0x0008   (0x0010)  
	FString                                            Key;                                                        // 0x0018   (0x0010)  
	bool                                               ThruCDN;                                                    // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.ClientCurrentGamesRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientCurrentGamesRequest : FPlayFabRequestCommon
{ 
	FString                                            BuildVersion;                                               // 0x0008   (0x0010)  
	FString                                            GAMEMODE;                                                   // 0x0018   (0x0010)  
	ERegion                                            Region;                                                     // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FString                                            StatisticName;                                              // 0x0030   (0x0010)  
	class UPlayFabJsonObject*                          TagFilter;                                                  // 0x0040   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetFriendLeaderboardRequest
/// Size: 0x0050 (80 bytes) (0x000008 - 0x000050) align 8 MaxSize: 0x0050
struct FClientGetFriendLeaderboardRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	bool                                               IncludeFacebookFriends;                                     // 0x0010   (0x0001)  
	bool                                               IncludeSteamFriends;                                        // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0012   (0x0002)  MISSED
	int32_t                                            MaxResultsCount;                                            // 0x0014   (0x0004)  
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0018   (0x0008)  
	int32_t                                            StartPosition;                                              // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FString                                            StatisticName;                                              // 0x0028   (0x0010)  
	bool                                               UseSpecificVersion;                                         // 0x0038   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	int32_t                                            Version;                                                    // 0x003C   (0x0004)  
	FString                                            XboxToken;                                                  // 0x0040   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetFriendLeaderboardAroundPlayerRequest
/// Size: 0x0058 (88 bytes) (0x000008 - 0x000058) align 8 MaxSize: 0x0058
struct FClientGetFriendLeaderboardAroundPlayerRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	bool                                               IncludeFacebookFriends;                                     // 0x0010   (0x0001)  
	bool                                               IncludeSteamFriends;                                        // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0012   (0x0002)  MISSED
	int32_t                                            MaxResultsCount;                                            // 0x0014   (0x0004)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0028   (0x0008)  
	FString                                            StatisticName;                                              // 0x0030   (0x0010)  
	bool                                               UseSpecificVersion;                                         // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	int32_t                                            Version;                                                    // 0x0044   (0x0004)  
	FString                                            XboxToken;                                                  // 0x0048   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetFriendsListRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetFriendsListRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	bool                                               IncludeFacebookFriends;                                     // 0x0010   (0x0001)  
	bool                                               IncludeSteamFriends;                                        // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0012   (0x0006)  MISSED
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0018   (0x0008)  
	FString                                            XboxToken;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGameServerRegionsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGameServerRegionsRequest : FPlayFabRequestCommon
{ 
	FString                                            BuildVersion;                                               // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientGetLeaderboardRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	int32_t                                            MaxResultsCount;                                            // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0018   (0x0008)  
	int32_t                                            StartPosition;                                              // 0x0020   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FString                                            StatisticName;                                              // 0x0028   (0x0010)  
	bool                                               UseSpecificVersion;                                         // 0x0038   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	int32_t                                            Version;                                                    // 0x003C   (0x0004)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardAroundCharacterRequest
/// Size: 0x0040 (64 bytes) (0x000008 - 0x000040) align 8 MaxSize: 0x0040
struct FClientGetLeaderboardAroundCharacterRequest : FPlayFabRequestCommon
{ 
	FString                                            CharacterId;                                                // 0x0008   (0x0010)  
	FString                                            CharacterType;                                              // 0x0018   (0x0010)  
	int32_t                                            MaxResultsCount;                                            // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
	FString                                            StatisticName;                                              // 0x0030   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardAroundPlayerRequest
/// Size: 0x0048 (72 bytes) (0x000008 - 0x000048) align 8 MaxSize: 0x0048
struct FClientGetLeaderboardAroundPlayerRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	int32_t                                            MaxResultsCount;                                            // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0028   (0x0008)  
	FString                                            StatisticName;                                              // 0x0030   (0x0010)  
	bool                                               UseSpecificVersion;                                         // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	int32_t                                            Version;                                                    // 0x0044   (0x0004)  
};

/// Struct /Script/PlayFab.ClientGetLeaderboardForUsersCharactersRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetLeaderboardForUsersCharactersRequest : FPlayFabRequestCommon
{ 
	FString                                            StatisticName;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPaymentTokenRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPaymentTokenRequest : FPlayFabRequestCommon
{ 
	FString                                            TokenProvider;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPhotonAuthenticationTokenRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPhotonAuthenticationTokenRequest : FPlayFabRequestCommon
{ 
	FString                                            PhotonApplicationId;                                        // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerCombinedInfoRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetPlayerCombinedInfoRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	class UPlayFabJsonObject*                          InfoRequestParameters;                                      // 0x0010   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0018   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerProfileRequest
/// Size: 0x0028 (40 bytes) (0x000008 - 0x000028) align 8 MaxSize: 0x0028
struct FClientGetPlayerProfileRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            PlayFabId;                                                  // 0x0010   (0x0010)  
	class UPlayFabJsonObject*                          ProfileConstraints;                                         // 0x0020   (0x0008)  
};

/// Struct /Script/PlayFab.ClientGetPlayerSegmentsRequest
/// Size: 0x0008 (8 bytes) (0x000008 - 0x000008) align 8 MaxSize: 0x0008
struct FClientGetPlayerSegmentsRequest : FPlayFabRequestCommon
{ 
};

/// Struct /Script/PlayFab.ClientGetPlayerStatisticsRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetPlayerStatisticsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            StatisticNames;                                             // 0x0010   (0x0010)  
	TArray<class UPlayFabJsonObject*>                  StatisticNameVersions;                                      // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerStatisticVersionsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGetPlayerStatisticVersionsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            StatisticName;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerTagsRequest
/// Size: 0x0030 (48 bytes) (0x000008 - 0x000030) align 8 MaxSize: 0x0030
struct FClientGetPlayerTagsRequest : FPlayFabRequestCommon
{ 
	class UPlayFabJsonObject*                          CustomTags;                                                 // 0x0008   (0x0008)  
	FString                                            Namespace;                                                  // 0x0010   (0x0010)  
	FString                                            PlayFabId;                                                  // 0x0020   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayerTradesRequest
/// Size: 0x0010 (16 bytes) (0x000008 - 0x000010) align 8 MaxSize: 0x0010
struct FClientGetPlayerTradesRequest : FPlayFabRequestCommon
{ 
	ETradeStatus                                       StatusFilter;                                               // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0009   (0x0007)  MISSED
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromFacebookIDsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromFacebookIDsRequest : FPlayFabRequestCommon
{ 
	FString                                            FacebookIDs;                                                // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest : FPlayFabRequestCommon
{ 
	FString                                            FacebookInstantGamesIds;                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGameCenterIDsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGameCenterIDsRequest : FPlayFabRequestCommon
{ 
	FString                                            GameCenterIDs;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGenericIDsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGenericIDsRequest : FPlayFabRequestCommon
{ 
	TArray<class UPlayFabJsonObject*>                  GenericIDs;                                                 // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromGoogleIDsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromGoogleIDsRequest : FPlayFabRequestCommon
{ 
	FString                                            GoogleIDs;                                                  // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromKongregateIDsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromKongregateIDsRequest : FPlayFabRequestCommon
{ 
	FString                                            KongregateIDs;                                              // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest
/// Size: 0x0018 (24 bytes) (0x000008 - 0x000018) align 8 MaxSize: 0x0018
struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : FPlayFabRequestCommon
{ 
	FString                                            NintendoSwitchDeviceIds;                                    // 0x0008   (0x0010)  
};

/// Struct /Script/PlayFab.ClientGetPlayFabIDsFromPSNAccountIDsRequest
/// Size: 0x0020 (32 bytes) (0x000008 - 0x000020) align 8 MaxSize: 0x0020
struct FClientGetPlayFabIDsFromPSNAccountIDsRequest : FPlayFabRequestCommon
{ 
	int32_t                                            IssuerId;                                                   // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            PSNAccountIDs;                                              // 0x0010   (0x0010)  
